[
  {
    "restaurant": "PAI",
    "review": "Pretty good food, not blow your socks off, but good.",
    "rating": 4,
    "date": "02/19/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food and huge variety.",
    "rating": 5,
    "date": "02/19/2026",
    "aspects": {
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Consistently good. Good portion sizes, great flavours. We have been here many times and have tried various things, and we have never been disappointed.",
    "rating": 5,
    "date": "02/18/2026",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I would give 5 stars if they make a better Mango sticky rice. I ordered Thai milk tea, papaya salad, khao san. Thai milk tea is so goood, 1000/10, strong tea and sweet enough. Papaya salad 1000/10, strong flavor, good combination with all topping, authentic taste. Khao san 10/10, I wish they have a fresh coconut cream for this dish as it still tastes a canned coconut cream, but it makes sense as we do not have a fresh coconut here. Mango sticky rice, I am so sorry but I think it can be much better, the coconut cream is tasteless, mango is not sweet (I can understand for the mango, but for the coconut cream, it makes me feel disappointed, especially for a place with a Michelin star.",
    "rating": 5,
    "date": "02/18/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Peerless performance.",
    "rating": 4,
    "date": "02/18/2026",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food and incredibly quick service. Staff were nice and made good recommendations.",
    "rating": 5,
    "date": "02/18/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Pad Thai + Khao Soi = Perfection. 🍜 Everything was so delicious. Toronto, I’ll be back for this for sure! 10/10 would recommend.",
    "rating": 5,
    "date": "02/17/2026",
    "aspects": {
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We came here on a weekday evening and were pleasantly surprised by the atmosphere and vibes! We ordered the Beef Khao Soi (definitely our favorite!!) and Chicken Pad See Ew, with Mango Sticky Rice for dessert, everything was delicious - will definitely be coming back to try more of their dishes!",
    "rating": 5,
    "date": "02/16/2026",
    "aspects": {
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We had a great meal here, no reservation but they seated us straight away.<br>The food was delicious, mocktails were great.",
    "rating": 5,
    "date": "02/16/2026",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Wish I would've had an opportunity to taste and rate their food. Unfortunately, while busy, they play games if you're a single diner. I waited patiently in line and was willing to be accommodating as they were busy. As the hostess started to seat me, another employee stopped her and had me wait to the side, then proceeded to seat another couple while I stood in the corner to wait at their convenience. If you're busy and need time to catch up, that's fine, but DO NOT seat other patrons while making others wait for no reason. Fwiw, the couple that got seated had been standing behind me the entire time as well and were not on any kind of reservation or wait list. VERY poor service and showed they only care about serving some, not all. If you're going to be by yourself there, beware they don't value your business like they do bigger parties.",
    "rating": 1,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive",
      "Price": "Negative",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The best Thai food in Toronto, order the Pad Gra Prow with OmniPork (it’s vegetarian but perfect for meat eaters too! Can also be made Vegan)<br><br>EJ is the server you want! Super fun to talk to and doesn’t miss any details!",
    "rating": 5,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Really great server Mayne!",
    "rating": 5,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Staff is always great!",
    "rating": 4,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Miles ahead of the competition.",
    "rating": 4,
    "date": "02/15/2026",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Go here for the vibe!",
    "rating": 4,
    "date": "02/15/2026",
    "aspects": {
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Visited as a tourist to try this popular spot. SOM TUM TAD (Papaya Salad) was good, but Pad Thai and Chiang Mai Braised Beef Noodle Soup were just average—the soup was too thick for me. Lowry cocktail was refreshing but not surprising, and Mango Sticky Rice was also nothing special.<br><br>Had to wait 20 mins to be seated even though tables were available. Some hits, some misses.",
    "rating": 4,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Always impressed here.<br><br>Delicious food, high quality ingredients, staff are courteous.",
    "rating": 5,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Have been going to PAI for over 10 years now. Delicious Thai food and my personal favourites are the pad gra pow and pad see ew. I typically go for curries but I find sometimes PAI’s curries lack the traditional spicy and flavour I love in Thai dishes, even when I ask for a spicer level. Otherwise a consistent staple in Toronto I always tell my friends and visitors to check out.",
    "rating": 4,
    "date": "02/14/2026",
    "aspects": {
      "Taste": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food & service are good.<br>Atmosphere is noisy, literally had to yell when talking so other people might heard you.",
    "rating": 5,
    "date": "02/04/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "10/10 recommend. Have been here twice, tried 5 different dishes and all were spectacular. It’s also a fun vibe and good prices.",
    "rating": 5,
    "date": "02/02/2026",
    "aspects": {
      "Ambience": "Positive",
      "Price": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I’ve been coming to PAI for years and while most of the food is consistently good, their Pad gra pow has been quite disappointing this time. The beef was underwhelming and the sauce was mediocre. It just seemed rushed.",
    "rating": 3,
    "date": "02/02/2026",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Overall Rating: 7.5/10<br><br>The vibe and service here were great. It feels like a cool underground bar and the music was solid.<br><br>I ordered the Mussaman Curry with beef and it was okay but not the best. There wasn't enough beef and the flavor was a bit underwhelming for me since I prefer it to be sweeter.<br><br>On the other hand, the Mango Sticky Rice was incredible. It was super fresh and one of the best I’ve ever had. Definitely a 9.5/10 for the dessert.<br><br>The bathroom situation was pretty bad. There is no separation between the urinals and it just felt low quality. 4/10 on that front.<br><br>I’d come back for the music and the sticky rice, but I’d probably try a different curry next time.",
    "rating": 4,
    "date": "02/01/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Neutral",
      "Taste": "Negative",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This restaurant was only list to try but it was always busy never had reservations on open table as well.<br><br>Finally last weekend I went it was buzzing at 7 pm and it was jam packed. As soon as you walk in it does you give you that vibe of Thailand pubs and they had wonderful decor inside from paintings and posters hanging on unfinished and rustic walls.<br><br>We had to wait for 30 minutes but we order khao soi, chiang mai noodles and gaeng panang curry and for drinks I got the good old Thai singha beer and tried their OG sangria. The drinks were good but the dishes blew me away and I was speechless. There is a reason why this place is on Michelin guide. Khao soi was so creamy and you could taste a sweet coconuts taste along with fishy paste taste as well and noodles were perfectly cooked along with tender meet.<br><br>Same with chiang mai noodles only thing is all 3 dishes had sweet after taste but I guess that’s just how Thai food is. Will be definitely back to try other dishes soon.",
    "rating": 5,
    "date": "02/01/2026",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral",
      "Taste": "Neutral",
      "Menu": "Neutral",
      "Drinks": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Thai Food!!! Ordered the Masaman curry which is now my new favorite!!",
    "rating": 5,
    "date": "01/30/2026",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Had an incredible experience at Pai. The food was packed with bold, warming flavors that felt just right for the weather. The meat was perfectly cooked, tender and full of flavor. Add to that a 10/10 vibe, and it’s easily a place I’d recommend!!",
    "rating": 5,
    "date": "01/26/2026",
    "aspects": {
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "You will probably need to wait for a seat but the food is worth it! Easily one of the best places to eat in Toronto at affordable prices.",
    "rating": 5,
    "date": "01/25/2026",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The whole night was amazing.<br>The food is really good and i'll return.<br>The portion are huge, the quality is good and the price is nice.<br><br>If you are looking for a nice Thai restaurant you found it ✨",
    "rating": 5,
    "date": "01/24/2026",
    "aspects": {
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "i love this place, food was amazing and honestly one of my favourite servers i've ever had. jade was incredble, taking everyone i know there, hope we get her again!!!",
    "rating": 5,
    "date": "01/20/2026",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food. Quick service. The Thai riceberry didn't sit well in my stomach. Probably won't have again but the pad Thai was delicious and the pork skewers too. This place gets really busy on a Friday night. Make sure you book reservations on open table to secure your spot. This place does not take any cash. It's a credit only place.",
    "rating": 4,
    "date": "01/20/2026",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food, but our server Jade G was so moody after we tipped 18%??",
    "rating": 2,
    "date": "01/19/2026",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Pad Thai in my opinion. We also had the flavorful spring rolls and BBQ skewers for the appetizers. Our first time there, and would definitely go back. The place is huge, and the staff were always busy - a little too busy. Quite a fast paced experience.",
    "rating": 5,
    "date": "01/19/2026",
    "aspects": {
      "Service": "Negative",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Decided to try something new as I’ve never had a bad meal at PAI. I asked the waiter about the KHAO PLA TAWT 'FRIED FISH' and she said it was really good. I got it and it did not disappoint.<br><br>The fish was perfectly fried. The batter was flavourful, crispy, and light. It wasn’t greasy and the fish was nice and flaky. The green curry sauce was delicious and had a little bit of spice. Would recommend if you’re looking to try something new and different.",
    "rating": 5,
    "date": "01/19/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Came here for a work dinner and had a fantastic time. The restaurant was really great at making accomodations for the different dietary needs, and the food came out quickly, hot and really generous portions. We had so many leftovers but they were all delicious. The curries have so much depth of flavour, definitely recommended for others to try. Just make sure you get there early or making reservations if you can, or book the private area, it gets busy!",
    "rating": 5,
    "date": "01/18/2026",
    "aspects": {
      "Taste": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great atmosphere and amazing Thai dishes.<br>The service is quick and the food arrives fresh and piping hot.<br>Kudos to our server Nathan V for making the dinner experience extra enjoyable. He was professional, courteous, and very helpful throughout.",
    "rating": 5,
    "date": "01/17/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "GENTLE FEEDBACK<br><br>PAI is always great when it comes to food, even with delivery. That’s why I’m still rating 4 stars because I believe today was unusual for PAI’s standards.<br><br>My partner and I ordered Pad Gra Prow through doordash. Today’s dish had couple prep issues: unpeeled whole garlic and a sprouted onion core. This is very unusual and the food was still excellent. I just thought it might be helpful for PAI to be aware.",
    "rating": 4,
    "date": "01/17/2026",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing atmosphere. Feels like stepping into another country. Love how small and condensed everything feels. The food is definitely worthy. Highly recommend the shrimp chips and Khao Soi. Super great selection of food and drink.<br><br>I also personally thank our waitress for switching a drink with another one when we mistakenly ordered.<br><br>Highly recommend for anyone in the area",
    "rating": 4,
    "date": "01/16/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Really enjoyed this restaurant.  Very busy so make sure you book!",
    "rating": 5,
    "date": "01/13/2026",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Absolutely amazing food, great service. Very recommended",
    "rating": 5,
    "date": "01/13/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food, great atmosphere. You wouldn’t be able to tell you were in Toronto in the dead of winter other than the giant jackets people had to bring in.",
    "rating": 5,
    "date": "01/13/2026",
    "aspects": {
      "Ambience": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We had 4 adults, a 8 year-old, a 3 year-old and 1 baby tonight. We were told there would be a fixed 20% tip we had to pay for a group more than 6 people. I doubt why a 3 year-old and a baby were counted as grown ups?!<br><br>It's only because my guests were here with us and they liked Thai food, that's why we still went ahead.<br><br>My husband and I felt very unfair and ridiculous about this policy that gratuity should be based on how happy we feel about the service but not the number of people. Also, we never been to a restaurant that dare to force customers to pay 20% of tips that a baby also counted as 1 customer. We will ever never go back to any Pai restaurants.",
    "rating": 1,
    "date": "01/13/2026",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Thai food in town",
    "rating": 5,
    "date": "01/12/2026",
    "aspects": {
      "Food Quality": "Neutral",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Poor customer service",
    "rating": 1,
    "date": "01/12/2026",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Neutral",
      "Taste": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Omg the food was AMAZING!! Cute environment, friendly staff. You have to try it",
    "rating": 5,
    "date": "01/11/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We went here for my friend'd 40 birthday and the food was amazing..worth the 30 mins wait",
    "rating": 5,
    "date": "01/11/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Excellent Thai spot all over. The place is generally packed so better make reservations or be there super early. The service is exceptional, food is delicious, and the vibe is super hip.",
    "rating": 5,
    "date": "01/10/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Almost everything here is delicious 😋",
    "rating": 5,
    "date": "01/09/2026",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Always crowded. Waiting time long but worth for the food",
    "rating": 5,
    "date": "01/07/2026",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive",
      "Location": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food was delicious, generous portions and came out fast.",
    "rating": 5,
    "date": "01/07/2026",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I tried Thai food and really liked it. The dishes were spicy and full of flavor. Everything was fresh and well cooked. I enjoyed the food and would like to try it again.",
    "rating": 5,
    "date": "01/07/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Top tier. Thats it. Top tier.<br>We've been to both Kiin and Pai multiple times and the food never fails to leave us in awe",
    "rating": 5,
    "date": "01/05/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Excellent Pad Thai, Laab Salad, and Gree Curry. All perfect.",
    "rating": 5,
    "date": "01/05/2026",
    "aspects": {
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food and atmosphere! The food is definitely worth checking out, they've earned their ratings.",
    "rating": 5,
    "date": "01/04/2026",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Walked in with a family of 4, service was very friendly and accommodating. Dishes were well seasoned and were not overly salty like other Thai places I’ve been too. I love their chilly sauce and would be back for more.",
    "rating": 5,
    "date": "01/04/2026",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My favourite Thai spot to eat at in the GTA, food is always so fresh and the atmosphere is so lively and welcoming. The mango salad and pad Thai are 11/10 HIGHLY RECOMMENDED THIS PLACE IF YOU LIKE THAI <3",
    "rating": 5,
    "date": "01/04/2026",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great tasting food, excellent service. If you need to reserve a table do so at least a week in advance<br>Very flavorful dishes<br>Funky decor<br>Old school music softly  playing<br>playing, producing a great vibe",
    "rating": 5,
    "date": "01/03/2026",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral",
      "Taste": "Neutral",
      "Menu": "Neutral",
      "Food Quality": "Neutral",
      "Desserts": "Neutral",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Pai never disappoints its jus the wait times. Dear Pai Management, dnt you think, given, you are sooooo popular that you SHOULD (MUST) expand...in DownTown TO!!!",
    "rating": 5,
    "date": "01/01/2026",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great experience. The staff was excellent. The service was completely thumbs up. And the food was delicious.",
    "rating": 5,
    "date": "12/31/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Pai is a 10/10 experience. The food is absolutely outstanding, the cocktails are beautifully made and the vibe is very cool and unique. The pricing is great for a spot this awesome and everything on the menu looked fantastic. You really can't go wrong visiting Pai and enjoying their elevated Thai cuisine. Be prepared to wait if you don't have a reso but just know, it's 100% worth it!",
    "rating": 5,
    "date": "12/31/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Recommend this place to anyone that loves Thai food!  We came here for dinner and loved everything we ate.  I would advise to make a reservation way in advance as this place was packed with a line out the door on a weekend at around 6:00PM.  We didn’t have a reservation and for a party of two, we only had to wait about 15 - 20 minutes.<br><br>For apps we ordered the Thai Sausage, delicious and packed with flavor.  The Pad Gra Prow and Tom Yum soup were also excellent.  I recommend ending the meal with the classic Mango with Coconut Sticky Rice.  Comes with a big slice of mango on top sweet sticky rice.<br><br>Service was okay.  Our server seemed uninterested and very monotone.  She was a person of very few words.  At the beginning I asked where the restrooms were, she blankly stared back and said “I think they are over there.”  I thought to myself, those were very interesting choice of words.  She hardly checked on us and did not really interact with our table or the tables around us.  She spent most of her time talking and laughing with her fellow coworkers.<br><br>Thankfully the food was so good that it compensated for the lack of service.",
    "rating": 4,
    "date": "12/31/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Never disappoints. Best thai food across the GTA. My personal favourites are the Pad Sew Ew and Khao Soi. They’re saucy, spicy, and fragrant in their own ways. I get these almost every time I go haha",
    "rating": 5,
    "date": "12/31/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The chicken pad thai at Pai Downtown is outstanding! The noodles were perfectly cooked and the sauce hit that ideal sweet, savoury, spicy and tangy note without being overpowering. The chicken was tender and well-seasoned, and the dish was generously topped with crunchy peanuts and fresh herbs that added great texture and brightness. Every bite felt comforting yet elevated, staying true to authentic flavours while still feeling refined. Easily one of the best pad thais in the city and a must-order at Pai.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This will likely be an unpopular opinion, but figured I’d share a brief anecdote.<br><br>Pai was one of our favourite restaurants in the city, yet I haven’t been back since I got married at city hall. We booked a reservation in advance for my family and my wife’s (10 total). Told them it was our wedding lunch (during a weekday) and wanted to celebrate there since we had had several early dates there.<br><br>After arriving early, we had to wait 30mins past the time of our reservation, and upon being seated in a bad/tight location, we were told to be quick because it’s busy. Near the end of the meal the servers were trying to close us out to flip the table.<br><br>I get it’s Toronto, and it’s a popular spot, was just hoping for a bit more tact due to the occasion.<br><br>Food is awesome. I doubt this review will impact them at all.",
    "rating": 4,
    "date": "12/30/2025",
    "aspects": {
      "Service": "Neutral",
      "Location": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Visited Pai during a trip to Toronto and I was pleasantly surprised.  The place was full and super lively, they have a great bar at the front so you can have a drink while you eait to be seated. The atmosphere was lively and friendly in a real Canadian way. And the food was really phenomenal and authentic. The oxtail was so delicious, the rice was fragrant, the salad super fresh. The drinks were amazing, the service was great. Nothing bad to say about this place.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food was delicious! Service was attentive! And the vibes were high. My favourite thing was the music though!! So perfect",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious Thai food, made even better by the warm and attentive staff.<br><br>We waited about an hour to be seated, and since it was a busy weekend lunch, service was a bit slow at first—getting water and placing our order took some time. Once things got going, though, the experience improved.<br><br>We started with the Thai chicken appetizer, which was excellent. Our server explained the sauces, which made trying new flavors much more enjoyable.<br><br>We ordered two main dishes, and overall the food was very good. My spouse mentioned it was the best Pad Thai he’s ever had. We’d love to come back and try more dishes, preferably at a quieter time.<br><br>At first, it seemed like there wasn’t a dedicated server per table, which felt a little unusual. However, any staff member passing by checked on us, and it actually felt convenient and welcoming.<br><br>The prices were slightly on the higher side, but the service helped make it feel worth it.",
    "rating": 4,
    "date": "12/30/2025",
    "aspects": {
      "Service": "Neutral",
      "Price": "Neutral",
      "Taste": "Neutral",
      "Menu": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great dining experience. Food is superb! Staff are very accommodating and you can sense the positive vibes among them.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We came to Toronto for my birthday, and we chose to do my bday dinner here. We came in at 5:30 pm without reservations and the 3 of us got seated within 10 minutes! The music was bumping, the food was bomb, and the service was impeccable (thank you, Judy V!). I’ve been craving some good Thai food and I cannot recommend Pai enough.",
    "rating": 5,
    "date": "12/29/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Definitely some of the best Thai food I've had in a very long time!<br><br>Husband and friend both got the Thai tea and really seem to like it. I tried it but it was fairly too sweet for me.<br><br>Mango Slaw was absolutely beautiful. It was so perfectly sweet savery and something I would finish up on my own without wanting to share it. But unfortunately your family style haha<br><br>Pad Thai was hands down some of the best I ever had. It really had some unique flavor to it and was the perfect amount of spicy (we asked for medium). So easy to just finish up a whole bowl of this.<br><br>No words to say about that Chicken Satay skewers. Most places make the chicken too dry when you get this saute but this was perfect! Actually juicy pieces of chicken and I have no idea how they do it. Outside of the usual peanut sauce there was also some other transparent liquid there and it was so even plain LOL.<br><br>Pad Gra Pow - My first time trying this and it was quite a delight. Rice was quite fresh and a really good amount of meat which was appreciated. Went perfectly well together with that egg on top.<br><br>The place itself has quite a nice aesthetic and we had almost a 40 minute wait time so I would recommend going early.",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great ambiance and decor, friendly service and outstanding food. Cocktails are on the sweeter side. The coconut sorbet is an absolute must have.",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Drinks": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This place is so freaking good we went two days in the row. Amazing flavor, big portions, fast service at a very reasonable price points. Hats off to this crew, absolutely amazing!",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Omg! My wife recommended this place and Wow! It did not disappoint. We got everything we ordered within 12 minutes (not exaggerating, except for dessert because it came later of course). It felt like we had a different staff member each time checking in on us. The food was delicious, my favourite was the garlic tofu crispy on the outside & chewy on the inside. The desert Thai tea sorbet so delicious in itself but the coconut puces were the cherry on top. Perfect for a date or for groups. Will be back next time we’re in town. Thank you to the whole staff & happy holidays!!",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My fav place for thai food in downtown toronto. Everything we go here, our experience is amazing 👏 🤩 ✨️",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food is very good and the service is excellent. The price is just. I recommend this place to have a nice family dinner. The food portions are big so I recommend that you arrive hungry.",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "HIP HOP BROCKLIE BEEF. YA. TOP 5 RESTAURANTS IV EVER EATEN @",
    "rating": 5,
    "date": "12/28/2025",
    "aspects": {
      "Food Quality": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "First dinner in Toronto. Showed up without reservation and been on waitlisted for 25 min. Ordered chicken satay as an appetizer and it came after the main meal…food was good, and vibe is great (louder than normal Thai restaurant). Make a reservation instead of showing up like me.",
    "rating": 4,
    "date": "12/27/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Very tasty and very nice people",
    "rating": 5,
    "date": "12/27/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "An incredible place to eat, feel cozy and get a true Thai experience. I had first heard of this place when I read an interview with Guillermo Del Toro about what restaurants he likes to eat at when in Toronto. Because of his star studded recommendation, I knew I had to try it. It is a Michelin rated restaurant and for good reason. I tried to get a reservation but they are completely booked for all of September and probably a lot of January. Because of this, we knew we had to get there early, maybe even before they open to avoid the average 20-40 minute wait times.<br><br>We got there at 3:45, there were already three groups of people ahead of us. At 3:55pm, the line grew very long on both sides of the door and until we left around 5:30pm, the waiting area was full, and people had not stopped coming through the front door the entire time we were there.<br><br>The staff are all extremely warm and welcoming. Every person we interacted with from the first person who greeted us, to the next person who sat us, to the person who brought us our drinks to our server, every one gave a smile and had a warm tone. This was a distinction that truly made me feel welcome and as though they were truly happy we were there.<br><br>The food came out so hot and deliciously flavourful. we started with some green tea which came in a traditional cast iron pot. It was so rich with history that it set the tone for the evening. Then we got the pork skewers and they were the best skewers I’ve ever had. The sauce was sweet, savoury and perfectly sticky complete with a fire roasted char that took them over the edge. I would have kept eating these all night. We each got a different main dish and they were amazing, however, we decided that we have to come back to try more of the smaller plates and share. It seemed as though that is what every table around us was doing and because of the extensive menu, we know we have to come back to do the same.<br><br>We got the Thai Spicy pad Thai and my husband said it was the best pad Thai he’s ever had in his life. He also started sweating when he finished his meal but he said his mouth was not on fire! I got the showstopper coconut noodle dish with the fried noodles that come standing up and it was awesome. If you like the island flavour of coconut this dish is for you. The Green curry was superb. Exceptionally flavourful and balanced. I think serving the sticky rice in a tied banana leaf is truly a beautiful touch that really added to the experience.<br><br>Honestly, this was an exceptional place through and through. Cannot wait to be back to try the rest of the amazing dishes. It definitely gave the impression that anything you order here is going to be amazing!!",
    "rating": 5,
    "date": "12/26/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Location": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "It was crazy busy but some of the folks handling those waiting for tables could use lessons in being  courteous.",
    "rating": 3,
    "date": "12/25/2025",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "In 2025, I’ve been trying foods from different countries and cities, and on my food spree I went to Pai to try some Thai cuisine. As far as I can remember, I ended up having the worst meal of 2025 there. That experience actually made me really grateful for all the amazing food I’d eaten throughout the year from China, Japan, Korea, the Middle East, and more.<br>At one point, I had started to think that food was always good or super good, and that the kind of food that makes you say “yuckk 🤢” didn’t really exist anymore. That was true right up until I tried the dish in the photos I had in Pai.",
    "rating": 1,
    "date": "12/24/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "There was a short wait when I visited. I had high expectations since it’s a Michelin restaurant. The food was good, but I didn’t really feel there was anything special compared to regular restaurants. The Pad Thai was tasty, as it’s one of their signature dishes. The curry was surprisingly delicious — I didn’t expect it to be that good. We were three people and shared three dishes, which was just the right amount of food. However, I didn’t feel very comfortable when the staff directly asked us to leave the table right after we finished eating since there were people waiting.",
    "rating": 5,
    "date": "12/24/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing food and atmosphere. I’ll definitely go back.",
    "rating": 5,
    "date": "12/24/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food has been 10/10 each time but service is too fast I don’t even get time to finish my starter and the main is already there",
    "rating": 4,
    "date": "12/21/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My go to restaurant for some wholesome and tasty Thai food, Chef’s special pad Thai is to die for and do not forget to try their Thai iced tea",
    "rating": 5,
    "date": "12/21/2025",
    "aspects": {
      "Desserts": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is one of Toronto’s most popular spots for Thai cuisine and is a must-visit for tourists who enjoy bold flavors and lively atmospheres. The restaurant is usually busy, which adds to its energetic and authentic feel.<br><br>The menu offers a wide variety of well-balanced dishes, beautifully presented and full of color, making it very photo-friendly. The interior design is cozy and vibrant, with warm lighting that works well for food photography, especially in the evening.<br><br>Service is efficient and friendly despite the crowds. Waiting times can be long during peak hours, but the experience is well worth it.<br><br>Overall, PAI delivers consistently excellent food and a fun dining experience that represents Toronto’s diverse food scene very well.",
    "rating": 5,
    "date": "12/21/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Neutral",
      "Taste": "Neutral",
      "Menu": "Neutral",
      "Food Quality": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Hands down the best Pad Thai I’ve ever eaten.",
    "rating": 5,
    "date": "12/21/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Service is great! Signature plate are definitely worse a try",
    "rating": 4,
    "date": "12/20/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "There is a reason why PAI gets so busy and packed at all hours of the day. Their food is just THAT good.<br><br>This is one of the best spots in Toronto for Thai food. Even for drinks this spot is great!! They have vegan and vegetarian options, also non alcoholic drinks as well. The Thai latte was so good. It’s honestly my new favourite drink. It reminds me of masala chai. So good!!!!<br><br>If you havnt been to PAI yet, definitely put it on your list. It’s a must! But make sure to make reservations or be ready to wait around 10 min for a table because it’s so busy here. The bathrooms were clean, lots of spots to sit inside, decor was so cute, waiters were very friendly and accommodating, prices were reasonable. Atmosphere was great here, I would definitely come again.",
    "rating": 5,
    "date": "12/19/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This Thai restaurant is a true gem. From the moment you walk in, you’re greeted with warm, friendly service and a cozy, inviting atmosphere. The food is outstanding—fresh, flavorful, and perfectly balanced. The Pad Thai was rich and savory, the curry was fragrant with just the right amount of spice, and the ingredients tasted incredibly fresh. Portions were generous, prices were reasonable, and everything came out quickly. Whether you’re a fan of classic Thai dishes or trying something new, this place delivers every time. Highly recommend and will definitely be coming back!",
    "rating": 5,
    "date": "12/18/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Thai ice cream!",
    "rating": 5,
    "date": "12/18/2025",
    "aspects": {
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food is always incredible no matter what you get and the price for the food in unbeatable.<br><br>Service really can be depending on the day. I've had great ok service and really bad service. It is just the luck of the draw...",
    "rating": 5,
    "date": "12/16/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The place is always packed to the brim which is of course very well deserved with the amazing food and excellent service. Portions are generous in size and the appetizers are the star of the show. Do line up early as there is always a wait!",
    "rating": 4,
    "date": "12/15/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food is great and consistent, if a bit pricey. Love the Pad Thai, Pad See Ew and Coconut-topped Pandan chiffon. Staff are always busy because the place gets quite full. Expect a bit of wait.",
    "rating": 5,
    "date": "12/14/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We had green curry and mango sticky rice, symphony of flavors in my mouth. Outstanding!!",
    "rating": 5,
    "date": "12/13/2025",
    "aspects": {
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food was not as good as expected. I remember years ago, I really enjoyed Pad thai at PAI.. maybe I should have ordered pad thai to be safe. Kao soi wan’t warm enough, and panang curry was too salty to my taste (I usually eat quite salty.. but this was too much). And it was too loud to enjoy conversation.",
    "rating": 3,
    "date": "12/13/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food and service were good. No complains!<br><br>But the seating space was tight and the seats were good to accommodate slim people.<br><br>The owners shall work on making the seating arrangement wide and better.",
    "rating": 4,
    "date": "12/13/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Had a wonderful meal with friends. The food was delicious and savoury. The service was excellent. I would recommend any time.",
    "rating": 5,
    "date": "12/13/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "First time there. Won't be there last time. Great food and awesome staff. As busy as they were service was fast and super friendly.",
    "rating": 5,
    "date": "12/13/2025",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food, wonderful servers and great atmosphere where its not too loud to hear your table partners!",
    "rating": 5,
    "date": "12/12/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Just go! I usually travel to Orillia for phenomenal thai food but Pai I think blew them out of the water! Everything tasted just like it did when I toured Thailand.  Great staff, lovely atmosphere & delicious fare & bevies!",
    "rating": 5,
    "date": "12/12/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "It's a nice cozy place with great vegan /vegetarian food.",
    "rating": 4,
    "date": "12/12/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Came here for lunch before heading to a show at the Princess of Wales. The restaurant opened at 11:45am, and it was already so packed by the time we arrived at 12:00pm. We ordered three dishes (shrimp tom yum soup, pork laab salad, and beef pad see ew), and service was quick. Food could've been served hotter. The tom yum was flavorful and the perfect amount of tartness. The laab salad lacked herbs and toasted rice powder, and the pad sew ew lacked that smokey wok flavour. Overall, very mid meal. I'll probably not be back given how many really good Thai options have popped up in the city in the last few years.",
    "rating": 2,
    "date": "12/11/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is amazing! The food is full of flavour, the service is quick and friendly, and the atmosphere is warm and lively. One of my favourite places in downtown Toronto.I definitely recommend this place 10/10",
    "rating": 5,
    "date": "12/10/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Since I have moved to Toronto 5 years ago, PAI has been the most referenced restaurant in the city. It seems like when anyone asks for a food recommendation downtown, \"Have you been to PAI?\" is always part of the response. I've been there quite a few times in the past few years, and although I hate what hype does to the perception and expectations we have of food, I have to admit everything on their menu is pretty damn good. A few of my personal favorites are the spring rolls, the signature pad thai, the green curry, and the mango sticky rice.<br><br>Although the food is really good, the price is also up there. For one appetizer and two mains, our latest lunch there cost around $85, including 15% tip and tax. I'd imagine most people don't want to pay $40+ for one and a half spring rolls and a pad thai. PAI also always has a line. You should expect to wait at least 15–20 minutes no matter the time. That's obviously not their fault, and is actually a testament to their success, but the wait should definitely still be mentioned. Khao San Road is a good option nearby for the same quality, but you might also have to wait a bit. Bangkok Queen Thai Street Food is a bit further, but also pretty solid and is never busy.<br><br>All in all, PAI is a must-try for Thai food lovers, but isn't worth more than 25 minutes of wait IMO, and is way too pricey.",
    "rating": 4,
    "date": "12/09/2025",
    "aspects": {
      "Service": "Neutral",
      "Price": "Neutral",
      "Food Quality": "Neutral",
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "It was not the best thai food!",
    "rating": 4,
    "date": "12/09/2025",
    "aspects": {
      "Food Quality": "Negative",
      "Desserts": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Super Thai food, nothing to say, just enjoy!",
    "rating": 5,
    "date": "12/09/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Loved the vibe and loved the food! We came by on a Saturday night around 5:30PM and only waited 10 min for a table. The main dining area is very cramped and loud, but luckily we were seated in the \"market\" area which was nicer and calmer. The \"same same\" area looked inviting too. Our server EJ was amazing from beginning to end. He was super attentive, kind and had a great sense of humour. The cocktails were delicious!! We ordered the bengal leaf wrap appetizer which was presented beautifully and super fresh. We also shared the pad see ew and oxtail in tomato broth with rice. Everything was incredible. Food came quickly even though the restaurant was busy. We were celebrating a belated birthday and EJ brought a complimentary mango ice cream! It was a great dining experience!",
    "rating": 5,
    "date": "12/08/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Neutral",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Location": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is outstanding! I try a couple thai spots in almost every city I go to and this place takes the cake for Toronto! 😋<br><br>The Papaya salad was among the best I’ve ever had. Also ordered the green curry,  fritters, and pad thai —all fantastic too. 5/5<br><br>Atmosphere was quite nice n vibey. People were lovely. My only regret is not coming here earliier",
    "rating": 5,
    "date": "12/06/2025",
    "aspects": {
      "Ambience": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Tasty with room for improvement!<br><br>Went here based on good reviews and supposedly one of the best Thai in the city.<br><br>I had only one dish, Khao Soi and it my first time trying it, but I had plenty of Thai before.<br><br>So good:<br>Taste and smell. 8/10<br>The food was really good. Aroma, balance of flavours, tons of umami. It was definitely not “Thai spicy”, but the balance was right and it tasted delicious.<br>They do provide heat on the side, but that would ruin the balance.<br>Curry/soup should be a bit thicker and a more noodles. Beef was dry-ish.<br>Still, it was a great dish that I truly enjoyed and would love to eat again.<br><br>Bad: atmosphere/service. Feels more like a brown pub. Even with Christians decorations. I rarely care about “atmosphere”, but this was to sad.<br>Service was OK. Took order, gave me food, gave me check. Proposed tip starts at 18%.<br><br>The ugly:<br>Food came out super quickly, but was lukewarm. It was definitely standing on the counter for at least 10 minutes (wrongly prepared for someone else?).<br>Crispy things were all soggy.<br>I decided not to send it back, but was close to ask to at least microwave it for me.<br><br>The price after tax and tip was about 30$ for one dish. At this price, you MUST be able to serve hot food.<br><br>Fix those issues (easy fix tbh) at it would be a 5* place.<br><br>I keep it on my Thai list, but won’t returning anytime soon, I’ll give a shot to other places first.",
    "rating": 3,
    "date": "12/05/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "wow the food was just amazing",
    "rating": 5,
    "date": "12/04/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Loved the Coconut Dessert and Pad thai!",
    "rating": 5,
    "date": "12/03/2025",
    "aspects": {
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food is superb. You cannot go wrong with any item here. Loved the crispy prawn starter, khau soi, the crispy pork dish and more. The walk in took 40 minutes on a week day. Would highly recommend making reservations.",
    "rating": 5,
    "date": "12/03/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The atmosphere of this place is really cozy and nice but is very crowded. I had to be wait listed at 2pm for 20 minutes but that wasn’t an issue for me. The food is genuinely immaculate. I got three dishes and all of them were unique and delicious in its own way. The servers were all very nice and pretty quick. The bathroom was clean.<br>Overall I would definitely make a stop here if you are into Thai food.",
    "rating": 5,
    "date": "12/02/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We had to wait about 25 minutes for a table on a busy Saturday evening. Food was good, but we have enjoyed other Pai locations more. We especially like the Som Tum Tad (salad). It would've been a a better vibe if it were quite so busy. There was even a line for the Ladies' room.",
    "rating": 4,
    "date": "12/02/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We had beef Pad Thai and beef Khao Soi, and both were delicious, but the Pad Thai was the standout for me!  I would definitely come back just for that. The atmosphere was warm and inviting, and the service was friendly and attentive. Overall, a great experience at this Michelin Guide–featured Thai restaurant!",
    "rating": 5,
    "date": "12/02/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food is really good. Service is quick and atmosphere is nice. Would recommend making a reservation in advance.",
    "rating": 5,
    "date": "12/01/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing place with food that doesn’t disappoint. The whole restaurant has a very unique vibe to it which me and my wife loved. 10/10 would recommend!",
    "rating": 5,
    "date": "12/01/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My wife was dining with a friend at the downtown location and experienced a serious medical emergency, requiring paramedics to arrive and hospitalization for 1 week. Not only did the restaurant refund them their meal without hesitation, they continued to check in on my wife’s condition throughout her hospital stay. They even sent a beautiful flower arrangement to her room. It’s hard to find words for how grateful we are to the team at Pai for their compassion and kindness. It has helped us navigate this stressful time and we will never forget it. From the bottom of our hearts, thank you Pai.",
    "rating": 5,
    "date": "11/30/2025",
    "aspects": {
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Thai food in town. If you happen to be visiting Toronto, this restaurant should be in your bucket list. Make sure you make reservations in advance or else be prepared to be in long waiting list.",
    "rating": 5,
    "date": "11/30/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Very good food! very crowded as it is so popular. But as a single person, you can walk in and get quickly seated at the bar. The waiters are attentive.<br>I got the Khao soi noodles. The broth was creamy, spicy, fragrant and delicious. If I’m being picky, the crispy noodles I wasn’t a huge fan of and they were hard to eat. The tofu could’ve been cut smaller. But these are minor things. I’d definitely go back. Also great if you’re downtown for a musical or play, as it’s in the right area.",
    "rating": 4,
    "date": "11/28/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This place sounds like the Giggles Emporium?! The amount of billowing cackling was insane not sure if guests where trying to unconsciously trying to out laugh other guests but my goodness. Insanely noisy. Food is mid, I’ll never go back.",
    "rating": 1,
    "date": "11/28/2025",
    "aspects": {
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This place is always bustling with people, giving off the vibes of a weekend night in Pai. The staff are energetic and incredibly friendly.<br>Despite being packed with customers, the food came out really fast. Hands down the best Thai restaurant outside of Thailand.<br><br>My recommendation is to start with the Garlic Tofu and Mango Slaw. The Khao Soi is a must, bursting with flavor. We tried it with braised beef this time, and it was cooked to perfection: super tender and rich. My go-to entrée is the Khao Pla Tawt (golden fried fish). It’s crispy on the outside, while the meat is tender enough to fall apart easily, pairing perfectly with their homemade green curry.<br><br>There are plenty of drink options. I’m on the sweeter side and love both their red and white sangria.<br><br>Can’t wait to come back!",
    "rating": 5,
    "date": "11/27/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food and service was great. Shout out to our server Eric as he gave great food recommendations.",
    "rating": 5,
    "date": "11/26/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "For original and delicious Thai food this is where we go<br>Considered the best Thai food in town<br>Normally it is full and there is waiting g today we were lucky as we went off time for lunch and did not have to wait  although there still was a crowd<br>For me this is a must visit place every once in a while<br>The food is yummy and has original Thai tastes and flavors<br>The chefs do a good job of it<br>The service is prompt and the atmosphere is lively<br>There is a full bar in case you are in the mood<br>Enjoy<br>Cheers",
    "rating": 4,
    "date": "11/25/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The BEST Thai restaurant I’ve ever been to! The green Thai curry with chicken was even better than the one u had in Thailand. If you come to Toronto, you HAVE to try it. You will not be disappointed.",
    "rating": 5,
    "date": "11/25/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This place is unassuming and incredible in every way, be it the food, (they serve vegan) the staff or the speed at which they deliver! We will definitely visit this place multiple times!!",
    "rating": 5,
    "date": "11/24/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great quality chicken pad Thai, very vibey if seated in the main room",
    "rating": 5,
    "date": "11/24/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Incredible. We weren’t able to make a reservation but walked in around 4PM on a Friday and were sat right away. Our server was so kind and he provided us with different recommendations and we are so glad we took them all. Spring rolls are a must, probably the best I’ve ever had. For dinner we had Khao Soi which was INCREDIBLE, the curry was perfectly balanced you could drink it ! The other dish we had was Pad Gra Prow with crispy pork and again wow, flavours, textures were so good. We also had drink the Lowry and Big Gradey Energy, and although I don’t often drink cocktails these are some I would drink over and over.<br>Thank you for a wonderful experience",
    "rating": 5,
    "date": "11/23/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food was honestly one of the best places I ever went to eat. It shows that they won many nominations, the care and love for the food, would def recommend. The music was really good too! But the place is a bit small, and it can get loud easily. Still, I would def come again when I get the chance!",
    "rating": 5,
    "date": "11/23/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We have been coming here for years until now. Portion size almost down to nothing. Server had less personality than Chatgpt.  Massaman curry was literally 4 tablespoons of curry and 4 mini potatoes for $23.00. Same party of 4 we go with and same dishes we order was 20 percent more expensive than last summer and 30 percent less food. We could have accepted the price increase but we left hungry and will never be back. Had a nice 5 year run of eating at Pai. Sadly all good things must end. Bye bye Pai. I'm sure your customers will disappear during your battle to maintain profit margins. Lots of info on Reddit validates my review as accurate.",
    "rating": 1,
    "date": "11/21/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Menu": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Had such a great dinner with my friends! The pad see ew & the khao soi were insanely good! Our server Arian was also very attentive and kind. Highly recommend coming here!",
    "rating": 5,
    "date": "11/20/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I love this Restaurent, it's so cozy and the food is amazing, i hope it doesn't get over crowded because of all of the press, very happy you can make reservations",
    "rating": 5,
    "date": "11/20/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Love this place. I have been many times over the years.  We have been to Thailand and had lots of Thai food. This is the only restaurant in Canada that I can find that truly gives us the true Thai flavours that we had in Thailand! Great food, great atmosphere!",
    "rating": 5,
    "date": "11/20/2025",
    "aspects": {
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food, oh my god, the food. I could not stop eating. I just wanted all the savoury items on the menu. Everything was better than the last.<br><br>Will I go again? Yes, because I never wanted to leave in the first place",
    "rating": 5,
    "date": "11/19/2025",
    "aspects": {
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This Thai spot was a good start to the trip. It was good, but was it the best Thai I ever had? No. I guess I had really high expectations.<br><br>We had a variety of dishes, the pad Thai, the fried rice, the Khao Soi, the braised beef soup. The only really unique dish was the braised beef soup. I never had this before and it was good.  The service was a bit spotty I think it was because we came at a weird time, late lunch/early dinner.",
    "rating": 4,
    "date": "11/19/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is arguable one of the most famous restaurants in Toronto- so the expectations were high. We managed to get in before an extremely large line formed. We got the Khao Soi and Pad Thai.<br><br>The Khao Soi was a little disappointing. The curry was great, but the noodles were flimsy and didn’t pick up much of the curry. The noodles felt overcooked or cheap. The curry is good though, but I’d rather eat it with rice than those noodles.<br><br>On the other hand, the pad Thai was delicious! One of the best I’ve had, and I’d definitely recommend it again.<br><br>Overall, depending on the menu item, it is not worth the high price.<br><br>Would love to come back to try more foods- thank you for having me! :)",
    "rating": 4,
    "date": "11/19/2025",
    "aspects": {
      "Price": "Negative",
      "Taste": "Negative",
      "Menu": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I’ve spent months in Thailand, and somehow I got hit with jet lag the second I stepped into Pai. That’s how spot-on it felt. I ordered the vegan khao soi and a beer, and both were perfect. Every staff member stopped by to check in, and somehow it didn’t feel forced. Just good people making sure you’re having a good time.<br><br>The vibe was exactly right. And the best part? I walked in five minutes before closing. No “kitchen’s done,” no side-eye, no rushed energy. They just served great food and let me enjoy it. Solid spot, solid crew, and a really good night.",
    "rating": 5,
    "date": "11/18/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Excellent food. Hopping place even on a Monday night. With a lot going on. Received however a table quickly. Server forgot my drink that’s why only 4 stars, however was remedied shortly. Recommend reserving in advance.",
    "rating": 4,
    "date": "11/18/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Negative",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great Thai food. Very busy even on a Monday night, but we got a table within 10 minutes.<br>Service was wonderful and we had a great time.",
    "rating": 5,
    "date": "11/18/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is one of my favourite places, and one of the only reasons I will go down town. Such an amazing restaurant with so much flavour and life! The Thai iced tea always hits, and everything is incredibly delicious. Definitely will be back, hopefully sooner than later.",
    "rating": 5,
    "date": "11/18/2025",
    "aspects": {
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great customer service. Food was good but a bit salty and ambient music was too loud.",
    "rating": 4,
    "date": "11/18/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Good options and good food. Great cocktails as well. Service was fast and attentive as well.",
    "rating": 5,
    "date": "11/18/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I used to frequent PAI when I lived in Toronto. I still make a point of stopping here when I come back to visit or for work, usually bringing a guest for the first time. This is the BEST Thai food I've had. Very authentic and wonderfully presented. Price is very fair for what you get. Common complaints are that it's fairly loud (which is true because its always busy) and they don't take reservations [at least didn't, which I believe has now changed]. However, I always feel its worth the wait.<br>I would recommend the Green Curry as a main, and Grabong as an appetizer.",
    "rating": 5,
    "date": "11/17/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "1st time here and its amazing.  Wonderfully flavorful food and great service.",
    "rating": 5,
    "date": "11/17/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "John was our server today and he was so sweet and knowledgeable. He was very pleasant dealing with. Our food came on time. Thanks to him our night tonight was made extra special.<br><br>John you deserve 5 stars. Thank you<br>⭐️🌟⭐️🌟⭐️",
    "rating": 5,
    "date": "11/16/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Went last Friday with friends.<br><br>ALERT: you have lots of ppl in line, I understand that. but the server was rushing us ever since we sat down. Asking to put away dishes with 1/3 of thefood still in it.<br>Then literally rushed us to get the bill before we even finished deserts.<br>very unhappy and will not go again with anyone.<br>Can't believe we still tipped 18% out of pitty... But yeah be aware",
    "rating": 2,
    "date": "11/15/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We haven’t been here in over 5 years but we’re happy to be back 😋 YUM !!<br><br>The pork skewers were super tender and delicious and the mango sticky rice dessert was great too 🥭 We will be back soon !!!",
    "rating": 5,
    "date": "11/15/2025",
    "aspects": {
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I am from our of town and this was one of the best Thai meals I have had anywhere in Canada. My whole table gave the food 10/10. Definitely try the pad Thai and Khao Soi !!!!<br><br>Highly recommend making a reso to get a table as it can get busy around dinner.",
    "rating": 5,
    "date": "11/14/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Very good Thai food. Really enjoyed the Tom Yum soup, Pad Thai, and Panang Currie. Would definitely go again.",
    "rating": 5,
    "date": "11/14/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Book in advance to avoid waiting outside in the line like I did. Food is great, interesting, service is very nice.",
    "rating": 5,
    "date": "11/14/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I have been coming here for a few years now specifically this location. The food used to be 5/5 but I feel like the quality is no longer the same as it has blown up in the recent years and the service and attention to detail has been kind of rushed. The price has also seriously increased. None the less still great thai food I always come back to the Pai Thai and Khao Soi. The Khao Soi is such a warm and rich meal, perfect in the winter. I recommend booking a table as they are always packed!",
    "rating": 4,
    "date": "11/13/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Negative",
      "Food Quality": "Positive",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food is so delicious. We had Eric as our server and he was accommodating, knowledgeable, and friendly. Definitely dine here at least once if you are in Toronto!!",
    "rating": 5,
    "date": "11/13/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Pai is the one place where Thai food is consistent and delicious! It’s no wonder there are always line ups.<br>The service is very slow and my water refills took a lot of time. Overall I felt the service leaves much to be desired but the food always more than makes up for it.<br>I would totally keep going back for the consistent good food",
    "rating": 5,
    "date": "11/13/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Definitely lived up to the hype. The wait time to get a table can be very hard. Love the atmosphere.",
    "rating": 5,
    "date": "11/12/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Best Thai food I've had in the city",
    "rating": 5,
    "date": "11/12/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This was easily the best Thai food I've ever had, and the service was phenomenal. Everything was piping hot when it came to the table. The food was super flavorful and fresh. I'll definitely be going back and taking people who haven't yet been there, with me. It was a bonus that despite how busy this restaurant is, it wasn't so loud that I couldn't easily chat with my friend.",
    "rating": 5,
    "date": "11/12/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Hidden away in a basement is this amazing Thai restaurant that serves excellent food at reasonable prices.  The place is always busy.  Expect to wait for a table but trust me it is worth the wait.  All considered, the service is pretty and the atmosphere is definitely electric.",
    "rating": 5,
    "date": "11/10/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Love this place for Real Thai cuisine 😋😋😋😋😋",
    "rating": 5,
    "date": "11/10/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I loved this place. I was a fan of the ice they use in the Thai tea (it was exceptionally good). The staff were precious and kind. The food was good (generous portions).",
    "rating": 5,
    "date": "11/10/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Had the pleasure of going to the downtown location for the first time this past Friday. This experience was incredible and the best Thai food I have ever tasted. The atmosphere was nice and the service was amazing. 10/10. My only disappointment was that I have lived in Toronto my whole life and it took me this long to go try this restaurant. I’ll be back soon!",
    "rating": 5,
    "date": "11/09/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI in Toronto is a true gem for anyone who loves authentic Thai cuisine. This restaurant has earned its spot on the Michelin Guide since 2022 for good reason. Everything about the experience is exceptional. The atmosphere is vibrant yet cozy, with a mix of rustic and modern touches that instantly transport you to the streets of Thailand.<br><br>The menu is filled with authentic dishes that are bursting with flavour, and the prices are surprisingly affordable given the quality and reputation. I ordered the Khao Soi, and it was nothing short of incredible. The broth was rich and aromatic, the noodles perfectly cooked, and the beef was so tender it practically melted in my mouth. Every bite had layers of depth and spice that made it unforgettable.<br><br>PAI is one of those rare places where the hype is completely justified. Delicious, authentic, and worth every visit.",
    "rating": 5,
    "date": "11/08/2025",
    "aspects": {
      "Ambience": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The 2nd time visiting but portion has been reduced significantly, like half less than before.<br>The taste is ok but it is not worthit to queue for an hour to have dishes in this price and portion.",
    "rating": 2,
    "date": "11/08/2025",
    "aspects": {
      "Price": "Negative",
      "Taste": "Positive",
      "Menu": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "After eating at this Thai restaurant, I have come to agree that it is deserving of it's Michelin star.<br><br>⚠️Special note ⚠️<br>The pictures in the menu look identical to the food in person. This shows the honesty of this popular restaurant.<br><br>Food came incredibly quick.<br>Food 🍤: 9/10⭐<br>Most of the food was perfect. Here are some of my recommendations.<br>1. Kung Tawt:<br>- This crispy shrimp had incredible sweet<br>seasonings and unlike most shrimp I had,<br>its texture was not stringy or dry.<br><br>- Personally, I generally do not enjoy<br>things like cole slaw or mango slaw.<br>However, the mango slaw I ate here was<br>somewhat enjoyable, so if you enjoy<br>slaws, I suggest you order it.<br>- I loved the Khao soi. The noodles had a<br>very soft texture and the soup was very<br>creamy and spicy, as you would expect.<br>- Pad see ew. I always love pad see ew.<br>This dish was much different, though.<br>The noodles were soft and savoury, but I<br>wish the greens were given a bit more<br>salt or flavouring.<br>- For a dessert, you will love the mango<br>sticky rice. The rice is creamy and when<br>paired with the mango, it creates an<br>indescribable taste.<br>Tom yum soup: it's ok. The flavours are good, but too strong.<br>What I do not recommend:<br>- Tom yum soup. The flavours of this soup<br>are good but way too powerful.<br><br>Service speed 🐎: 10/10⭐<br>The food came ~15 minutes after ordering. Much quicker than our wait time.<br><br>Service♥️: 9/10⭐<br>The service was decent. They brought everything out quickly and got us ordered without any troubles.<br><br>Cost 💰: 2/10⭐<br>The kung tawt costed about 20 dollars... I cannot recall the other prices. It's up to you to decide if these expensive prices are worth it for the taste.<br><br>Atmosphere 🇹🇭: 9/10⭐<br>There are a lot of nice decorations, but this doesn't matter much if you're just coming for the good food.<br><br>This restaurant should expect to see me again!",
    "rating": 5,
    "date": "11/08/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great food and good service! The shot of the day @$5 can’t be beat. And did I mention the amazing food… the papaya salad and tum yum is delicious. A must visit when in Toronto!",
    "rating": 5,
    "date": "11/08/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "One of our favorites in downtown Toronto! We always recommend visitors and friends to try them out ☺️ Our fave dishes include the Khao Soi, Pad Thai and Moo Ping.",
    "rating": 5,
    "date": "11/07/2025",
    "aspects": {
      "Menu": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Had lunch at PAI today and it was a great experience! The atmosphere was lively but still comfortable, and the staff were super friendly and attentive. The food was delicious — both the vegetarian and non-veg dishes were packed with flavor and felt really fresh. Definitely one of the best spots in Toronto if you’re craving authentic Thai food. Would absolutely go back again!",
    "rating": 4,
    "date": "11/06/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "4 years, 4 Michelin stars. Fantastic drinks, Thai food and desserts.",
    "rating": 5,
    "date": "11/06/2025",
    "aspects": {
      "Drinks": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing Tai food in downtown Toronto",
    "rating": 5,
    "date": "11/05/2025",
    "aspects": {
      "Desserts": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Hands down best Thai restaurant in GTA. You cannot find tastier Thai food. The pad Thai, Thai iced tea, spring rolls, green curry, Khao soi, massaman curry, Thai chicken wings, grabong, pad GRA prow are all the best you will have. Even for delivery it's still amazing, but it is a really cool spot to eat, great vibe that actually feels like you're in Pai. Highly recommend if you like Thai food.",
    "rating": 5,
    "date": "11/05/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Definitely one of the best restaurants in town!",
    "rating": 5,
    "date": "11/04/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Loved their Massaman Curry. Aptly spicy and flavourful!<br><br>The service was really great and quick",
    "rating": 5,
    "date": "11/03/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious! Ive been meaning to try this place for a while since everyone and their mother recommended it to me. I got the Chicken Khao Soi and my friend got the Chicken Pad Thai. Personally I loved my dish way more than hers. It was a nice kick of spice and a great warm dish on a chilly day. Despite there being a lot of people, my friend and I had no trouble conversing at a normal volume. There's normally a wait, so if your visiting during peak hours I recommend you book a table in advance.",
    "rating": 5,
    "date": "11/03/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious food. We came 3 years ago and have been dying to get back. Had the Pad Thai and loved it.",
    "rating": 5,
    "date": "11/02/2025",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Been here numerous times, and always happy to come back. Casual atmosphere, and the food is fantastic! Some of the best Thai food in the city. Highly recommended.",
    "rating": 5,
    "date": "11/01/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing food and staff. One area of issue was that the food was served almost on top of each other. Two appetizers barely started and then they brought the main course. We said we weren’t ready. They took it away and then returned a few minutes later. Too much food at one time. Otherwise food was delicious. Pad thai amazing.",
    "rating": 4,
    "date": "10/31/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Negative",
      "Location": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I loved my experience here<br>Definitely recommended and we will back soon<br><br>P.S : here is very crowded always, we were walked in, had to wait 40 mins but totally worth it<br>Recommended dish : KHAO SOI ( with beef )",
    "rating": 5,
    "date": "10/31/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "One amazing place i never miss visiting and feels so heavenly good in all aspects 😍 must try place 👍",
    "rating": 5,
    "date": "10/27/2025",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious food and very kind staff.",
    "rating": 5,
    "date": "10/26/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great environment and the food is delicious you can't go wrong with any of the dishes you pick.",
    "rating": 5,
    "date": "10/26/2025",
    "aspects": {
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food is amazing - but when service is bad it takes away from the entire experience. Our server just up and disappeared for 30 minutes. I had to get up and walk over to another server to get any attention and pay my bill!",
    "rating": 2,
    "date": "10/26/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We went on a Saturday for lunch at noon.  No wait time & for our group of 5, we were seated in a nice spot. It's been a few years since we were here last so it was lovely to see how much more seating there is now. The food was great and the ambiance also nice. The staff was friendly and always checked on us to make sure we didn't need anything.",
    "rating": 5,
    "date": "10/25/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "来两次了，鸡翅调味挺好的，就是鸡肉用一般，估计是懂过的鸡肉，最里面能吃出来一点肉腥味。番茄猪骨配米粉很好吃，必点，是没吃过的味道。Good. The chicken wings have good seasoning and I really liked the sauce. However the chicken itself tastes like previously frozen meat, there is a subtle taste of an unpleasant chicken taste. The pork rib is very good. The rice noodle works well in the soup.",
    "rating": 4,
    "date": "10/23/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "to me, this is toronto's top thai restaurant<br>the fried rice is seriously amazing!!!!!!!!",
    "rating": 5,
    "date": "10/22/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The best pathi you’ll ever taste — hands down! The flavors are authentic, rich, and cooked with real care. Every bite reminds you what good food should taste like. The staff are welcoming, the service is quick, and the atmosphere makes you feel right at home. This place truly deserves all the praise it can get — a hidden gem that delivers excellence every time!",
    "rating": 5,
    "date": "10/21/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "5 Stars! PAI consistently delivers great food and experiences. We ordered takeout this time and enjoyed a hot fresh meal. Everything was great. We ordered the mango slaw for the first time, basically an elevated mango salad. It was the best dish I had. They have takeout down to a science. It’s well organized and the staff are friendly.",
    "rating": 5,
    "date": "10/21/2025",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This place is my new favorite. I’m recommending to all my friends. This food is so good.",
    "rating": 5,
    "date": "10/20/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "LOVE this place, this is my new fave Thai restaurant. The atmosphere in the restaurant is very cute and the service is great. The Tom yum soup was so flavourful, I couldn't get enough of this. The chicken pad Thai was delicious too and enjoyed the massaman curry. The lychee and mango juices are tasty and not overly sweet. We had the coconut sorbet and it came in the coconut, we were able to also eat the jelly from the coconut and the mango was so juicy. This place is a must visit!",
    "rating": 5,
    "date": "10/20/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Absolutely amazing food and excellent service. Very well organised and friendly staff. We ordered the Pad See Ew and Pad Thai and loved it! Would 100% recommend this place!",
    "rating": 5,
    "date": "10/20/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "No wonder it’s Michelin-recommended — every dish was delicious, and the Thai iced milk tea paired perfectly with the meal.<br>Even before all the dishes arrived, I was already eager to dig in!<br>The flavors were rich, leaning toward the sweet and savory side, which can get a bit heavy after a while.<br>According to the reviews, there’s usually a long line, but we arrived before 5 p.m. and didn’t have to wait at all.<br>The prices were also very reasonable for the quality and portion size.",
    "rating": 4,
    "date": "10/19/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My partner and I love trying Michelin-recommended restaurants when we travel, and I will never forget our visit to Pai. We went for lunch and I had the best Pad Thai of my life. I still dream about it! The experience was wonderful from start to finish. Everything was absolutely delicious, and the atmosphere was vibrant and welcoming. A must-visit in Toronto!",
    "rating": 5,
    "date": "10/19/2025",
    "aspects": {
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious pad Thai by Chef Nuit. It's popular for both the locals and tourists so expect a wait for a table unless you've made a reservation. If you're looking for Thai cuisine but don't want the wait, I highly recommend going to Kiin (her other restaurant down the street which is high end). Loud, bustling atmosphere inside with very attentive wait staff. Can't wait to return.<br><br>I think this restaurant could greatly benefit from an automated waiting system instead of lining up on the sidewalk + stairs (i.e. use a machine near the entrance where people can provide their name, number, # of people, and then receive an automated text when there's a table available).",
    "rating": 5,
    "date": "10/19/2025",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral",
      "Taste": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Absolutely a wonderful experience. Food was so tasty and a very interesting combination of flavours. Loved the evening with my daughter!",
    "rating": 5,
    "date": "10/18/2025",
    "aspects": {
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food was great! Quick service and nice ambience.",
    "rating": 5,
    "date": "10/18/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The food is absolutely fantastic — some of the best authentic Thai dishes I’ve had. However, the experience was overshadowed by the service and overall atmosphere. The lineup was long, and once seated, the service felt indifferent, likely because the restaurant knows the food alone keeps people coming back.<br><br>We went with our toddler, and the area we were seated in was freezing. When we asked for a warmer table, we were told it would be another 30-minute wait. Unfortunately, that really took away from the experience.<br><br>If they delivered to my area, I’d happily order often and skip the lineup and poor service. In short: amazing food, but disappointing service and comfort.",
    "rating": 4,
    "date": "10/16/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Menu": "Negative",
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Cosy place... excellent food!",
    "rating": 4,
    "date": "10/13/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "No reservations, you’ll have to wait, but it’s 100% worth it if you love athletic Thai food and gluten free pretty much everything.",
    "rating": 5,
    "date": "10/13/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I didn’t like the vegan mushroom rice dish. It tasted different with those mushrooms. Almost had that smell of non-veg. I had better Thai food. Not sure if I made poor choice with the dish or the dish didn’t taste as expected.",
    "rating": 3,
    "date": "10/13/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Amazing Thai food, every dish was a 10/10. It was decently crowded for weekend lunch but there was no wait and service was very quick despite how busy they were. We got the laab salad, pad gra prow and khao soi and I recommend all of them. Overall an excellent spot close to the concert halls",
    "rating": 5,
    "date": "10/12/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Consistent, I don’t think they have a bad dish. I’ve tried multiple dishes and everything has been exceptional in my opinion.<br><br>There are some incredible 10/10 cocktails but some that aren’t so good. I’ll leave that to you to figure out.",
    "rating": 5,
    "date": "10/12/2025",
    "aspects": {
      "Menu": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Cool downtown vibe, attentive service from our waiter and the food was delicious.  Very good first time experience.",
    "rating": 5,
    "date": "10/12/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "A total surprise — we picked it completely at random, and all four of us were amazed from appetizers to dessert! Every dish was delicious, the ambiance was unique, the music was excellent, and the décor was beautifully done. The service was excellent too — the staff were kind and made great recommendations.",
    "rating": 5,
    "date": "10/11/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "great atmosphere, and absolutely amazing food.  you must go.",
    "rating": 5,
    "date": "10/10/2025",
    "aspects": {
      "Ambience": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "PAI is an absolute standout! From the moment I walked in, I was struck by the vibrant, welcoming atmosphere. The space is modern, lively, and comfortable, making it the perfect spot for a casual meal or a special night out. The staff greeted me warmly and were attentive throughout the entire visit, ensuring a seamless and enjoyable experience.<br><br>The food at PAI is exceptional. Every dish I tried was packed with flavor, beautifully presented, and clearly made with high-quality ingredients. From the perfectly spiced noodles to the fresh and creative appetizers, each bite was a delight. The menu strikes an excellent balance between traditional favorites and inventive dishes, offering something for everyone.<br><br>Service here is top-notch. The staff are knowledgeable, friendly, and genuinely committed to making your visit memorable. They anticipate your needs, provide great recommendations, and make sure everything runs smoothly, which really enhances the overall experience.<br><br>What sets PAI apart is the combination of delicious food, vibrant atmosphere, and attentive service. Every element comes together to create a dining experience that’s both fun and satisfying. I left completely impressed and already planning my next visit — PAI easily earns every one of its five stars and is a must-visit for anyone who loves incredible food in a welcoming environment!",
    "rating": 5,
    "date": "10/09/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We used to come here often last year for the good food. This year we came in thrice (brought friends too) but the food quality was noticeably down. It felt more greasy, less fresh, and on one occasion we were seated next to a group of loud drunk folks. There was one time where we just decided to not wait - it’s especially packed in evenings (Toronto Downtown location).<br>On the plus side, portion sizes are plenty and some standard good ones like veg khao soi. There’s a lot of potential to make it better.",
    "rating": 4,
    "date": "10/09/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Absolutely amazing<br>Great spot<br>Food and atmosphere on point",
    "rating": 5,
    "date": "10/08/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Probably the best Thai food I’ve ever had (without going to Thailand)",
    "rating": 5,
    "date": "10/08/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "One of my favorite Thai restaurants has always served great food in a short time. The Thai fried rice is amazing and the chicken wings are so tasty. We walked in by 4:45 pm on Sunday so there is no waiting time at all.",
    "rating": 5,
    "date": "10/06/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Nice environment, greatly presented food and friendly service. We had the green and penang curries and both were delicious",
    "rating": 4,
    "date": "10/04/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "VERY busy place, excellent and flavourful food. Great service. Reservation recommended.",
    "rating": 5,
    "date": "10/04/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My friend and I loved our pad thai and spring rolls! Worth the wait for sure!!",
    "rating": 5,
    "date": "10/03/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Delicious Khao Soi and Fried Rice",
    "rating": 5,
    "date": "10/03/2025",
    "aspects": {
      "Taste": "Positive",
      "Desserts": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "The Gold Standard for Thai Food—Especially Their Life-Changing Khao Soi!<br><br>I feel incredibly fortunate to have known about Pai for years, and I am always game to return. This place is an absolute culinary institution, and its consistent inclusion in the Michelin Bib Gourmand Guide is no coincidence.<br><br>What truly sets Pai apart for me is their Khao Soi. It quite literally changed my life. Since I first tried their version, I've never been able to enjoy it anywhere else—no one does it like Pai. It is the perfect balance of creamy, spicy, and rich flavor, and it was, as always, stupendous on my most recent visit.<br><br>But the excellence doesn't stop there! I also branched out and tried other house favorites, including the amazing Garlic Shrimp and the delightful Squash Fritters. Everything was a winner.<br><br>Finally, after a long absence every time I've visited, I was able to snag the Mango Sticky Rice dessert. It is everything I envision heaven tasting like—a perfect, sweet ending.<br><br>The ambience is always bumping, the energy is high, and the staff are consistently friendly. I truly can't wait to go back again.<br><br>Pro-Tip: If you know you want to go, my recommendation is to make a reservation very early. You may need more than six weeks of heads-up to secure a table!",
    "rating": 5,
    "date": "10/03/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "That was the best Khao soi I've ever had! Must try the beef!!<br>This place literally transported me back to Pai Thailand, amazing food and music!",
    "rating": 5,
    "date": "10/01/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "So clean and well-kept.",
    "rating": 3,
    "date": "10/01/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Good portions, friendly service",
    "rating": 5,
    "date": "10/01/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Buzzy, busy, and big on flavour, I knew that Pai was going to be good the moment we walked in. Got a two person table after a ten minute wait (on a Monday for dinner) and ordered the mango salad (exceptional) and the pad see ew (one of the best.) I use to live in Asia for three years and this was one of my best Thai meals to date. Bravo!",
    "rating": 5,
    "date": "09/30/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Very yummy Thai food with veggie friendly options! Great atmosphere and service! Came here on a whim and didn’t have to wait for a table which was surprising as it was packed out for a Monday night. Tasty and friendly service!",
    "rating": 5,
    "date": "09/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "One of the best Thai restaurants in the city! It gets very busy so if you don’t have a reservation you will have to wait to get a table.",
    "rating": 5,
    "date": "09/29/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Great atmosphere, food was great. Definitely worth a try.<br><br>Came here on a whim on a Sunday night. We waited approximately 20 mins for our table which was great. We ordered a papaya salad to share and I got a traditional northern Thai dish. We all loved our food but did notice an inconsistency in their spice scale. We ordered medium heat to our dishes and noted that the papaya salad was quite spicy but all our other dishes were not. The service was great, they are very attentive and friendly with our table.<br><br>Overall food was great, atmosphere was nice for friends and family, and service was great!",
    "rating": 5,
    "date": "09/29/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Neutral",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "This might be my new favourite restaurant. My bf and I ordered chicken satay skewers, garlic chicken, khao soi with chicken and pad thai with chicken. Food was served soon after ordering and had lots of depth of flavour. Good amount of spice as well. For drinks, we got a summer dawg and a m-150 energy drink and both were delicious. Will definitely return!",
    "rating": 5,
    "date": "09/28/2025",
    "aspects": {
      "Taste": "Positive",
      "Drinks": "Neutral",
      "Food Quality": "Positive",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "First time here based on recommendation from family member. Great food and service. This place is busy and there could be big lineups depending on the time. Recommend to reserve in advance",
    "rating": 5,
    "date": "09/28/2025",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Neutral",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food is pretty ordinary, maybe got too hyped up and the kitchen can’t keep up the demand.  The food came out not very fresh…… you can tell the meat has been sitting there for a while before serving to us. Price range is on the steep end probably because of location not because the quality of ingredients.",
    "rating": 3,
    "date": "09/27/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Excellent bar and restaurant when visiting downtown Toronto! Friendly service and staff! Various menu items with delicious plates. There were so many items on the menu, it was hard to choose because everything sounded so good! Our server recommended delicious dinners, and we felt it was a good value! It was busy for a Wednesday night, but the wait time went quick, under 45 mins. The atmosphere is a chill, hippie vibe displaying popular musicians throughout the restaurant. Location is central in downtown entertainment district and close to other bars/restaurants in the area. Overall, I definitely recommend this unique Thai restaurant in Toronto!<br>This restaurant in Toronto was rated Michelin star for many years, I had to try it and it did Not disappoint! Get there early, there is a long wait but they text you when your table is ready and you can have unique, different drinks at the bar. Staff is friendly and informative, servers and bartenders are attentive. Love the \"hippie Rockstar\" atmosphere.",
    "rating": 5,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Location": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Everything spot on! Fantastic, authentic Thai food. I went for lunch and the wait for a table was short. The staff were wonderful and the atmosphere was perfect because the restaurant is tucked away slightly below street level, giving it a unique vibe.<br><br>Best green curry I've had in a long, long time! (see photo)",
    "rating": 5,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We ordered the Pad Thai and Pad See Ew, and both were excellent!<br>The Pad Thai had that perfect balance of sweet, tangy, and savory flavors, with fresh lime and peanuts on the side to customize each bite.<br>The Pad See Ew was rich and smoky, with wide noodles, fresh greens, and just the right amount of seasoning – absolutely delicious.<br>The portions were generous, the flavors authentic, and the atmosphere at Pai is always lively and welcoming. It’s a great spot in downtown Toronto if you’re craving real Thai food with bold flavors.",
    "rating": 5,
    "date": "09/26/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Absolutely love Pai, can be a long wait without reservations but well worth it.",
    "rating": 5,
    "date": "09/25/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Impressive Vietnamese. Fresh ingredients, authentic and delicious. Solid cocktails<br><br>Recommend:<br>Pad Thai<br>Spicy P cocktail",
    "rating": 5,
    "date": "09/24/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "(Visited Saturday, Sept 13 around 7PM in person during TIFF final weekend.)<br><br>I'm sure this place is always busy, especially evening and weekends and especially during TIFF, and while I enjoy the food and atmosphere there are a few things lacking or are subpar.<br><br>First I applauded the host on duty and staff for doing a fantastic job when the place is super busy. I believe we waited around 40 minutes for a table during prime dinner time Saturday night.<br>Host and server were fantastic.<br><br>While the food was delicious, atmosphere dim, maybe a bit too loud - I hate when I sort of have to scream across the table, the one thing that got to me is, for how popular this place is you have a pot of tea on the menu which is a lipton's tea bag for $4.00 (see photo). Couldn't even be looseleaf tea? Something that isn't LIPTON'S. At least hot water was a free refill. Should have brought my own tea bag if that was the case, and just asked for hot water. At least the teapot was nice.<br><br>Tea aside, the shrimp pad thai was delicious as always. (Being allergic to coconut food I am allowed to consume is limited) but something I always recommend.",
    "rating": 4,
    "date": "09/23/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Food has heaps of flavour; service is fast. Just make sure you book, as it gets very busy for dinner or game days.",
    "rating": 5,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Incredible! I've lived in TO for years and only just made it here the other day. 10/10 recommend. Service was great, food was fantastic, vibe was cute and cozy.",
    "rating": 5,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Service was great. Food was good but certain dishes were too salty.",
    "rating": 4,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "My favorite restaurant in toronto. The best thai food ever",
    "rating": 5,
    "date": "09/22/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Incredible experience. The food was delicious, service on point and the atmosphere was really warm! Totally worth the wait for the table (only 15min)<br>5/5 🌟",
    "rating": 5,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Khao soi and pad Thai were delicious. Didn't wait long for a table. Maybe 10 mins",
    "rating": 5,
    "date": "09/21/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "It was good, but just good. For me, not worth the wait.",
    "rating": 4,
    "date": "09/21/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "We went for lunch and ordered the Garlic Chicken and Pad Phet Chicken. The Garlic Chicken was okay, and the dip that came with it was actually delicious. Unfortunately, the Pad Phet Chicken was terrible—it smelled so bad I had to send it back. We switched to Chef Nuit’s Pad Thai, which was just okay, but by then we had lost our appetite and ended up taking it home.<br><br>The atmosphere is nice, but overall the food was very average compared to the hype. I had heard so many positive things about this place, but it really didn’t live up to expectations. I won’t be coming back.",
    "rating": 4,
    "date": "09/21/2025",
    "aspects": {
      "Ambience": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "PAI",
    "review": "I love this place so much",
    "rating": 5,
    "date": "09/19/2025",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "⭐️⭐️⭐️⭐️⭐️<br><br>I’ve been to PAI three times now with different friends, and every time we ordered different dishes, none of them ever disappointed. The flavors are bold, authentic, and consistently delicious.<br><br>The only downside is the wait, twice I got lucky and was seated quickly, but usually it’s a long line, especially during peak hours. That said, it’s totally worth it if you can go a bit earlier or outside the rush.<br><br>Definitely one of my go-to spots in Toronto for Thai food, and I’ll keep coming back!",
    "rating": 5,
    "date": "09/19/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Visiting Toronto, we went here on a friend’s recommendation and were so glad we did. The food was absolutely amazing, and the staff was super friendly. We also loved hearing the story of how the owners started the restaurant—it added such a personal touch. The food was so good we even ordered delivery to our hotel a couple of days later! They also have a cookbook called Kiin, which I picked up. I’m picky about cookbooks—I want photos and insights into the “why,” not just the “how.” This one checked all the boxes.",
    "rating": 5,
    "date": "09/19/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "PAI",
    "review": "Everything tasted perfect. Service was quick too!",
    "rating": 5,
    "date": "09/18/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  }
]