[
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I dined here for my birthday as good as the food tasted all members of my party felt sick from in a few hours later. Service was great friendly serve just had a hard time getting their attention sometimes.",
    "rating": 3,
    "date": "02/19/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food was not delicious. Just regular level of taste, but very expensive when consider the taste and dish size.<br>Server was very rushing us to pay, and keep asking me for the card which was very unacceptable experience<br>Everything is about the veiw. No other reason to visit.<br>The view, you can enjoy by just going up to the tower, not the restuarant.",
    "rating": 1,
    "date": "02/19/2026",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We went on Feb Dinner time, not so crowded on the day.  Relax and comfortable.  Great view, Great Service, Great Food.  We had a wonderful evening.  Recommended to go at winter time.",
    "rating": 5,
    "date": "02/19/2026",
    "aspects": {
      "Service": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It’s a great value when you consider you can visit the observation deck and other areas as part of your meal cost. The food is delicious and the views can’t be beat!",
    "rating": 4,
    "date": "02/18/2026",
    "aspects": {
      "Price": "Positive",
      "Taste": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great way to see Toronto and our server, Stephen, was fabulous!",
    "rating": 5,
    "date": "02/18/2026",
    "aspects": {
      "Service": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Dining at the CN Tower’s 360 Restaurant is an unforgettable experience. The food is delicious and beautifully presented, with local ingredients and perfectly cooked dishes that match the stunning, rotating view of Toronto. The service is friendly and professional, making it an ideal spot for special occasions or anyone wanting a memorable dining experience with world-class scenery.",
    "rating": 5,
    "date": "02/18/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I used to have very high expectations for 360 Restaurant at the CN Tower, especially because my previous visit last yeat was decent. Unfortunately, this time the experience was extremely disappointing.<br><br>The food quality was far below expectations. The appetizer was extremely hard to chew and I couldn’t finish it. Our main course (rib and pork) had an unpleasant smell and taste! It was not enjoyable at all. For a restaurant of this reputation and price point, this was shocking. The only item that was acceptable was the dessert.<br><br>Service was also lacking. Our server was not attentive; I waited nearly 20 minutes just to receive the bill. When I asked if she could take a photo of us for my friend’s birthday, I felt an uncomfortable attitude, which made me decide not to ask again.",
    "rating": 2,
    "date": "02/16/2026",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "our experience was disappointing. The soup arrived cold and had to be returned. The steak contained roughly 25% fat, which made it poor value for the price. The waiter didn’t offer coffee or tea and came across as robotic rather than welcoming. Overall, the food lacked flavor and was quite bland. Based on this visit, I wouldn’t recommend this restaurant.",
    "rating": 1,
    "date": "02/16/2026",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Awful food, cant cook a steak to a simple medium temp and the mashed potatoes were POWDERED! The bill came out to over 200$ for powdered potatoes<br>Absolutely insane. Do not recommend to eat here. There are tons quality restaurants around the CN tower that are more worth your money",
    "rating": 1,
    "date": "02/16/2026",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food was good, the service was wonderful, the ambiance was worth it. We loved it",
    "rating": 5,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Dining at 360 Restaurant inside the CN Tower is definitely more about the experience than the food itself. The biggest highlight is, without question, the breathtaking revolving 360-degree view of beautiful downtown Toronto. Watching the city skyline and Lake Ontario slowly pass by as you dine is something special and makes for a memorable evening. Part of what you’re paying for is also the convenience of visiting the CN Tower, which adds to the overall attraction.<br><br>That said, it is an expensive restaurant, and the pricing clearly reflects the location and rotating feature. The food was good, but not outstanding for the cost. There are several high-end restaurants in Toronto where you can get better overall value and more impressive dishes for the same price or less.<br><br>There were a few solid steak options on the menu. The striploin was good, cooked properly and flavorful, but not exceptional. The salmon was decent and enjoyable, while the pasta was just average. They offer a good selection of wines and have a beautiful wine cellar. The staff were nice and polite, knowledgeable about the menu, and generally attentive. However, at times they seemed rushed, wanting to serve quickly and move on to the next table, which made the dining experience feel slightly hurried rather than relaxed. With such stunning views and a premium price point, a slower, more attentive pace would have made the evening feel even more special. It’s also family-friendly with a kids menu available, which is a nice touch.",
    "rating": 4,
    "date": "02/15/2026",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Location": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "At nearly $20, the “truffle fries” were a notable disappointment. Rather than properly infused or finished fries, the dish consisted of what appeared to be standard fries accompanied by a truffle dipping sauce, a distinction that was not made clear on the menu. In a restaurant positioned at this level, one expects more thoughtful execution and transparency, particularly with something marketed as truffle fries. As shown in the attached photo, the presentation and preparation did not reflect the premium description.<br><br>The crab and corn chowder was similarly underwhelming. While the concept is appealing, the dish lacked the depth, balance, and refinement one would anticipate at this price point. I have attached a photo for reference.<br><br>With a bill approaching $400 for two, the concern is not the cost itself but the inconsistency between pricing and delivery. The steak, however, was well prepared and satisfying, and it stood out as the highlight of the meal.<br><br>Service was exceptional. The servers were extremely warm, attentive, and professional throughout the evening. They checked on us frequently without being intrusive and kindly offered to take photos of my fiancée and me, which added a thoughtful and memorable touch to the experience.<br><br>Overall, while the hospitality was outstanding and certain elements delivered, some menu items fell short of the standard the setting and price suggest.",
    "rating": 3,
    "date": "02/14/2026",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Menu": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "had an extremely disappointing experience at this restaurant. We spent over $300 expecting a nice evening for a special occasion, but unfortunately it turned into a frustrating and uncomfortable night.<br>The service was particularly poor. Our server repeatedly invaded our personal space while speaking to us, standing far too close and making the experience awkward. Professionalism and basic courtesy were clearly lacking. For a restaurant charging premium prices, the level of service simply did not match the cost.<br>To make matters worse, there was a mandatory 25% gratuity automatically added to the bill. While I understand service charges in some establishments, it felt unjustified given the quality of service we received. A mandatory tip at that percentage should reflect exceptional service — not the opposite.<br>Overall, this was not worth the money, especially for a date night or celebration. There are many better restaurants that offer quality food, professional service, and a much more comfortable dining atmosphere. I would strongly recommend looking elsewhere for a special evening out.",
    "rating": 1,
    "date": "02/14/2026",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I didn’t really like the food but the view was amazing",
    "rating": 4,
    "date": "02/12/2026",
    "aspects": {
      "Food Quality": "Negative",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "360 Restaurant is excellent! The food is delicious, the service is outstanding, and the drinks are special. The view experience is simply phenomenal. I highly recommend it, especially because you can also explore the tourist floors and enjoy even more of the place.",
    "rating": 5,
    "date": "02/10/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Very efficient management.<br>The host gave us the best seat on our anniversary, the staff went above and beyond to make sure we had a good experience.<br>Vibe was great, food came out pretty fast.<br>We ordered the Heirloom Carrot and Kohlrabi salad, Corn Chowder, Mushroom Cavatelli, Pimenton Spiced Chicken Supreme, Pumpkin Flan, and Sour Cherry Frangipane.<br>The salad is probably the best salad I ever had. Rest was pretty good.<br>Drinks: Clouds and Cream, Up to Something. Both 10/10.<br>The lower observatory decks were complimentary.<br>The Wine selection looked pretty good, didn’t try any tho.",
    "rating": 5,
    "date": "02/10/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Positive",
      "Drinks": "Neutral",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I have attended 360 on a few occasions in the past, and had good experiences, so for this special occasion I thought it would be nice to have it at 360. On this occasion it was for my wife’s 65th birthday and our 40th anniversary, which both fell on the date of our visit at 360.<br><br>I typically can be bothered to spend time writing reviews, but on this occasion I felt so disappointed that I must devote time to share this.<br><br>Despite having a reservation (5 adults, 2 children, and a baby) we were simply sat at an empty table which happened to be close to  the entrance. Although I also reserved a high-chair, one was not provided. Prior to being seated I specifically requested the bill be brought to me, yet it wasn’t. Rather it was provided to one of my guests.<br><br>Service was incredibly slow and waiters had to be repeatedly called over for order taking/service. The Sommelier was clearly unfamiliar with wine-pairing and or available stock. Waiter decanted a 25 year-old vintage as if filling a glass of carbonated water. Almost all meals were served with an overwhelming amount of course-ground black peppercorn, not allowing for any other notable favour. Meals were not in keeping with cook requests (eg. medium prime rib initially served  well-done, then served rare). Custom ordered dessert (2 cakes) were not as ordered, apart from one of them being dropped before arriving to the table. In fairness to 360, I was informed of the mishap and a tray of assorted desserts was substituted and the cost of the original desserts was waived.<br><br>While I understand the concept of a minimum prefixed tip rate for larger groups (20%), it does not promote an incentive for exemplary customer service or allow for adjustment to the tip for substandard service.<br><br>Despite having drawn the shortcomings (via email) to the restaurant management (M. Scott), I was simply offered to return (up to 4 people) where a 20% discount would be applied. However response to all my concerns was simply ignored. So essentially I paid a bill and 20% tip for 8 people, and 360 is willing to have 4 people come back for dinner tip-free.<br><br>Sure seems unfair or truly considerate.<br><br>But how can you expect staff to be customer service driven, with such an attitude and lack of genuine care by management.<br><br>So beware and really give serious thought about where you host your special occasion. It seems current 360 management focuses and relies on tourists (1 time customers) rather than developing an environment for repeat customers, or caring about contributing to ensuring a positive special occasion.",
    "rating": 1,
    "date": "02/10/2026",
    "aspects": {
      "Service": "Neutral",
      "Price": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This place is the symbol of Toronto where you would expect to receive top notch service and amazing food. The servers seem to be all clueless middle aged dads. which pairs well with an outdated decor. I’ve received better service at McDonald’s. Safe to say this is the first and last time I spend a birthday here.",
    "rating": 1,
    "date": "02/09/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Dinner at 360 The Restaurant was a unique experience! The mussels starter was amazing, though my wife’s soup didn’t quite hit the mark. My salmon main course was okay, but the sides were a bit simple and slightly bitter, while her pork dish was absolutely delicious.<br>The desserts stole the show—both white and dark chocolate were perfect, and our non-alcoholic cocktails were refreshing and tasty.<br>With breathtaking panoramic views of Toronto, this place is perfect for a romantic dinner or special occasion, even if some dishes could be improved. Highly recommend for the experience!",
    "rating": 4,
    "date": "02/06/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "360 Restaurant at the CN Tower is an unforgettable experience.<br>Breathtaking panoramic views of Toronto, elegant atmosphere, and beautifully presented dishes make this place truly special.<br>The food is refined and delicious, the service is professional and attentive, and every detail feels well thought out.<br>This is more than just a restaurant — it’s a full experience that’s perfect for a special occasion or simply to enjoy the city from above.<br>Highly recommend.",
    "rating": 5,
    "date": "02/06/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was a great experience for the first time. The food was amazing and tasty great customer service and the view was amazing also the restaurant was very clean and staff was so friendly.",
    "rating": 5,
    "date": "02/04/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Excellent service, very good food, I highly recommend it for a dinner with someone special, friends, family and even just for the view of the city, you could go yourself.",
    "rating": 5,
    "date": "01/27/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "You only pay for the view , and the service is not ok you can barely understand to the waitress and they expect at least 15 to 20 % on tip which you have to give them 60 to 80 dollars on tip regardless in a bill of 400 for 2 ppl",
    "rating": 1,
    "date": "01/27/2026",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Nice experience<br>Very good views<br>the food was ok<br>the service was perfect<br>But birthday cake was so bad I paid 80 dollars for that bad cake sorry I couldn’t eat it<br>So bad",
    "rating": 1,
    "date": "01/23/2026",
    "aspects": {
      "Service": "Positive",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "the most expensive cafeteria in terms of food and service, with the most exquisite view, the jarring combination enough to make anyone sad",
    "rating": 2,
    "date": "01/22/2026",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Came here for Anniversary on a weekday night the revolving floor gives a 360* view of the city skyline, gardiner expressway and the financial district. The food is good, had Atlantic char which was perfectly cooked and the cocktails were decent. Will recommend a visit.",
    "rating": 5,
    "date": "01/22/2026",
    "aspects": {
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Second time at the 360. Nice views a d good food",
    "rating": 5,
    "date": "01/17/2026",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food, not so good. Views are amazing 👏🏾",
    "rating": 3,
    "date": "01/17/2026",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Really good food and friendly service",
    "rating": 5,
    "date": "01/16/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is absolutely incredible and worth the experience on its own. The rotating 360° restaurant makes it extra special, and seeing the entire city while dining is unforgettable.<br><br>The food itself is mid, just not that bad, but not the highlight. You’re really paying for the atmosphere and the views, and for that reason alone, it’s still a great experience and something I’d recommend doing at least once.",
    "rating": 5,
    "date": "01/15/2026",
    "aspects": {
      "Ambience": "Neutral",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing rotating views over Toronto and Lake Ontario, the highlight of the experience.<br>We had salmon dishes and duck etc., which felt very Canadian, fresh, and nicely presented.<br>Service was professional, and CN Tower access included with the meal is a big plus.<br>The food is good, though slightly expensive for what you get; you’re mainly paying for the view.<br>We parked at a nearby parking garage, which was convenient.",
    "rating": 5,
    "date": "01/12/2026",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Menu": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Manager told my family and I that we could go up to the top to make a viewing and the lower area manager named Jason was absolutely rude. Unbelievable they would allow me and my wife and my family to go to the upper area they want us to pay an additional $11 Unreal.",
    "rating": 1,
    "date": "01/12/2026",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I had an amazing experience at the 360 Restaurant at the CN Tower while celebrating my birthday 🎂. From the moment I arrived, the staff made me feel incredibly special on my day.<br><br>The service was outstanding, the food was absolutely delicious, and the drinks 🍹 were perfect. Everything exceeded my expectations. But what truly stood out the most was how welcoming and genuine the staff were—they made me feel like I was at home.<br><br>Thank you to the entire team for making my birthday unforgettable. I will definitely be back and highly recommend this experience to anyone visiting Toronto.",
    "rating": 5,
    "date": "01/11/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was a beautiful dinner, amazing view, delicious food and excelent service, the waiter speaked Spanish and make everything easier for my mom who doesn´t speak English, a once in a lifetime experience!",
    "rating": 5,
    "date": "01/11/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I love this place for any celebration",
    "rating": 5,
    "date": "01/11/2026",
    "aspects": {
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is nice but the food is horrible especially the steak it served without assortements !",
    "rating": 1,
    "date": "01/10/2026",
    "aspects": {
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "My family and I had a lovely time at the 360 restaurant. Ricky and his assistant were phenomenal servers, making sure that we enjoyed every moment and every bite. Ricky was attentive to us all, but made a special connection with my little one and that made the moment even more special. Thank you so much for your attention to detail and care and the love of service you give.<br>The food was good. The view was great. Our steaks were all well cooked! The crab and corn chowder was exceptional!",
    "rating": 5,
    "date": "01/08/2026",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Went here for new years, prepaid for the whole dinner, the appetizers was disappointing, the salad was good, and the dinner options was good the bison steak and the ravioli was surprisingly good. For the price I paid I did expect more options and more portions.",
    "rating": 4,
    "date": "01/06/2026",
    "aspects": {
      "Price": "Neutral",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Everything was wonderful. The staff were very attentive and I really liked how a colour page was provided for the kids to keep them occupied. The kids menu was very appropriate for kids pallets which I appreciated. Adults menu was great too and nice nod to Canadian food (ie. Arctic char and sourdough from a local toronto bakery). Only areas for improvement is to the facilities. It needs some TLC as some chairs were not comfortable & chipped corners of the table. Cleanliness can be improved as well as many marble post that appeared as we routed around the restaurant were dirty. Being the first sitting at 11:30am, I would have hoped these were wiped down the night before or prior to opening. These are the two areas that needs more attention and improvement.",
    "rating": 4,
    "date": "01/05/2026",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "First , food safety is the most important thing, my son of 2 years old found several plastic paper in his soup, and the server said this is just tomato sauce reheat generated layer. Excuse me? Which tomato generate layer that makes plastic sound and is not possible to tear? If it was not a family group meal and I didn’t want to ruin the meal, I had already left the restaurant. The fact that this is kid soup and it could be offered to any other kids less than 2 and may not even tell that it was plastic and ate it made me feel so bad.<br>Then they forced to charge 20% tips without negotiation. If you question that, they will say this is already shown in your reservation.<br>Will never come back again and do not recommend.",
    "rating": 1,
    "date": "01/05/2026",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Dining at 360 The Restaurant at the CN Tower was an unforgettable experience from start to finish. The rotating view offers breathtaking, panoramic sights of Toronto that make the meal feel truly special and unique. Watching the city slowly unfold beneath you while dining is absolutely mesmerizing.<br><br>The food was exceptional—beautifully presented, perfectly prepared, and full of refined flavors. Every course felt thoughtfully crafted, highlighting high-quality ingredients and excellent culinary skill. The service was equally impressive: attentive, professional, and warm, making us feel welcome without ever being intrusive.<br><br>This restaurant is more than just a meal—it’s a complete experience. Whether for a special occasion or a once-in-a-lifetime visit, 360 The Restaurant at the CN Tower delivers elegance, atmosphere, and outstanding cuisine. Highly recommended!",
    "rating": 5,
    "date": "01/04/2026",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral",
      "Food Quality": "Neutral",
      "Taste": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "A great experience that’s definitely recommended. Amazing view, very professional and friendly staff, and unique, delicious food. The atmosphere is nice and calm, without any unnecessary noise. It’s recommended to check the weather before making a reservation.",
    "rating": 5,
    "date": "01/04/2026",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food was very bad the chef did not take any pride in his work very horrible service worst restaurant experience",
    "rating": 1,
    "date": "01/04/2026",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Recently went here with the family, no doubt the prices were high but the view makes it worth it.",
    "rating": 4,
    "date": "01/03/2026",
    "aspects": {
      "Price": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The ambiance is top notch not to mention the breathtaking views 1200ft above. I don't think there's any restaurant that will beat 360. They set the undeniable golden standard. Cosy and fancy 💯.<br><br>Perfect spot for events such as  birthdays, dates, engagement, chill nights and whatever you wish<br><br>This is classy & boujee for sure 👌",
    "rating": 5,
    "date": "01/03/2026",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing experience with a stunning view of Toronto from such a high point. The price is a bit on the higher side, but it’s truly a unique, once-in-a-lifetime experience and definitely worth it. I really enjoyed the steak with the wine sauce, and the non-alcoholic drinks were great especially the coconut one. I highly recommend visiting 360 Restaurant at least once.",
    "rating": 5,
    "date": "01/01/2026",
    "aspects": {
      "Price": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Had an amazing time celebrating New Years Eve at the CN Tower.  We came here to enjoy their holiday pre fixe menu.<br><br>Finding and navigating the tower can be confusing at first, but there is lots of signage and staff to guide you along the way.  Wherever you are seated, you’ll be able to see the city.  There will be enough time during your meal to see a full 360 view of Toronto.<br><br>The New Years Eve Pre Fixe Menu was great.  Everything tasted delicious and flavorful.  No complaints.  The portions of each course were the perfect size.<br><br>Our server Jeff and the staff were very professional and courteous.  Jeff did an excellent job and made sure we had a great experience.<br><br>FYI:  They automatically ADD ON A 20% gratuity charge.<br><br>After dinner you can go downstairs to the observation deck.  Then go down another floor to experience the glass floor.<br><br>Recommend to any first time visitors to Toronto!",
    "rating": 5,
    "date": "01/01/2026",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food quality didn't quite meet expectations!",
    "rating": 4,
    "date": "01/01/2026",
    "aspects": {
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food is tasty and the view impressive.",
    "rating": 5,
    "date": "12/31/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Very cool experience. Food was amazing, which was not expected. Views were great. Too many loud kids around, unfortunately. Definitely a unique experience, would recommend dinner here if you are in town.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This was an amazing experience. The only truly off-putting thing is that to start we were seated in the \"upper section\"; thankfully we were able to be moved to the lower section by the windows for the second half of our meal. The price-justification and cachet of the 360 restaurant are the views of course, and the upper section is a completely subpar experience by comparison. When booking, make sure you book for the \"lower\" window level. Honestly, other than tables for two right by the half-wall, they should not be seating anyone on the upper level at all. Our 2nd half experience was absolutely amazing, but if we had not been able to move down to the lower level with the amazing views I can tell you that I would have been absolutely furious and it would've ruined the evening.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Ambience": "Negative",
      "Price": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This is really fantastic restaurant you must visit because if you have booking here, no need ticket for CN tower and no line up the go to CN tower. First time to try this restaurant at dinner time. Night view is fantastic and incredible . Food quality is high level as well, matching the price and view. We order combo set of adult and kid, Strongly recommend to have booking during lunch and dinner if you would like to visit CN tower.",
    "rating": 5,
    "date": "12/30/2025",
    "aspects": {
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It's an amazing ambience with good food. We did not order any drinks so I cannot comment on that. The best was the service! Steve our waiter was very attentive and professional, timing everything accordingly and very precise. The outstanding service received during our visit will definitely bring us back.",
    "rating": 5,
    "date": "12/29/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Drinks": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Service was excellent. Wait Staff was very attentive by always filling our water and wine glass.  Waiter offered a carafe to decant the wine. Checking to make sure we had everything we needed. Very friendly. Ambiance is on the sull side and could be improved. Burger should be offered on the kids menu.",
    "rating": 5,
    "date": "12/29/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Neutral",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Truffle tries cost $20 comes in a tiny plate with no parm. The server tall, no hair fought me to tell me how the truffle was in aioli. Excuse me? For $20 shaved parm on truffle fries is a must. Fries were sub par.  Lamb was okay, our bill was over $3k and to not be served a bit more than what was on the menu was very off putting. That server needs to simmer down a bit",
    "rating": 3,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We recently dined at the 360 Restaurant at the CN Tower and left feeling conflicted. While the food, wine, and cocktails were genuinely delicious, the overall experience did not align with what is advertised—or priced—as fine dining.<br>From the start, the service fell short of fine dining standards. Our server was very difficult to understand and shared personal stories (including about receiving a police ticket) and asked personal questions that felt inappropriate in a high-end dining environment. This points to a need for more thorough training around professionalism and guest interaction.<br>There were also several operational issues that detracted from the experience. We were told the restaurant had run out of candles and did not have enough for each table. The latte machine was broken, yet a regular coffee with a small amount of milk was presented as a latte, which felt misleading.<br>Additionally, the atmosphere did not reflect a fine dining setting. There was a noticeable mismatch in customer attire—one table dressed in hoodies and sweatpants, another in blazers and dresses—which created an inconsistent and confusing experience. If 360 positions itself as fine dining, clearer expectations around dress code and ambiance should be set and upheld.<br>Unfortunately, the experience felt no different in service quality than dining at a casual chain restaurant like Kelsey’s or East Side Mario’s—aside from the exceptional view. Based on our experience, the quality of service and overall expectations at 360 appear to have declined over the years, and the current price point no longer feels justified.<br>In summary, while the culinary side remains strong, significant improvements are needed in service training, atmosphere, and expectation-setting to truly deliver a fine dining experience that matches the cost and reputation of this iconic venue.",
    "rating": 3,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We got terrible experience from servers in the restaurant. Service was lower than we expected for the price they charge. We paid 900$ for 7 people. They mixed up one of our orders, spilled the water on the table, brought us moulded sweet potatoes. Food was mediocre.<br>And the most unacceptable thing was that our server pre-included 20% tips without even asking us. As we didn’t have experience before, we thought that it was restaurant’s policy. But after reading reviews here I understand that the waiter just fooled us.<br>I would not recommend 360 to anyone!",
    "rating": 1,
    "date": "12/28/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We still here today, and the food experience was very bad. The food or whithout flavor or with bad flavor. The employers just want go home, they dont care about your experience.",
    "rating": 3,
    "date": "12/25/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Nice view the menu needs a change been here few occasions.",
    "rating": 5,
    "date": "12/24/2025",
    "aspects": {
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "My husband took me here for our anniversary. Apart from the view and the nice restaurant, there wasn’t much going on. The food we ordered was terrible, my husband got the prime rib and I got the salmon which was paired with tomato sauce. Both were incredibly bland, we ended up leaving more the 50% of our food. The appetizer with shishito peppers and hummus was nice. But tomato sauce should not be paired with salmon and a little seasoning wouldn’t hurt. My husband said there was a lot of fat on his steak and it tasted bland and from the looks of it, it was almost pale and absolutely not juicy or succulent. This restauraunt was extremely over hyped. Our server rushed us and didn’t really recommend anything. Will not be returning.",
    "rating": 1,
    "date": "12/24/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Babu and the team in section 6 were brilliant! We visited on Dec 14 for dinner and booked an early seating so we could see the sun set. The weather played nice and the sky was clear and we had a stunning view. Inside the restaurant, Babu lead his team through a great service and was very patient with a group of chatty girlfriends hanging out. He was also great with accommodating dietary restrictions. The evening was lovely and everyone agrees it's definitely going to be on the list for when friends and family visit in the future.",
    "rating": 5,
    "date": "12/23/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We came to celebrate our anniversary and were disappointed that there was no acknowledgment, especially after seeing other guests mention special anniversary treats in reviews.<br>During payment, we had technical issues with Apple Pay and did not have a physical card, so we split the bill between cash and card. Despite our intention to tip, the server made jokes about it, which felt unprofessional and made the experience uncomfortable.",
    "rating": 2,
    "date": "12/22/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Absolutely amazing experience friendly service and food was good and The view was phenomenal , fantastic and very beautiful Our server was so friendly ❤️♥️♥️Thank you 🙏",
    "rating": 5,
    "date": "12/22/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Had dinner at the 360 with my wife. My wife chose the indigenous menu and I chose the $75 pre fix. Quite honestly for what you pay the food is just not very good. On a positive note, service was great. The keg would have been a much better choice",
    "rating": 3,
    "date": "12/22/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I was on a layover enroute to UAE and recently had a dinner here with a friend who I haven’t seen in a long time.<br>The service started out strong (friendly, took photos) and then gradually the experience crumbled.<br>The server at first was pleasant informative, however she coughed the entire time and took away from the experience. My thought is, if you’re sick and coughing don’t come to work and risk getting others sick especially in the food service industry.<br><br>The food itself was ok, I asked for an additional sauce for my prime rib and the presenting server was telling me that I had sauce right in front me. I said I know this, I just wanted another one. He seemed annoyed that I asked for more sauce. When you spend an additional $45 for an upsell I think you can have more sauce.<br>My biggest pet peeve of the evening was we felt rushed. As we were eating bread they tried to take it away and I said we were still eating.<br><br>When we were wanting to order desert our server was no where to be found.<br><br>When I was mid sentence showing my friend a video on my phone, the server interrupted us to ask us if we wanted separate bills. I explained to her we were busy at the moment, and she seemed annoyed she had to wait for our response. It was apparent her shift was nearing an end and we were the last folks in her section to leave.<br><br>No server had a problem asking me for a 25% tip on their mediocre, get the heck out of here service for a $165.00 meal.<br><br>Lastly this place was cold , they can easily turn up the heat, but they choose to save on costs and keep the place cold.<br><br>With transportation costs from my airport hotel, and meal this cost $400, the restaurant service diminished the high level city light experience.",
    "rating": 3,
    "date": "12/22/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food are okay. You're pretty much paying for the experience.",
    "rating": 3,
    "date": "12/21/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "My meal was amazing. They accommodated my allergies so well. Only thing I would note is our servers cocktail knowledge. I asked if they could do their signature sour with aquafaba, and the server had no clue what that was. Fair enough, so i clarified and asked for the vegan alternative to egg whites- once again, did not know. A little odd but otherwise a lovely evening!",
    "rating": 4,
    "date": "12/21/2025",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We loved it—great food and a stunning 360° view of Toronto 💕",
    "rating": 5,
    "date": "12/20/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food took a while but we'll worth it our wait staff James was absolutely amazing 💯",
    "rating": 5,
    "date": "12/20/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food and service could be better, but overall atmosphere is great",
    "rating": 5,
    "date": "12/19/2025",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food and service was excellent.",
    "rating": 5,
    "date": "12/19/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing experience at 360 Restaurant! Great food, excellent service, and breathtaking city views.Perfect place for a special occasion<br>Truly memorable!!!",
    "rating": 5,
    "date": "12/18/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Our server was the best. A decent humanitarian who understand people and excellent customer service...we celebrated our dear friend 46th birthday. A great vibe and memory",
    "rating": 5,
    "date": "12/16/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Stunning views on Toronto, enriching experience, perfect for a romantic event, gastronomic food, they try, not as a top class french restaurant but not bad for North Amercia, Beef is at +40$.",
    "rating": 5,
    "date": "12/16/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Good overall.<br>Food was fine.<br>Waiter was nice.<br>View is amazing.<br>Recommend once but not something I would do twice.",
    "rating": 4,
    "date": "12/16/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The Seafood Tower is amazing and services are great. Also fun to go downstairs to the observation levels to take pictures and walk on the glass floors.",
    "rating": 5,
    "date": "12/16/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This was an amazing experience to top off an incredible, if short, trip to Toronto. The staff were so friendly and helpful, the food was amazing, and obviously the views were breathtaking. Thank you so much.",
    "rating": 5,
    "date": "12/15/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great food and service. Also beautiful views of the city",
    "rating": 5,
    "date": "12/14/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "A memorable night at Toronto’s 360 Revolving Restaurant with my beautiful family. Good food, stunning views, and the best company - a perfect combination for a truly unforgettable experience.",
    "rating": 5,
    "date": "12/12/2025",
    "aspects": {
      "Drinks": "Positive",
      "Desserts": "Positive",
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I think the only nice thing about the restaurant is the view because the food was terrible. Although they changed the appetizer I ordered because I couldn't eat it, the other one wasn't any better, and the main courses weren't good at all. The view was beautiful and romantic.",
    "rating": 1,
    "date": "12/09/2025",
    "aspects": {
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food excellent and amazing view love it will be back",
    "rating": 5,
    "date": "12/08/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We had a lovely evening. Great service and the view was incredible.  We will definitely be back soon.",
    "rating": 5,
    "date": "12/07/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Excellent food, service and atmosphere.",
    "rating": 5,
    "date": "12/07/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view and ambience at 360 Restaurant were amazing, but the food was extremely disappointing. From starter to dessert everything was bland, poorly presented, and far below expectations. The overall experience of being at the top of the CN Tower was the only highlight.",
    "rating": 2,
    "date": "12/07/2025",
    "aspects": {
      "Ambience": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Book ahead on their website to guarantee the table. They were all booked when we went (people without tickets were turned away). It is great to go closer to sunset time, as the colors in the sky make it so much more beautiful. I loved the cocktails. When you book your ticket to the restaurant (min 75 spent per person), you also get access to observatory deck. I went to just observatory deck a while back, and I recommend to get restaurant experience, it is much more elevated and enjoyable. Observatory deck is full of people. Restaurant makes you enjoy your time. It is great it rotates, so you can always enjoy the change of view. ❤️",
    "rating": 5,
    "date": "12/06/2025",
    "aspects": {
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Must visit restaurant. You get a great dinner with the set course menu and it allows you to enjoy the view while the crowd is gone.",
    "rating": 5,
    "date": "12/04/2025",
    "aspects": {
      "Menu": "Neutral",
      "Desserts": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Little disappointed in the whole aspect...it ended to be very expensive and the food was mediocre. The deserts were good. Bobby served our food and he was exceptional....",
    "rating": 3,
    "date": "12/03/2025",
    "aspects": {
      "Price": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food much better than expected (though pricey of course). Loved the white chocolate mousse cake. The view is unbeatable. Would probably do again for a special occasion.",
    "rating": 5,
    "date": "12/03/2025",
    "aspects": {
      "Price": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Negative",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food and was service was great!",
    "rating": 4,
    "date": "12/02/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Exceptional Dinner Experience – 10/10!<br>What an absolutely fantastic dining experience! From the moment we arrived, everything was on another level. The food and drinks were truly amazing — every dish was bursting with flavor, beautifully presented, and cooked to perfection. Definitely a solid 10/10!<br>The service deserves its own praise. The staff were incredibly friendly, attentive, and unbelievably fast. They catered to everyone at our table with genuine care and made sure we had everything we needed. They even helped us take photos, which was such a thoughtful and appreciated touch.<br>The whole evening felt effortless and enjoyable thanks to the wonderful team and delicious food. One of the best dining experiences I’ve had in a long time. Highly recommend!",
    "rating": 5,
    "date": "12/01/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Horrible experience!! The waiter - his name is JEWEL, shouldn’t be working in customer service. He was very rude, bizarre and straight up acting on edge.<br>He body shamed my friend and I. Telling my friend about diet when she tried to order. Then went ahead and talked about how his wife was now on diet, how his life had already ended because he has kids. Just bizarre!!<br>I got the manager to come over to the table and told him what had just happened with the waiter. He left and later came back offering us a desert menu!!!😂😂😂ooh the irony in that! Offering us junk after body shaming!!<br>The food was so AWFUL!! It was like someone had sucked all the spices and flavours from it then put it back on the plate🤢.<br>Won’t be going back to this restaurant that’s for sure!!",
    "rating": 1,
    "date": "11/30/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Menu": "Neutral",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "My husband proposed to me here. It was magical! Love the ambience of this place and my waiter was so helpful with explaining the menu items.",
    "rating": 5,
    "date": "11/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Came here for my birthday expecting a good experience and evening , was extremely let down and disappointed this place would be nothing without the view . server was fine , pretty invisible after the food arrived but i ordered the Seafood tower or something like that, that was one of the biggest disappointments and mistakes of that night including picking this place to eat . once i realized that i ordered another meal to make up for it because i didnt want the night to be a waste especially on my birthday, the steak i ordered took forever to come out and had to be sent back because it was extremely undercooked and when it came back it was still undercooked which made me leave it and ask for the bill and leave . $450 usd, wasted.",
    "rating": 1,
    "date": "11/30/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Our $202 gratuity was automatically added to our bill which is fine , but then we were prompted to add another tip on the debit machine and verbally by the server. I was not about to tip more than the $202 already added to my bill. I had to manually enter a $0 on the debit machine and then was given a disapproving look by the server.  I was made to feel very awkward even after spending $1375 on dinner including the $202 gratuity.  Very uncomfortable ending to a nice dinner. Service wasn’t great either for such a nice place. I mentioned this all on their survey sent out the next day and received no response.",
    "rating": 3,
    "date": "11/28/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "⭐️⭐️⭐️⭐️⭐️<br>Had the most beautiful anniversary dinner here — warm service, stunning dishes, and an ambience that made the night feel special. 🥂✨<br><br>The pacing was perfect, the staff were genuinely thoughtful, and the complimentary access to both the main and lower observation levels was such a bonus. The views made everything unforgettable. 🍽️🌙",
    "rating": 5,
    "date": "11/28/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Neutral",
      "Menu": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We were here for my birthday. I expected very better and beautiful interior design, but it was not what I expected. Our host was good but food was disappointing. We ordered beef ribs and salmon for main course. The salmon was ok but it was cold. But the texture of the meat was awful.<br>In comparing the other 360 restaurants in other countries, it was really bad.",
    "rating": 2,
    "date": "11/27/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We went yesterday & unfortunately the weather was bad. We decided to stay & eat. Thankfully the food was very good, so much so we decided to return the following day (today). Weather was so much better which meant incredible views whilst dining. We both loved the food & the service from Bobby was top class. Amazing server & a credit to 360. Would truly recommend this to anyone thinking of going, plus you get free admission to the main observation deck after dining. Thank you for a wonderful experience!",
    "rating": 5,
    "date": "11/27/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Terrible experience at the 360 Restaurant. Our server, Ricky, was very rude, and the food was disappointing and not worth the price. Only the view was nice. Would not go back.",
    "rating": 1,
    "date": "11/25/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Went there to celebrate my birthday. As we exited purple elevator, 2 girls instructed us to stand for photo, so we did. Pretty sure you can refuse if you don’t want to but since it is our first time & none of in a review described this, we did what we asked. Later we found out the picture they took is for us to purchase (if we interested in) for $45+tax cash as the girl came to our table show us the picture & ask if we’d like to purchase it. Anyway, restaurant was busy considering it’s Sunday night, however, my daughter has reserve table for 3 so they sit us by the window which is amazing! The place is rotating 360 degree in 72 minutes as we were told. We were lucky to have a clear night. The foods overall were good. I ordered<br>red wine sangria as the other reviewer suggested. Love it & recommended. I picked 2 course with mussels as my appetizer & chicken for my main. The mussels was alright & in big portion for me. I think I got 1/4 chicken leg with bone removed from the thigh (not sure). It was delicious however the veggies that come with it not so much. My daughter picked the same 2 course meal with shishito peppers. She said it’s delicious & not too spicy. Salmon for her main tastes great. My husband on the other hand ordered ala carte caesar salad. He loves the dressing. King Cole duck duo for his main. He’s not too keen on veggies either. It’s dry.<br>Overall we enjoyed our evening in the city of Toronto. Amazing night out with lots of picture.",
    "rating": 5,
    "date": "11/24/2025",
    "aspects": {
      "Taste": "Neutral",
      "Drinks": "Neutral",
      "Food Quality": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Excellent experience with a rotating floor restaurant. Food was a little on expensive side but worth it because it includes the access to the attraction. Pick a reservation just before sunset to maximize the views.",
    "rating": 5,
    "date": "11/22/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We went into this lunch with very low expectations — we honestly assumed people come here just for the view and the food would be an afterthought. But WOW… we were so wrong, in the best way possible.<br>Grilled Octopus<br>This dish alone changed the tone of the entire lunch. Perfectly cooked — tender, not chewy — with a beautiful char. The greens and sauce complemented it so well, every bite worked. Easily one of the best octopus plates we've had lately.<br><br>Duck Breast + Confit<br>Medium-rare plus, exactly how duck should be. Rich flavor, juicy inside, and that crispy confit skin… perfection. If you’re a duck lover, this one will make you happy.<br>Lamb Shank<br>Fall-off-the-bone tender, super flavorful, and beautifully plated. The only note from us — we wished the polenta puree under it was a bit thicker to balance the sauce. Still delicious overall.<br><br>White Mousse Dessert<br>This one surprised us — light, creamy, refreshing and perfectly sweet. It was the perfect finish to an unexpectedly great meal.<br>Final Verdict<br>We came for the view… and left talking about the food. 360 is absolutely worth the experience — the rotating skyline, the energy, and yes, the dishes are genuinely good. If you’re in Toronto, put this on your list.<br><br>We’ll definitely be back.",
    "rating": 5,
    "date": "11/21/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Neutral",
      "Menu": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I absolutely loved the view and the food. The service was excellent — the servers were attentive at all times and very friendly. Everything made the experience truly enjoyable.",
    "rating": 5,
    "date": "11/20/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food was not good. Was expecting more of a gourmet food but it was more like diner type of food quality. I got salmon and mussels but the sauce the smell was over powering like a bad sea food smell. For the price we paying you should do a better food menu",
    "rating": 3,
    "date": "11/19/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative",
      "Menu": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "You go there only for the view. Really touristic attraction. Food was cold and not that tasty. Service was good though. Sadly, the experience doesn't worth the price. Wine list need to be updated!",
    "rating": 3,
    "date": "11/17/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Negative",
      "Drinks": "Negative",
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "While the atmosphere is quite frankly amazing, the food doesn’t come close to matching it. Although, the servers (not service due to long wait times) do make up for it a little.<br><br>TLDR; Food comped, steak + replacement overcooked and dry, servers + atmosphere good, would not come again.<br><br>From the start, if you have a reservation, expect to still wait in line for 20-30 min, regardless of the time of your reservation.<br><br>From being given the menus, it took a little over an hour to be given 2 steaks with fries. The steaks came overcooked, there was not a slither of pink inside of them. Mind you, we usually order medium but decided to try medium well since we thought this would be a place that could cook them properly. However, the server agreed that the steaks were past medium-well, and quite frankly they kind of tasted like they were past well done as well, but I’m not an expert in food by any means.<br><br>The steaks we received were tasteless, and the sauces that came with them didn’t help. While the fries were good, they weren’t much different than any less expensive place and the truffle sauce was a little gimmicky. The cocktails and drinks were quite good though.<br><br>The servers, although a bit blatantly putting on an act, are very polite and reassuring. Upon checking up on us and seeing our steak, it was taken back immediately. We were also checked up on multiple times while waiting. Ultimately, our steaks and dessert were made free. However, the second set of steaks somehow managed to make one of the steaks even tougher, albeit making the other one softer (although there’s still no pink). The server didn’t even have to ask when she looked at them and apologized extensively while telling us that she’ll talk to a manager because this experience was ridiculous.<br><br>It’s worth noting that although obvious, it’s probably not the best idea for the staff to loudly say “where did that table go”… “they left”… “why’d they leave”… when people are sitting and waiting for food… kind of makes you want to follow their lead.<br><br>While this may be a one off, I read comments with similar grievances before coming, so at this point I’m discouraged from coming back… especially for an anniversary.",
    "rating": 3,
    "date": "11/17/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Menu": "Negative",
      "Drinks": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was a lovely evening. The food is excellent and we felt well cared for. The views of the city lights were very entertaining.",
    "rating": 5,
    "date": "11/16/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We were 30 min late due to bad traffic on the Gardiner coming into town. Staff was really great at accommodating our late arrival. Food was perfect, our server was pleasant. Thank you guys for a great night!",
    "rating": 5,
    "date": "11/16/2025",
    "aspects": {
      "Service": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "⭐️⭐️⭐️⭐️⭐️ A Wholesome, Once-in-a-Lifetime Experience at the CN Tower Restaurant<br><br>I don’t even know where to begin—my experience at the CN Tower restaurant was easily one of the best moments of my life. Harsh had always promised me crazy, unforgettable things, and this time he truly delivered.<br><br>From the moment we stepped into the tower, everything felt magical. The views were breathtaking—Toronto glowing beneath us as the restaurant slowly rotated, giving us a 360° panorama without ever leaving our seats. The atmosphere was warm, elegant, and absolutely perfect for a special night.<br><br>The food was outstanding, but the indefinous mushroom soup was on a whole different level. I still can’t forget the richness of that soup—the deep, earthy flavor paired with the tangy honey-pickled mushrooms was unforgettable. It was the kind of dish that stays with you long after the meal is over.<br>More than the view and the food, though, it was the feeling of being there—sharing that moment, that surprise, that promise fulfilled—that made the night truly special.<br><br>It wasn’t just dinner; it was an experience. A wholesome, heart-filling, beautifully memorable experience. If you ever get the chance to go—especially with someone who makes the moment special—don’t think twice.",
    "rating": 5,
    "date": "11/15/2025",
    "aspects": {
      "Ambience": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "A very memorable birthday dinner！！！",
    "rating": 5,
    "date": "11/13/2025",
    "aspects": {
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view from the CN Tower restaurant was truly spectacular and worth visiting for the scenery alone. However, our dining experience was unfortunately overshadowed by the attitude of one of the male servers.<br>There were three of us, and as soon as we were seated, he asked who spoke English the best. He then said he would only explain the menu to that person and told them to explain it to the others, adding that he didn’t want to repeat himself. This made us feel uncomfortable and disrespected. We understand English well, but regardless of one’s language ability, such behavior is inappropriate and unprofessional.<br>Additionally, the server forgot the beer we ordered. When we reminded him and finally received the drinks, our main dishes had already gone cold.",
    "rating": 1,
    "date": "11/12/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Neutral",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Really good deal for lunch and tour. Prime Rib was very delicious. Great view of the city.",
    "rating": 4,
    "date": "11/12/2025",
    "aspects": {
      "Taste": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Feels expensive but if you consider the tickets included, makes total sense. Great view, outstanding service and great food quality. I particularly liked the chowder soup.",
    "rating": 5,
    "date": "11/12/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Overpriced, but you pay for the experience - which is worth it in my opinion. Service was quick and friendly, but the limited and pricey menu prevented 5 stars. I would still highly recommend coming to eat dinner here at least once though!",
    "rating": 4,
    "date": "11/11/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Menu": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I couldn't fault this restaurant at all, the entire evening was flawless from beginning to end. Jeff's service was outstanding; he made us feel completely at home and was incredibly warm and engaging. We were celebrating our engagement, so it was a truly memorable night we wanted to cherish.<br><br>To start, the slowly rotating 360-degree views of Toronto are stunning, and the food was equally impressive. I had the mussels followed by the steak, both of which were exceptional. My fiancée loved her grilled peppers and mushroom pasta too.<br><br>Overall, it was a perfect evening with superb food, service, and great views of the city!",
    "rating": 5,
    "date": "11/10/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Totally worth it, while the food is a bit on the expensive side, the fact you get access to the tower  it makes a worthy investment. Food is ok, not exceptional, but we went for the views anyway",
    "rating": 5,
    "date": "11/09/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I came here for dinner as a tourist as I wanted to check out the revolving restaurant and try the food.<br><br>You need to spend a minimum of $75 and that's just on food (not drinks), they have al la carte for a Prix Fixe menu for $75 so we opted for that - made it a lot easier. You need to reserve a table online also however you can only to up a month in advance.<br><br>I went for the grilled calamari starter/appetizer and Fogo Island Cod main/entrée. Both were delicious, the calamari had a really nice, extra savoury taste from being pan fried and was cooked perfectly, tentacles included which I loved! The Fogo cod came with a herb crust, tomato based sauce and some new potatoes underneath. Cod itself was perfect, I was indifferent about the herb crust but didn't mind it. The tomato sauce was slightly bland and the potatoes could've been softer for my liking but overall decent.<br><br>My companion went with the Salmon Gravlax to start and Maple Chilli Chicken Supreme. She didn't care for the berries with the salmon, it was cured and she also felt it wasn't the best quality (tasted like supermarket smoked salmon slices). The maple chicken itself was well cooked, moist and the glaze/sauce used wasn't too sweet & perfectly balanced. Found the potato pavé lacking flavour and cold sadly.<br><br>A great experience overall and I enjoyed going. You also get access to the main observation deck as part of your reservation too.",
    "rating": 4,
    "date": "11/08/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Neutral",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The hype of this restaurant did not meet the expectations that you would see in reviews. Though the view is beautiful when you ask for a window seat celebrating an anniversary and then don’t get one. It’s quite disappointing to start your experience. We had a server named Mike Sg Who is less than attentive throughout the entire dinner. The bus boy gave us more attention than the server and constantly clearing and checking in on us throughout the dinner. We saw the server to place our order after he dropped off drinks. We’ve never saw him again until the check was coming.<br><br>We never were asked how our food was. We were never offered additional drinks. Had to ask another server for salt and pepper.<br><br>As previously mentioned, the hype of this restaurant was going to be a great experience and it did not meet that by any means.  For dinner that was over $400 it sure was disappointing.!!",
    "rating": 2,
    "date": "11/08/2025",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Neutral",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Honestly if you have children and would like to bring them to the CN Tower, this is the only way to do it. The meal cost covers the tickets into the tower, and ends up being a really good value. More importantly, it allows you to spend some time and enjoy the views of the city for more than the 5 minutes it will take for the children to get bored of the observation deck. Highly recommended!",
    "rating": 4,
    "date": "11/05/2025",
    "aspects": {
      "Price": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view from 360 is stunning, but the service completely ruined our experience. We had a reservation at 8:30 pm and politely asked if we could move to a window table once one became available. Several tables opened, but our server ignored the request and spoke to us with a dismissive attitude. When he finally moved us, his tone became even more condescending.<br><br>By the end of the dinner, my mother was paying and decided not to leave a tip because of the poor service. The waiter actually said, “Are you not leaving a tip?” while standing over her, which was shockingly rude and unprofessional.<br><br>For a restaurant that charges a minimum of $75 per person, I expected respectful and welcoming service, not this attitude. The view is great, food is tasty, but our server made us feel uncomfortable the entire evening.",
    "rating": 1,
    "date": "11/05/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Good food, great espresso martinis, excellent views.",
    "rating": 4,
    "date": "11/05/2025",
    "aspects": {
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Wow. Such poor food standards. Steak overcooked, service very transactional, very much mediocre food. Would not visit again. View was great though! Zero wait time between courses. Don’t visit. Just do viewing deck and eat elsewhere",
    "rating": 1,
    "date": "11/04/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food and service was good. The rotating aspect of the restaurant is definitely a cool novelty",
    "rating": 4,
    "date": "11/02/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Little bit on the costlier side! But service and food were good!",
    "rating": 3,
    "date": "11/02/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I had an absolutely terrible experience at the 360 Restaurant at the CN Tower while trying to use my gift vouchers that I had from Feast On for my boyfriend’s 40th birthday dinner.<br><br>When I showed our vouchers to the server, he had to get the manager. The manager then asked to inspect my phone and emails and made us wait about over 30 minutes while he made “phone calls” to verify them —  It was humiliating and made me feel like I was doing something wrong when I was simply trying to redeem a legitimate gift. After waiting that long, they ended up declining them, even after showing how they are on the actual feast on ontario website.<br><br>To make things worse, the food was disappointing. The prime rib was fatty and grilled like a steak, and the chicken was dry and rubbery.<br><br>What was supposed to be a special night turned into one of the most uncomfortable and embarrassing dining experiences I’ve ever had. I left in tears. I would never recommend this restaurant to anyone — especially if you’re using a voucher or celebrating a special occasion. Absolutely degrading and disappointing. I reached out to feast on and they were incredibly apologetic and disappointed for me. What is supposed to encourage you to experience new restaurants, turned into a complete discouraging awful one.",
    "rating": 1,
    "date": "11/02/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Atmosphere is amazing but the food is decent at best and the servers all have a horrible attitude…they are rude or just ignore you constantly",
    "rating": 2,
    "date": "11/02/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We were there for our anniversary and had a terrific dinner. Dinner was delicious service excellent. Bobby our server, was excellent, gracious, and attentive.",
    "rating": 5,
    "date": "11/01/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Incredible view, good food an decent drinks, but the service not that good, from the begining the waiter was counting each price warning us about the $75 minimun per person, i wasnt asking.",
    "rating": 3,
    "date": "11/01/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Went for dinner in a group. This is a tourist trap higher than normal prices are expected. They try to source food locally and surprisingly the prices were reasonable- 3 courses for $100.00. However even though the food was good the portion sizes were small. Service was good, but the place is quite loud. They offer a chocolate dessert, but it is only available as a vegan option. They should offer a non-vegan version",
    "rating": 4,
    "date": "10/31/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great view. Better food and friendly.",
    "rating": 5,
    "date": "10/31/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I had a good dinner, but a fantastic view and that is what you will pay for. Beautiful views especially if you go for sunset!!<br><br>If you like seafood, specifically scallops, definitely get them, they are delicious!<br><br>An iconic “one time” experience!!",
    "rating": 3,
    "date": "10/30/2025",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Very friendly atmosphere  I like it very much",
    "rating": 5,
    "date": "10/28/2025",
    "aspects": {
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Our waiter in section 9 (and his support staff) were great.  I think his name was Justin?  We brought friends from Poland who were visiting and we all thought it was an incredible experience.  I forgot as a Torontonian how great a spot it is!  Hope to visit again soon.",
    "rating": 5,
    "date": "10/27/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "After spending $500 walked out very disappointed. The menu is absolutely horrible and needs an overhaul. for example, spending $90 on steak and if you don’t order sides, it comes on a plate with nothing on it. Servers arguing on sides. Only 2 Sharable apps. view is great but food is not.",
    "rating": 1,
    "date": "10/25/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We went to the 360 Restaurant at the CN Tower to celebrate my boyfriend’s birthday — a very special day that we were truly excited about. We expected a world-class experience from such a famous and expensive restaurant. But the moment our food arrived, we were shocked to see a fly sitting on top of the dish.<br><br>This completely ruined our appetite and the mood of our celebration. Although the waiter replaced the food, the damage was already done. We still paid the full bill and even left a tip out of respect, but honestly, this should never happen in a restaurant of this level.<br><br>It was embarrassing, disappointing, and offensive to experience such poor hygiene and quality control at one of Toronto’s most iconic dining spots. I truly hope management takes this seriously, because no guest should go through this — especially during a special occasion.",
    "rating": 1,
    "date": "10/24/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Besides the amazing view, the food was delicious , we loved the presentation. The service was great, exactly what we would expect it to be. Everything was explained very well, this is a great way to view the city and have an awesome meal.",
    "rating": 5,
    "date": "10/22/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food was exceptional. Ambience and experience was top class. Only the quantity of Sangria pitcher was very less. It should be atleast 4 Glass servings as per the standards of a pitcher.",
    "rating": 5,
    "date": "10/22/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing experience, with even better  service!  Thank you Spiro.",
    "rating": 5,
    "date": "10/21/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The best thing about this restaurant is the amazing view and the novelty of a rotating restaurant 1000 ft in the air. Otherwise, the food was mid for the price ($75 per person) and the service provided by our hostess was lackluster. We did appreciate the busser / server assistant for helping us with our various requests.",
    "rating": 3,
    "date": "10/21/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great views and an experience to have dinner<br>Unfortunately the food was not good. I had calamari to start, it was cool in temperature and wet with oil. The beef I had for main was just okay. Probably not worth visiting the restaurant and just go up for the views.",
    "rating": 3,
    "date": "10/21/2025",
    "aspects": {
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "we visited to celebrate a birthday and left with such wonderful memories!!<br>the steak was a bit underwhelming but the lobster and risotto were absolutely delicious!",
    "rating": 5,
    "date": "10/20/2025",
    "aspects": {
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Very beautiful view but the staff just try to send you away asap and it was not pleasant.<br>Food was average with overcooked fish.<br>Very expensive view…",
    "rating": 3,
    "date": "10/19/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Had dinner here on a Saturday night and sat by the windows. Ate good food but had terrible service by our waiter Hameed. Made our experience very unpleasant and not want to come back. BEWARE IF YOU GET THIS WAITER ASK FOR ANOTHER ONE!!",
    "rating": 3,
    "date": "10/19/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "For such a tourist spot, the foods are especially creative, love that!",
    "rating": 5,
    "date": "10/18/2025",
    "aspects": {
      "Desserts": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Absolutely amazing time. Food and service was amazing. And the view is top notch",
    "rating": 5,
    "date": "10/16/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food truly surpassed my expectations in both taste and presentation. I tried something outside my usual choices and was amazing. The service was top-notch, and the revolving view of Toronto added a unique and memorable touch to the experience. It’s an ideal place for a special celebration or for anyone exploring the city. I’d definitely recommend it!",
    "rating": 5,
    "date": "10/14/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "What an amazing experience! Beautiful!  Took a few minutes to get used to the rotating building but other than that, it was wonderful food was delicious",
    "rating": 5,
    "date": "10/13/2025",
    "aspects": {
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Made my reservation at 9pm and arrived on time. However, it took an additional 35minutes to be seated. Before being seated, I walked to the hostess stand and saw 3 employees talking amongst themselves ignoring me to the point where I had to ask the hostess/manager if we were going to be seated at all.<br><br>Shortly after, they apologized and immediately found us a table. Due to this reaction, I felt that they had forgotten about my wife and I and attempted to recover by giving us a table within seconds.<br><br>Additionally, our server seemed like he was in a bad mood and did not arrive back at our table for about 20mins after the first visit. At this point, it is approximately 9:50pm and I had to ask a different server that we were ready for our order (he was polite).<br><br>Food -<br><br>risotto 1/10 way too much oil felt like you were drinking soup<br><br>Cod 1/10 bland overall flavorless<br><br>Grilled calamari 9/10 really flavourful highly recommend<br><br>Spaghetti 2/10 flavorless.<br><br>This visit was for our wedding anniversary and was overall disappointed with the experience. I am not one to usually write reviews but felt that this messaged needed to be conveyed in order to help for the next guest's experience.",
    "rating": 1,
    "date": "10/13/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food is nice, service not",
    "rating": 5,
    "date": "10/13/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Everything was great except for my plate of food. I ordered the half lobster and I literally was only able to only get one piece of good lobster meat off of it.",
    "rating": 4,
    "date": "10/12/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing view of city while having food. Amazing food. Highly recommended",
    "rating": 4,
    "date": "10/12/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It is all about the view, absolutely fabulous way to take it in. Would definitely go back to restaurant if I wanted to see the view from the CN Tower again. Much better value than observation level tickets.",
    "rating": 5,
    "date": "10/11/2025",
    "aspects": {
      "Price": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Came here with family and some extended family visiting Canada for the first time. We decided to get the nachos and it was expensive but it did come very fast!<br><br>When we got the nachos, we saw that there wasn’t enough cheese on it, so when we complained about it, they came took it away and got us a brand new one with more cheese, no questions asked!<br><br>Very attentive and helpful staff members that are understanding. Their brownies were also the best I ever had and the cookies weren’t bad either! I do recommend eating here and enjoying the beautiful views from the CN tower of Downtown Toronto, Lake Ontario and the surrounding GTA. It’s amazing to see the view from so high with good food especially if you’re new to the area or visiting!",
    "rating": 5,
    "date": "10/10/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing views and delicious food! Such a stark contrast between the experience in the restaurant versus the main observation deck below. We enjoyed admiring the view in the comfort of our dining table. You do notice the rotation but it is not motion sickness inducing at all. It took about 1 hr for a full rotation. 360 guests have their own dedicated elevator so we didn't have to queue at all. Our server Keith was amazing, and the food, even though somewhat overpriced, was delicious! Ordered the Alfredo pasta for our toddler, and for a simple kid's meal, it was absolutely delicious, the adults ended up eating most of it. Ended up spending almost $300 USD for 3 adults and 1 toddler, including tip. Overall, it was worth it. You must reserve online ahead of time- reserved ours about 2 months ahead.",
    "rating": 5,
    "date": "10/07/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The views are absolutely the reason to go. The location and overall experience are what make 360 special.<br><br>The service was good and there was no wait time to be seated.<br><br>That said, I’ll be honest — my first visit about a year ago (during the day) was much better. On this last visit, the food quality was a bit disappointing compared to before.<br><br>It’s definitely an expensive place, but you’re really paying for the views and the unique experience, not so much for a top-tier culinary experience. Still, it’s worth visiting at least once — especially if you’ve never been.",
    "rating": 5,
    "date": "10/07/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Negative",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I Had food and drinks at youth center after burial and funeral active.",
    "rating": 4,
    "date": "10/07/2025",
    "aspects": {
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is nice, but the service completely ruined the experience. Our waitress, Juli, was rude and disrespectful from the start. Her unwelcoming attitude made us feel uncomfortable and spoiled the visit.",
    "rating": 1,
    "date": "10/07/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Oysters had dirt and shells in them. We ordered a half dozen and 5 of them were still dirty and gritty. Lamb chops would’ve been better with a different seasoning, maybe a mint sauce. Wasn’t a personal fan. The issue was the scallops - served ice cold when we were told it was a hot dish. We were then told to order something else if we didn’t like the scallops cooked that way. Terrible experience considering the price and venue - would definitely not ever recommend. You’d think torontos biggest attraction could have at least decent food. Overall 3/10",
    "rating": 1,
    "date": "10/06/2025",
    "aspects": {
      "Price": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was an experience of a lifetime. We were made to feel special from the moment we walked through the door. The service was exceptional and the food was exquisite.",
    "rating": 5,
    "date": "10/06/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I am saying this with genuine concern, the food I got today was actually great but our server, MIKE was unbelievably rude! It’s too bad because I quite enjoyed the muscles and the prime rib that I got.  Pricey but I get it, you are here for the experience. This was my first time dining at 360 restaurant. The pre-fixe menu had reasonable options in my opinion.<br><br>To break it down, Mike asked us if we wanted still water or sparkling. Everyone was quite busy chatting as we were a big table of 10. Then came the glass bottles of water, which cost our table an additional $40+.<br><br>Then other servers who were helping Mike suddenly offered us tap water for refills after the first course was complete. We were the only table who were upsold bottled water in our section of the dining hall.<br><br>Mike was consistently aggressive the entire evening. From asking from the beginning if we’re paying only with one bill. I have never been asked this question before at any other sit-down restaurant prior to a meal. He barely attended our table, his colleagues did. Most of us got steaks and 3 of us didn’t get steak knives. We had to ask for it. He was also standing there supervising and not once did he offer us water refills. His two teammates I guess were tasked to help him.<br><br>When I was finally decided on what alcoholic drink to get; Mike was nowhere to be found so I had to ask another server for the beer. Mind you I waited for about 10 minutes or so and good thing his colleague came by with more water.<br><br>He also seemed pretty upset that we did separate bills as well. For a group of ten individuals. Was he really expecting anybody from one big table to foot a bill of $1,100+? It was quite obvious that this was not a family dinner. And we were a group of friends. My bill alone was $140+ with automatic gratuity included in the bill. That tip hopefully was shared with his colleagues as I would not have given such a big tip for a disappointing experience with our server, Mike.<br><br>I also need to highlight that for some reason, my apple pay didn’t go through twice using the debit machine. I am not sure why either. But his response to this was “DECLINED SIR” both times insinuating that I was at fault that their machine somehow didn’t accept my apple pay tap. I used my actual debit card instead and then that worked for some reason.<br><br>I even witnessed this guy point to my friend on my left giving him a signal that it’s his turn to pay. You can see it from his facial expression as well on how he was impatient with my friend who was distracted talking to another friend on his left side.<br><br>Please remind your servers that people know 360 is not a cheap place to dine at. He made it seem that we were there as teenagers who was not ready to act like adults. I would never get this type of obnoxious service outside.<br><br>I don’t know what our server was going through outside of work, but that was the most uncomfortable I’ve been at a restaurant because of this server’s awful attitude towards guests.",
    "rating": 1,
    "date": "10/06/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Neutral",
      "Menu": "Positive",
      "Drinks": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is amazing, service is also fantastic. The food was middy but overall worth it",
    "rating": 4,
    "date": "10/03/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great venue, polished and friendly service from Bobby (36 yrs he has worked there!), great martini and wonderful menu.",
    "rating": 5,
    "date": "10/02/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Only the view and the food is good.  Service is lacking.  We were charged 20% gratuities on our bill which is $144 extra, for limited service.<br><br>Waiter just took the order and delivered the food.  Service cant even compare to local restaurants like Joey, Milestone, Moxies......",
    "rating": 3,
    "date": "10/01/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is of course unbeatable! The food is understandably very overpriced and I wouldn't say the quality is that great. The service is also not the best... but I would still go at least once to experience dining above the entire city",
    "rating": 3,
    "date": "09/30/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I was very disappointed with my experience at 360 Restaurant. My reservation was at 5:15 pm, but I wasn’t seated until 5:50 pm. This was especially frustrating because I made the booking as a surprise marriage proposal for my partner, and it completely ruined the start of a very special evening.<br><br>On top of that, I paid an extra 135 CAD for a window table at 5:15 pm, so the table should have been ready when I arrived. Instead, I was told to wait because the table wasn’t available, which felt unacceptable considering the extra charge.<br><br>The service was also disappointing—our waiter even brought dessert without a fork. Overall, it left a very bad impression and I cannot recommend this place.",
    "rating": 1,
    "date": "09/30/2025",
    "aspects": {
      "Service": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "A overwhelming experience for me as a photography buff and admirer of good food and service.<br><br>The views offered are simply awesome, you can see the surrounding as if from flight, don't forget to make a time lapse movie that would make you proud.<br><br>Food, as expected, was excellent, service very friendly and helpful while not being obtrusive. Big thanks to the server and usher lady.<br><br>To start with, the views from CN tower lift while ascending itself is quite rewarding. You are arriving at restaurant and after dining, you get free access to observation deck and glass window floor to look through and stand on the glass panels which offer the view if ground floor from 350 meter level. There you can buy the top deck ticket for 12 CAD and ride another lift to go to 450 meter level which is highest visitors can go. Nice view from there also, you can see two rail stations, lots of highways, Billy airport and numorous skyscrapers along with beautiful lake.<br><br>Tip - you can reserve the table at 360 in advance, can skip the line while entering tower, get free access to main observation deck and very good dining experience on the price of minimum 75 CAD spent per head in restaurant, where as you can buy a 80 CAD ticket for CN tower entry, long line with free vitamin D greets you and you have to spend extra on food with limited seating, access to only main deck levels and still have to pay 12 CAD extra for top deck. So, booking a table in 360 works out to be more rewarding.",
    "rating": 5,
    "date": "09/30/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Went there for my wife’s birthday and was really disappointed. The menu was weak, so we just had fries and drinks—but even that was overpriced. On top of it, they slapped on ridiculous charges like an “elevator fee” if you dont spend $75 per person. Definitely not worth it.",
    "rating": 1,
    "date": "09/30/2025",
    "aspects": {
      "Price": "Negative",
      "Menu": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "⭐️⭐️⭐️⭐️⭐️<br>We had an outstanding experience! Our server Zahid was incredibly attentive, friendly, and professional. Every detail was taken care of with a smile, and the recommendations were spot-on. The service truly elevated our evening and made our dinner even more enjoyable. Highly recommended!",
    "rating": 5,
    "date": "09/29/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing service with the man Carlos ! He really made my fiancé and myself , really feel like we were the only ones in the sky ! First time experiencing anything like this in my life ! Food was amazing . Strongly recommend Carlos , for that special night , with your special partner !<br><br>Kudos my friend , till we see you again .<br><br>Jeff and Michelle . Sept 27/2025",
    "rating": 5,
    "date": "09/29/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We really enjoyed our dinner at 360 Restaurant. The food was tasty, the service was friendly, and the view was amazing. A great experience overall!",
    "rating": 5,
    "date": "09/28/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Horrible experience. Food over priced and very small portions. Server was extremely rude. For me, my husband and 9 year old son we spent $450 CAD and I wasn’t sure what I ate for that much. Horrible sky line. We were told you can go down a floor to see the skyline from the glass window but when you go there to take pictures over looking the skyline there are TV on the wall and lights all over that will give a glare in every direction.<br><br>Over all very bad.",
    "rating": 1,
    "date": "09/28/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Beautiful restaurant with great service. Thank you to our waiter James who made the experience very enjoyable!",
    "rating": 5,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This is not just a meal, it’s an event, and not to be missed if you are in Toronto.<br><br>First… I think it is worth mentioning that whilst not cheap, this is a very good value restaurant if you compare similar experiences in London, Paris and elsewhere. The food is good quality, the service is delightful and the wine list has something to suit everyone.<br><br>It was the last day of our 30th wedding anniversary trip and the staff made a real fuss of us but without the being intrusive.<br><br>And why is this an experience. Fron 45 floors up, your table will do a full 360 degree rotation in 72 minutes. The view is fabulous.<br><br>Very highly recommended.",
    "rating": 5,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Neutral",
      "Food Quality": "Positive",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The view is clearly the main event here. We went at dusk to watch the sunset but getting through security, up the tower, and waiting for a table took about 30 minutes so I recommend getting there early to navigate the various checkpoints. Our server was very nice but the service was slow. We sat with empty glasses throughout the dinner. The food is very expensive and selection is somewhat limited. The experience alone makes it worthwhile but I feel like once is enough.",
    "rating": 3,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "A wonderful restaurant with a stunning view of Toronto from the CN Tower, excellent service, delicious food, and helpful staff. My wife and I had a delicious, relatively inexpensive dinner. We'd especially like to mention our ticket consultant, Harsh. This young man captivated us with his patience, helpfulness, and friendliness. He helped us make an online reservation and even explained how to refund our existing tower tickets, as restaurant guests can enter the tower free of charge. The ticket office staff were also very helpful, understanding the situation and accommodating us with a refund. Thank you all very much. The CN Tower and restaurant staff cemented our positive impressions of your beautiful city and its people.",
    "rating": 5,
    "date": "09/27/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food tasted terrible and extremely overpriced. Service was almost non existent that I didn't even want to tip but I had no choice because it was included in the bill already. They also tried to give me half lobster for the seafood tower even though the menu said full lobster. Seats were also so close to each other there's no privacy between tables.",
    "rating": 1,
    "date": "09/26/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Menu": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was a truly sensational experience! Many thanks to Paul for his wonderful service and to all the staff who made our day at 360 at the CN Tower so amazing and unforgettable",
    "rating": 5,
    "date": "09/24/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The views from the CN Tower are absolutely breathtaking, easily the highlight of the entire experience. The atmosphere in the restaurant is fine, nothing remarkable, but the stunning scenery more than makes up for it. Unfortunately, the food doesn’t come close to matching the setting.<br><br>The pacing of the meal felt rushed from start to finish. Even though we specifically asked for a relaxed service, our mains arrived barely a minute after our starters were cleared. The bill was presented immediately after dessert, without us asking for it, leaving no chance to order a coffee or linger a bit. It was clear they wanted to turn the tables as quickly as possible.<br><br>We started the evening with a glass of 360 Blanc de Blanc, followed by a shared carpaccio. The starter was fine, but ultimately forgettable. For the mains, the duck breast was cooked reasonably well, but both the meat and accompaniments lacked flavour. The real disappointment was the striploin. At $80 CAD, I expected a quality cut of beef, but the steak was subpar and tasted like it had been pre-cooked a while ago and simply finished on the grill. To make matters worse, it’s served completely on its own. No vegetables, sauce or presentation, just a white plate and a steak. Fries and sauce cost an additional $23 CAD, which feels excessive given the already steep price and underwhelming quality.<br><br>For dessert, we shared the white chocolate mousse. It was the best dish of the night, though still fairly ordinary.<br><br>The wine list by the glass features exclusively Canadian selections, which is a nice idea in theory, but the options were average and noticeably overpriced.<br><br>The one true bright spot was our server, who was very friendly and attentive, which elevated the experience somewhat.<br><br>In the end, we spent $380 CAD for two people, having shared both a starter and a dessert. While the view alone is unforgettable, the food and overall value simply don’t justify the price. It’s worth visiting for the scenery, but sadly, that’s about where the appeal ends.",
    "rating": 3,
    "date": "09/24/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative",
      "Menu": "Negative",
      "Drinks": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Well worth visiting to get a really nice meal. Waiter service was very good (apart from clearing the table whilst still eating!). Food was excellent nicely presented.",
    "rating": 5,
    "date": "09/24/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Beautiful views and wonderful way to visit the CN tower. We made a reservation at the restaurant while there for lunch and the girl who took it was absolutely lovely - just from simple chit chat we told her we were visiting Toronto as an early grad gift for our daughter and she added this to the comments on our reservation. After being seated the waiter congratulated our daughter which was sweet and they even brought her out a dessert with a congratulations chocolate on it! The food was very good and played beautifully - the soup was a tad cool. We ordered a bread basket which ended up at a different table but that’s ok.<br>I don’t know if we would return because it’s quite pricey but nice to visit once :)",
    "rating": 4,
    "date": "09/23/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This place sucks. The food is overpriced and mediocre and our server Steven was absolutely horrible. Every conversation with him felt combative. He was extremely rude and was literally arguing with us at multiple points during dinner. Finally the manager came over and resolved it and assigned a new server named Shane who was actually very good and friendly. Steven is rude and combative and shouldn’t work in the service industry.",
    "rating": 1,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Celebrating my birthday at CN Tower 360 was an absolutely unforgettable experience 🎉✨. From the moment we arrived, everything was flawless – spotless cleanliness, an elegant and cozy atmosphere, and breathtaking panoramic views of Toronto.<br><br>The food was truly exceptional 🍽️, perfectly balanced and beautifully presented, while the cocktails were creative, refreshing, and expertly crafted 🍹. What truly elevated our experience was Lisa R., our server – her warmth, attentiveness, and professionalism made us feel incredibly special and turned our birthday celebration into a memory we will cherish forever.<br><br>For anyone planning a special occasion, it’s highly recommended to book in advance, and with a minimum spend of $75 CAD, you can enjoy the spectacular view from the tower while dining.<br><br>If you’re looking for a unique dining experience with stunning views, exquisite cuisine, top-notch cocktails, and service that goes above and beyond, CN Tower 360 is absolutely the place to be. A celebration truly worth every moment! 🥂✨",
    "rating": 5,
    "date": "09/22/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great dinner date for your special occasion!",
    "rating": 5,
    "date": "09/21/2025",
    "aspects": {
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I got to celebrate my birthday here and it was fantastic! I had heard from friends that the food was great and was it ever! The tasting menu made it easy to make the 75$ dining requirements, and the food and drink spoke for itself. Starting with the mussels, they are very light with just enough curry not to overpower the other flavours. It seems to have been very popular as nearly every 5 minutes another plate was wafting by. I got the red wine sangria and would recommend it by the glass; the pitcher doesn't really make it worth the price with the amount of ice. The salmon was cooked very nicely and was quite tender. The vegetables and caviar added complimentary flavours and was a well portioned meal. I closed the meal with the dark chocolate torte which had a great texture considering it was vegan.<br><br>Overall, the free viewing experience from the CN tower was great but the food and service far exceeded it. Cheers 🥂",
    "rating": 5,
    "date": "09/20/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Good to go!<br><br>The environment is beautiful, the seating is comfortable, and I really appreciate the food at this restaurant.",
    "rating": 5,
    "date": "09/20/2025",
    "aspects": {
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great time, food & experience..",
    "rating": 5,
    "date": "09/20/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The 360 restaurant view is spectacular specially if you get by the windows. They have limited menus ,a bit pricey but still the food is good. Our server was Maks Such an excellent person.He gives us detail on each menus. Ohhh and I can’t say enough how great videographer he is , if he takes your pictures prepared to be amazed. Overall it was an excellent experience.",
    "rating": 5,
    "date": "09/20/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Menu": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great view, small portions of food and very expensive",
    "rating": 4,
    "date": "09/19/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Positive",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Loved the food and view,  awesome experience",
    "rating": 5,
    "date": "09/19/2025",
    "aspects": {
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Went there whilst on holiday and found the food amazing, possibly the best steak I've ever eaten. Will definitely be coming back soon.",
    "rating": 5,
    "date": "09/19/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The taste is really quite disappointing.",
    "rating": 3,
    "date": "09/19/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Showed up to reservation on time, and we were told that our table was being set and it would be 5-10 mins.  We waited for more than 15 mins and approached the hostess stand as we saw new people arriving in the waiting area and being seated before us.  Apparently, the ticket was never printed for the host team to know we arrived.  They again told us to wait another 5-10 mins.  When I informed them that we were told that earlier, they worked to get a table ready for us right away.<br>The server and meal were very good.  Service was a bit slow at times, but our server was very friendly and knew a lot about the restaurant.  We were able to sit for just over a full rotation around.",
    "rating": 3,
    "date": "09/19/2025",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was my birthday dinner and my boyfriend got so sick off the mussels and oysters we ordered. Very fishy and they tasted like feet. Ruined the whole evening. For the price you’re paying would NOT recommend.",
    "rating": 1,
    "date": "09/18/2025",
    "aspects": {
      "Price": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The fact that we had to wait another 35 mins despite having a reservation in line was a bit disappointing but the food really well made. The view was amazing and the server was super nice and friendly (although they could have more people serving so the service goes smoother imo)",
    "rating": 5,
    "date": "09/17/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food was mediocre at best. Our server disagreed that our steaks were overcooked. I asked for medium well and it was so well done that was a struggle to cut. My sister in law asked for medium and it was barely pink in the center. Our server stated the  steak was on the acceptable “edge of doneness.” What would  have been acceptable was to have our steaks sent back and prepared correctly. 1 of our 3 desserts were actually good.  I believe most the employees could use better training in food preparation and serving.  It was our first time in lovely, beautiful Canada but our last time at the 360 restaurant.",
    "rating": 3,
    "date": "09/16/2025",
    "aspects": {
      "Service": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We had a lovely time at CN Tower and we went for the lunch option at 360 Restaurant with complimentary access to the observation tower. Views are great. It can get very busy. It was spoilt a little while we were served by a stressed waitress who did have an attitude. I left a tip that I thought was appropriate for the ocassion.",
    "rating": 4,
    "date": "09/16/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Worth every penny.<br>Don't miss it guys.<br>😊",
    "rating": 5,
    "date": "09/16/2025",
    "aspects": {
      "Price": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I was really disappointed in this experience. I know they say it's good value to dine and then get access to the viewing platform, but if you enjoy food don't bother. Pay for the view, skip the meal.<br><br>First impressions were that the restaurant smells bad. As soon as the doors opened I noticed it.<br><br>Our seat was an inside booth, but that was ok. The view is still good. The service was patronising - I think most people understand the concept of a two course or three course menu.<br><br>My food was bland. I had the duck and it was just ok. My husband's was awful. He was served mussels that were closed in a broth that was inedibly salty. When he reported it to the server he was told that the mussels are in a large pot and it would be impossible to check for closed ones, as though it was unreasonable for us to expect not to be served dangerous food. His main was herb crusted cod with seasonal vegetables - the fish was rubbery and the veg hard. Our desert was nothingy.<br><br>I was very disappointed in the food and worse, was made to feel unwelcome and uncomfortable by the wait staff. Not a good experience.",
    "rating": 2,
    "date": "09/15/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The gratituty charges are too high<br>Artmosphere is great<br>Food was good but not great<br>Dessert was good not the best",
    "rating": 3,
    "date": "09/14/2025",
    "aspects": {
      "Desserts": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "he place is beautiful with an amazing view—no questions about that. Most of the crew, waiters, and waitresses are pleasant and friendly, which made the experience enjoyable. Unfortunately, Hamid was the exception. He is by far the worst waiter I’ve encountered—rude and dismissive. I would have gladly given 5 stars, but because of him, I can’t. I feel sorry for the rest of the team, as Hamid’s behavior really damages the restaurant’s image.",
    "rating": 1,
    "date": "09/13/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This restaurant is a disgrace to Canada.<br><br>Here I am, dining at the top attraction in the largest and richest city in Canada. Never did I expect to be served such appalling food. As a visitor, I view this as an absolute disgrace to this beautiful country.<br><br>My friend and I ordered the three-course dinner for $90 each. I added an extra $15 for the steak - the worst decision of my life.<br><br>I asked for medium-rare, but I got a medium-well steak (see photos). I immediately complained to my server and mentioned that there might be a mistake. He insisted that it was medium-rare and explained that the steaks were pre-cooked and not grilled, which is why it didn’t look pink enough. I was shocked by this revelation, especially since I had paid extra for it. Seeing my dissatisfied expression, he offered to get me a new steak. However, considering his defensive attitude and also why I would want another one if this is just how they cook it, I declined. I attempted to finish my steak but failed. The potatoes and asparagus were poorly cooked as well.<br><br>What a shame.",
    "rating": 2,
    "date": "09/13/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "\"We have a 8pm reservation (not seated until 830pm) waiter can with menus and asked if we wanted drinks and then wanted to take out food order at same time we were not ready! Food order taken and drinks arrived (worst Whiskey Sour ever) food arrived ( my steak was barely warm would have sent it back except I was hungry and didn’t want to wait! The server was terrible ( no real server skills) very hap haphazardly! Even seen the bus boy setting a take with cutterly that was cross contaminated with napkins from the floor! Would not recomend. Pay 5 ⭐️for 2 ⭐️ experience",
    "rating": 2,
    "date": "09/11/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative",
      "Drinks": "Neutral",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "it was amazing on eve i got to the cn tower i was a bit early so there is a little free souvenir mall ish you should  arrive 15 early the children’s menu is so cheap and great it’s $40 and you can chose 3 courses and if it’s ur birthday they put a candle and a choco happy birthday sign One thing i was surprised was the restaurant moving the whole time i even got to see th blue jays stadium You also see the whole toronto downtown and the island it’s a must do",
    "rating": 5,
    "date": "09/11/2025",
    "aspects": {
      "Price": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This is a quiet and romantic restaurant that I truly loved. The experience was wonderful, the food was very delicious, the service was great, and the view was absolutely beautiful!! I definitely recommend it.",
    "rating": 5,
    "date": "09/11/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food and drinks were 10/10. Service sucked so bad though. Paid almost $400 but the hosts made it seem like it wasn’t worth it. Need to train these people especially that one Asian lady.",
    "rating": 2,
    "date": "09/11/2025",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "$65 for mushroom risotto. LOL!",
    "rating": 1,
    "date": "09/11/2025",
    "aspects": {
      "Price": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "An unexpected visit by my cousins from Hong Kong, I took them to CN tower 360 restaurant for dinner! As I said unexpected therefore I didn’t make the reservation in time! Restaurant declined my online booking but advised me to try walk-in but no guarantee for seating! I went and luckily the lady at the front desk managed to accommodated us! What a nice surprise! I love this restaurant as I go almost every year , the service is great and foods are delicious! My guests were happy with the foods and amazed with the views! Thanks again for making our day completed with satisfaction!",
    "rating": 5,
    "date": "09/10/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This is the first rotating restaurant I visited so the first impact “wow”. The view is of course amazing and the fact that it rotates almost twice while you enjoy a 3 course meal is also great.<br>If you come and have lunch/dinner here you get to visit the deck after - the rule is to spend minimum 75CAD per person. This is very easy to obtain - you either get a fixed price menu or you order à la carte. All ways you spend more because the drinks are separate.<br>The food was very good. The oysters were fresh and the salad tasty. The lobster was nice but not the best I ever had, and the beef was too uncooked for my husband taste (even though he mentioned he wanted it a bit more cooked than this).<br>The sides were all perfectly cooked.<br>Is true what people say - if you gave a great dessert all the dislikes from previous courses disappeared 😂 I had an amazing mousse with pear and my husband had a chocolate and sour cherries dessert - taken at the recommendation of the waiter. Both were great!<br>Service was impeccable.",
    "rating": 5,
    "date": "09/10/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "My partner and I came here for our anniversary, and it was unforgettable. We were seated at a window table, and the slow rotation of the restaurant meant we had a full 360-degree view of the city by the time we finished our main course. The service was impeccable—our server was attentive and knowledgeable about the menu. The regional Canadian dishes were expertly prepared and beautifully presented. This is a bucket-list experience for anyone visiting Toronto.",
    "rating": 5,
    "date": "09/09/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "If I could give this restaurant zero stars I would first of all we had reservations at 9:30 and these people were rushing us when we got there the food was disgusting and we ordered a chicken like steak which had fat all on the food when I wouldn’t recommend this place to anyone and will never go there again ! Why have people make reservations for 930 when your kitchen closes early make it make sense",
    "rating": 1,
    "date": "09/09/2025",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I’ve dined at 360 in the CN Tower before and always enjoyed it, but this time was disappointing.<br><br>The person greeting and seating guests, Nijab, came across as rude and arrogant . When I politely asked if we could have a window seat, I was told, very rudely, that we hadn’t requested to be on the waiting list for those seats.<br><br>As someone visiting from out of town, I had no idea such a waiting list even existed. Instead, we were placed in a section further back, where it was difficult for my partner to properly enjoy the views, which is one of the main reasons to dine here.<br><br>On the positive side, our server was warm and attentive, which I truly appreciated.<br><br>But overall, the experience felt transactional, lacking the hospitality and charm I remember. What used to feel special now feels more like a commercial operation focused on volume rather than guest experience.<br><br>I rarely complain about restaurants, but the arrogance at the front of house left a bad impression and overshadowed the evening.",
    "rating": 1,
    "date": "09/09/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The curry mussels were outstanding, easy to eat with the perfect amount of heat. The toasted sourdough with the curry was amazing! It can get messy if you don’t know how to eat it.<br>The steak was cooked to perfection(medium rare) asparagus was seasoned as well as the roasted potatoes. Accompanied with horseradish, the sauce for the steak was disappointing. It tasted more like diluted soy sauce.<br>Desserts were pretty good, a combination of acidity, sweet and sour.<br>Service was pretty average, took awhile to take our order and the utensils weren’t clean.<br>Ofcourse the views of the city were amazing, a great way to enjoy your food.",
    "rating": 4,
    "date": "09/09/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Ritzy restraunt. Food is designed for people with unique taste buds but the view was great and the service was snappy",
    "rating": 3,
    "date": "09/09/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Positive",
      "Food Quality": "Neutral",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The service is nice but the food us terrible and what prices for such a avarage food! 😵‍💫<br>I recommande you go and visit the tower and avoid the restaurant especially if you are second or third row because you can’t see a lot.",
    "rating": 2,
    "date": "09/08/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "You're basically paying for the ride up the elevator because the food was awful. So dry. It was bad relative to the pricing. Also if you are a large party, they tack on 20% gratuity whether they deserve it or not and they definitely didn't earn that tip. The view was nice but that's about it.",
    "rating": 1,
    "date": "09/08/2025",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I’ve been coming to this restaurant for years for special occasions or family visiting Toronto.<br>Last Friday, we had dine to the usual 3 course meal.<br>I noticed that the services and cleanliness has declined with the “new faces” of service staff.<br><br>I pointed out to our server (I think his name is Clarence) that we received dirty cutlery with food residue, wine glass with lipstick and slower service than usual. We have to literally ask for water, bread, after 20 minutes of sitting. Also, when the server brought our food out, they are not careful putting down plates and cutlery on the table(bang on table) which is not a good manner in serving guests dining.<br><br>I hope the floor manager or person in charge to address this issue.",
    "rating": 2,
    "date": "09/08/2025",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "OMG Amazing experience! Stunning city views, delicious food, and excellent service😍😍😍",
    "rating": 5,
    "date": "09/08/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "impressive view with good food，easy booking online，20%tips is a bit higher",
    "rating": 5,
    "date": "09/08/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This is one of those restaurants that you only go there once for the experience. The food is okay - not bad and not great.<br>The service is a bit worst than okay - no extra and very cold.<br><br>The view however is absolutely stunning - and the restaurant turns 360 every 60 min (based on my calculations).",
    "rating": 3,
    "date": "09/08/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I celebrated my birthday at 360 Restaurant at the CN Tower, and it was an experience to remember. I made a reservation ahead of time, and from the moment we arrived, everything felt seamless. The three-course menu I chose was $90, and each dish was a delight. For starters, I had the Grilled Calamari, it was light, perfectly seasoned, and set the tone for what was to come.<br><br>For the main course, I went with the Sundried Tomato and Caper Spaghetti, a vegan option. The grilled artichokes, baby bell peppers, and herb gremolata paired beautifully with the basil olive oil and the subtle touch of Verona pecorino. It was flavorful and filling.<br>To finish, I indulged in the Ontario Strawberry and Pistachio Layer Cake (gluten-free), just the right balance of flavors, it was the perfect finale. What made the evening even more special was the 360-degree rotating view of the city. Watching the city while enjoying the dishes added an unforgettable touch. Everything about the experience felt elevated literally. The three-course menu for two, along with drinks, came to just over $300, worth every penny for the food, the service, and the views. If you’re looking for a place to celebrate a special occasion with delicious food and a view that takes your breath away, 360 Restaurant is a spot worth experiencing.",
    "rating": 4,
    "date": "09/07/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The waiter was rude<br>Mid food and dirty glasses<br>But amazing views",
    "rating": 2,
    "date": "09/07/2025",
    "aspects": {
      "Service": "Neutral",
      "Taste": "Neutral",
      "Food Quality": "Neutral",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food is pricey, but also terrible. Calamari as an appetizer was flavourless, all vegetables with my  cod were extraordinary undercooked, as was my wife’a entire vegan meal.<br><br>The servers do not check in during the meal to see if anything can be adjusted (I.e. subbing a salad or fries instead of rock hard potatoes).",
    "rating": 1,
    "date": "09/06/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Fun concept, nice menu and exceptional service. Small portions so good to try multiple items on the menu. The only downside was how packed the elevator going up was - did not have space to move. Too close to strangers.",
    "rating": 4,
    "date": "09/05/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I’ve always loved 360 Restaurant at the CN Tower and this was my 5th visit. In the past I’ve had nothing but wonderful experiences — I often bring my out-of-town family and friends here and rave about it. I’m also very easy-going, I don’t fuss if an order is wrong and usually just enjoy the experience.<br><br>This last visit, however, was really disappointing. It took almost 50 minutes to reach someone by phone to adjust our reservation after a doctor’s appointment ran late. When we arrived, the restaurant was almost empty with heaps of available tables, yet we were walked to one that hadn’t been cleaned. When we asked about sitting at another available table, we were told a very stern “no” with no explanation, and were left standing by the wall for about 10 minutes while staff passed us without a smile or a hello.<br><br>Our server was kind and friendly (thank you to him), but the overall atmosphere felt unfriendly, the food was mediocre, and shrinkflation was noticeable. The waiter forgot a few times of what we requested and had to remind him but we didn't mind that because the waiter was friendly and humble and took responsibility. At the end, we were mistakenly charged three times and had to call afterward to have it corrected.<br><br>I’ve never written a bad review before, but this visit was such a letdown compared to the warm and welcoming experiences I’ve always had here. I hope management takes this to heart because it’s not just about the view — it’s about the hospitality.",
    "rating": 1,
    "date": "09/04/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food is far from fine dining. They made us wait in the hallway for 25 minutes even though we had a reservation. During the meal, the service staff were making really loud noises with dishes next to us the whole time. The view is nice, but we have the same view on the floor below. Very disappointing; for the same price, we have eaten in much better restaurants.",
    "rating": 2,
    "date": "09/04/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Price": "Negative",
      "Menu": "Positive",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Food was good but the check in was way too long. Many layers of checking your reservation for nothing through the way up the restaurant. Then tens of people after check in were sent to a squeeze corner and wait there. I told the manger I would request a high chair. Instead was given a booth seat with no place for high chair. Need to request again and wait another 15 minutes. My child was running out of patience.",
    "rating": 3,
    "date": "09/03/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I had high hopes of enjoying a special time here with my parents on their first visit to Toronto. I booked a table a couple of weeks in advance and specifically asked for a great view, but we were seated in the second row, not by the window. The food was just average, which was acceptable, but the service was truly disappointing.<br><br>The server showed aggressive behavior and, without even asking, brought us the bill after less than an hour—even though we had booked for a relaxed experience. This was extremely upsetting. As a Level 7 Google reviewer, I’ve never had such an experience before. I left only a 10% tip and explained the reason, since I’ve never been rushed out like that. Although the server apologized, it didn’t mean much after the fact.<br><br>The view was amazing, but unfortunately the overall experience was awful.",
    "rating": 1,
    "date": "09/02/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Amazing experience!! I would go again and again.. I don't know why people complain, the food and service here are amazing.. worth the experience! Thank you so much.",
    "rating": 5,
    "date": "09/01/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Had a wonderful time. Beautiful views! Our server Vincent was fantastic! The food was delicious (try the Indigenous Menu!) Would not change a thing!",
    "rating": 5,
    "date": "08/31/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Menu": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Although the food was not so bad, the service left us extremely dissatisfied. I had booked seats by the window in advance, but we were placed near the entrance and server stations, where it was noisy and crowded, despite many empty tables by the windows. Throughout the meal, we had to place our orders with different waiters because it was difficult to find the one assigned to our table.<br><br>The most upsetting moment happened at the end of our lunch when a waiter threw the receipt onto our table in front of our parents and baby, possibly because he was unhappy with the tip. This behavior felt very disrespectful and unacceptable, especially considering that we spent more than $400 on lunch.<br><br>This experience left the worst impression of Canada at the end of our trip. I hope this feedback will be seriously taken and ensure better service for future customers.",
    "rating": 1,
    "date": "08/31/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Incredible dining experience at this restaurant, I brought my in-laws from Ireland and this was their first experience in Toronto and they loved it. Sabbir was an incredible waiter and had so much knowledge about the building and the general surroundings of Toronto you are able to look at. Their seafood, presentation and service were all top notch. If you do not have much time in Toronto and you want to feel like you have seen the city, this is the fastest way to do it with gorgeous food and lovely drink options. Thanks, Sabbir!",
    "rating": 5,
    "date": "08/30/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Ticket for the tower alone is 50. Paying 50 extra for a good meal with unbeatable view is a must-take offer for me!<br><br>Our 2-year-old enjoyed the whole meal too!<br><br>Service was a bit slow as more people are seated. It took us 20min to get checked. Our kid became too tired for nap time and got cranky.",
    "rating": 5,
    "date": "08/30/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Really nice food and service. Jeff was superb and was even kind enough to give us a quick tour of the CN tower. Would recommend",
    "rating": 5,
    "date": "08/29/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "This was a great way to close out a week long trip in the Toronto area. We took the  WeGo Train from Unionville to Union Station and the CN Tower was about 10 min walk away. Good thing because it was very busy on a Sunday afternoon.  For a pricier, better meal you get to sit and enjoy a great view. We did the three course meal, we had the cod, it was very good. The mussels were excellent. We had the strawberry cake and the mousse for dessert. It was well worth skipping all the ice-cream trucks on the street. If you plan to go to the restaurant, get there early before your reservation. It took us about a half hour to get through security and wait in line for the elevator to take us up. Hit the gift shop on the way out! Got three new pins. Overall, this was a great experience!",
    "rating": 5,
    "date": "08/26/2025",
    "aspects": {
      "Service": "Positive",
      "Location": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Loved the experience and views! Staff is very kind and professional. Food was good, but very expensive for the quality and portions.",
    "rating": 5,
    "date": "08/26/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was our second visit to this restaurant. The food was good, and the service was also very nice until we paid. It was 20 percent tip already included, so we simply paid as shown. From that moment, the server stopped smiling, showed us unpleasant facial expressions, squeezed in between us, and began taking dishes away very loudly.<br>I am curious—am I supposed to tip twice?",
    "rating": 1,
    "date": "08/25/2025",
    "aspects": {
      "Service": "Positive",
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Highly recommend. Lovely restaurant, great view, good service, excellent wine list. The food is good but nothing special. You go for the experience. The fixed price menu is a good deal if you also want admission to the observation deck.",
    "rating": 4,
    "date": "08/25/2025",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Menu": "Neutral",
      "Drinks": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Everything was perfect<br>The food the breathtaking view and the service<br>One of the best places in toronto",
    "rating": 5,
    "date": "08/25/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I had such a wonderful time at the 360 Restaurant! The atmosphere was elegant yet relaxing, and the rotating view of Toronto was absolutely breathtaking every moment felt special as the skyline kept changing around me.<br><br>The food was delicious and beautifully presented, paired perfectly with the fine dining experience. The staff were warm, attentive, and made my friends and I feel truly welcomed throughout.<br><br>Between the amazing service, the unforgettable view from the CN Tower, and the overall vibe, it was an experience I’ll always remember. Definitely a must-visit for anyone looking for a unique dining experience in Toronto!",
    "rating": 5,
    "date": "08/24/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great atmosphere, great view, great service. The food was horrible. We got the 3 course fix price meal.  For appetizers the Calamari was literally 3 pieces and cold. Mussels were okay.<br>For Main course. Salmon was super bland and unsalted, althouh",
    "rating": 3,
    "date": "08/24/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Price": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "What a cool experience! Getting into the building and up the elevator was quick and easy since they have a separate line for dinner guests. We were seated at a window table which was a bonus, but we were also sat between two families with kids. Which for a couple getting dressed up and going out for a very expensive dinner wasn’t very pleasant.<br>Food was great, again though, very expensive.<br>We did enjoy having the ability to go to the observation deck after dinner.<br>Probably won’t do it again, but a nice experience to try once.",
    "rating": 4,
    "date": "08/23/2025",
    "aspects": {
      "Price": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Extremely disappointing experience. The service was chaotic and unprofessional. Our server, Zahid, seemed disorganized and overly rushed, which made the dining experience uncomfortable. At one point, he placed our cutlery directly on the table instead of on the serviette which was RIGHT THERE! something that felt unhygienic. Communication was also a challenge, as there was a language barrier that made it hard for us to understand each other. The food itself was mediocre at best and definitely overpriced for the quality. Overall, I left very dissatisfied and will not coming back..",
    "rating": 1,
    "date": "08/22/2025",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It’s not just dinner, it’s an experience of a lifetime. The staff are amazing and very efficient. Time slipped away while we were there. Always something new to see. The perfect place for a fancy date night, or a high end family experience.",
    "rating": 5,
    "date": "08/21/2025",
    "aspects": {
      "Service": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Bobby, our server, was amazing! We were celebrating a special occasion, and he truly made our dinner special. His enthusiasm was a delight, and he was very on top of everything despite the restaurant being busy.<br><br>However, the reservation process could be improved. When booking, I explicitly specified wanting a window seat and indicated to please inform me should this not be possible. When we arrived at 5:30pm, we were told that the hostess saw the note but that all window seats went at opening at the 4:30pm seating and we could wait an hour if we wanted a window seat. This could have been avoided had I just been informed in advance to modify my reservation time to either 4:30pm or 6:30pm, but I never received any information from the restaurant despite booking a month in advance.",
    "rating": 4,
    "date": "08/20/2025",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We had our Anniversary dinner at the 360 Revolving Restaurant on top of the CN Tower 2 weeks ago around 5:30pm on Wednesday.<br><br>As usual, CN Tower is always busy but with a  restaurant reservation, it included the exclusive elevator access to the top of CN Tower bypassing the long long line up (the same when you are trying to come back down, you can use the restaurant elevator after you visited the indoor and outdoor observation level, just shows your reservation ticket to go back to the restaurant to take the elevator down).<br><br>We had the 3 courses meal, the mussels is amazing comparing to the grilled calamari.<br>Both the prime ribs (medium rare) and Pork Tenderloin were delicious (we both loved the Prime Ribs more as they also added a charcoal grill on top of the prime ribs to bring up the favours) 😋😋😋<br><br>Desserts were very yummy also with the different layers of favours and so lovely they put the anniversary chocolate and candles on top of our desserts.<br><br>The service is good and all staff greeted us for our anniversary (you can indicated your special occasion when making reservation online).<br><br>I would give 5 stars for service if our waiter can have more smile. He is good but a bit cool. 😅<br>Overall, we enjoy the unbeatable views and the beautiful sunset up there.<br><br>There is a minimum spend of $75 (plus tax and gratuity) per guest on food, but since it included the elevator, and lovely views and delicious fine dining.  It is well worth it!!!<br><br>We spent a total of approx $350 (included tax and tips) for 2 of us there 🤗<br><br>This place meant a lot to us as it was our first dating place many many many years ago 🥰<br>Good job 360 & CN Tower 🙏🏻",
    "rating": 5,
    "date": "08/19/2025",
    "aspects": {
      "Service": "Neutral",
      "Taste": "Neutral",
      "Desserts": "Neutral",
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The food is too expensive and I don't like it....terrible l it's really bad . .good presentation but nah",
    "rating": 2,
    "date": "08/19/2025",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "We had such a great experience! The indigenous dishes were delicious, the staff were professional, the desserts were perfect, and the view was stunning with a really relaxing vibe. The manager was so respectful and passionate, and gave us a personal tour, which made the visit extra special.",
    "rating": 5,
    "date": "08/18/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It’s a nice spot for a special occasion. The restaurant slowly rotates and you get a nice view.<br><br>We ordered from the prix fix menu which also includes entrance to the observation deck and glass floor.<br><br>It’s a nice spot for a a celebration.",
    "rating": 4,
    "date": "08/18/2025",
    "aspects": {
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I can see why they went in strike. The staff are not organized. We were told we would have time before dinner to go on the observation deck 30mins before our dinner reservation then it was 10mins before and told we could just join the line for the elevator but stopped by a different staff member and told to wait. So we didn’t get to see anything cause it was dark after dinner. They pack you in so tight in the elevator you can’t even check out the view. Got seated at a booth and told that we would have to go back down to request a window seat and wait another 45mins! There were tables by the window free so it should not have been an issue. Travelled all the way from BC. Made a reservation so we could see the sunset not people at the tables. Food was good. And the waiter we had was good but sadly would not recommend as it was disappointing to not be able to see the view and being given some lame excuse as to why when there were empty tables by the window. Dinner was about $300 so when you spend that kind of $ you should be accommodated if possible.<br>Better to go on the observation deck and have dinner somewhere else.",
    "rating": 2,
    "date": "08/16/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The service was spectacular, but the food quality was quite average for the price. The main draw is really the views, though the ambience doesn’t feel as premium as the price suggests. At night, the views weren’t at their best, but it was still a unique experience to slowly revolve around the city skyline. That said, it’s not the most celebratory environment, so the premium price might not be worth it when there are other great alternatives available.",
    "rating": 3,
    "date": "08/15/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "The service was quite slow and the food was inconsistent. The two plates of Chicken Supreme were overcooked and dry. The other two entres were ok and the appetizers were good. When we mentioned the chicken to the staff they offered a half hearted apology.",
    "rating": 3,
    "date": "08/15/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "360 Restaurant offers the best city views, exceptional service, and absolutely delicious food. A perfect spot for a memorable dining experience!",
    "rating": 5,
    "date": "08/14/2025",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Wanted to take my spouse for surprise dinner, and boy this one didn't disappoint at all. We loved the ambiance and atmosphere. The restaurant revolves 360 degrees giving you all possible views of the city while enjoying your favourite dishes! A special shout to the chefs and attendants who made the visit worth while.",
    "rating": 5,
    "date": "08/13/2025",
    "aspects": {
      "Ambience": "Positive",
      "Menu": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Grrat once you get up amd seated..They make you wait for the full group and have a painful security process to get there.<br>Once seated all is well amd views are amazing",
    "rating": 4,
    "date": "08/13/2025",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "It was too hot. The server stephen was rude and we had our anniversary there was no celeberations. The server made connections and had a word with everyone he was serving but was too the point with us and took the order after so long. we were seated at 8 15 pm and made us wait until 845 pm as we were waiting to order and we had some doubts. He just told us he will come back and took 30 min to come back as he was chatting with other customers and when I tip him for bad service. he made comments such as its not me, its just you. Very rude and mean. Did not like it at all. I took my parents there and was surprised and shook with the behaviour.",
    "rating": 1,
    "date": "08/11/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Honestly this was a great night with great views but it wouldn’t have been without the great service my our host Imran. He took time to ask of for photos and made sure to get all the angles, he helped us explore new views of the city. He was an uplifting energy when he came around to check on us. He made sure to help us celebrate our special anniversary and never failed to make us feel special. Huge shoutout to Imran, great host, great service and even better views",
    "rating": 5,
    "date": "08/10/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Very poor experience! It is almost impossible to cancel or modify a reservation, my wife was on the phone for over an hour trying to cancel our reservation so we wouldn't be charged $120 in cancellation fees and the urant when I asked if this wait time and service was typical the response we got was just \" sorry we are pretty busy today\" - the phone number has no estimated wait time, and there are no other online options to cancel. We have come here  in the past with various out of town guests but will no longer be recommending this restaurant.",
    "rating": 1,
    "date": "08/09/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Great service. Good and fresh food. Of course the view is spectacular. Ricky, our waiter, noticed that the steak was over done and not medium. He immediately swapped it!",
    "rating": 5,
    "date": "08/09/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Spectacular evening at 360 celebrating our wedding anniversary, food, service and atmosphere top notch, highly recommended!",
    "rating": 5,
    "date": "08/09/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "They mark a bunch of dishes as vegetarian but when we asked if the cheese used in preparing the dishes was made from animal rennet or not, they couldn't answer. And frankly speaking the passive aggressiveness by our server Maks because he didn't get the tip % he wanted, didn't help either.",
    "rating": 1,
    "date": "08/08/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Dining at 360 The Restaurant at the CN Tower was easily one of the most memorable culinary experiences of my life. From the moment we stepped into the elevator and began our rapid ascent to the top of the tower, we knew we were in for something special. But nothing prepared us for the stunning panoramic view that slowly rotated around us as we dined. Toronto’s skyline, the glimmer of Lake Ontario, and the distant horizon stretched endlessly—all while we were seated comfortably, champagne in hand, watching the city revolve beneath our feet. Literal top-tier dining.<br><br>Let’s talk ambiance first. The energy in the room felt elevated but not stuffy. The lighting was warm, the seating was well-spaced for privacy without feeling isolated, and every single table had a view. The slow rotation added a sense of movement and wonder that kept us engaged throughout the entire meal. And even with a full house, the noise level was soft, with just the right amount of background hum to keep things lively.<br><br>Now, the food. This wasn’t just about fancy plating or hype. The food backed it up. My main dish—a perfectly cooked filet mignon—was so tender I barely needed my knife. It was served with a rich reduction that added depth without overpowering the natural flavor of the meat. My dining partner had the maple-glazed salmon, and I shamelessly stole a bite (or three). The glaze was sweet but not sticky, and the fish flaked effortlessly. Each plate was a thoughtful balance of textures and colors. Even the side vegetables were treated with care—nothing thrown on the plate as filler.<br><br>The appetizers impressed too. The seafood chowder was creamy, comforting, and generously packed with tender bites of fish and shellfish. The beet salad was fresh, earthy, and beautifully plated, with creamy goat cheese and candied nuts providing contrast in every bite.<br><br>And then came the dessert: a chef’s kiss moment. The vanilla crème brûlée had the perfect crack when my spoon hit the sugar top. It was rich but light, creamy but not overly sweet. We also tried the chocolate lava cake, which oozed warm, silky chocolate when cut open, paired with a scoop of ice cream that melted right into the sauce. Decadent doesn’t even cover it.<br><br>The wine list was extensive, and our server—who deserves a shoutout—knew it well. He recommended a Canadian pinot noir that paired perfectly with the steak, and he was warm, attentive, and genuinely passionate about the menu. Every interaction felt authentic, not scripted.<br><br>Another bonus? Dining at 360 includes admission to the CN Tower observation deck, which means after dinner, we got to walk off our meal while taking in even more views and snapping a few photos from the outdoor terrace and the famous glass floor.<br><br>In short: 360 isn’t just a meal, it’s a full experience. It’s where fine dining meets a world-class view, where service is thoughtful, and where every bite reminds you that you’re eating in one of the most iconic places in the country. Five stars, no question. This is a must-do if you’re in Toronto—worth every dollar, every course, every minute.",
    "rating": 5,
    "date": "08/08/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Menu": "Positive",
      "Drinks": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "Surprised my fiancé with dinner at the 360 and he was quite happy. They accommodated my requests regarding food and seating. Carlos, our server was really welcoming and walked us through the menu and helped choose the dishes. Was a really nice experience!",
    "rating": 4,
    "date": "08/08/2025",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Menu": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "360 The Restaurant at the CN Tower",
    "review": "I visited this restaurant to celebrate my birthday. While the food was delicious, I was disappointed with the service.<br><br>When I stepped away briefly to use the restroom, my main dish was brought to the table. I had also requested a birthday message on the dessert when I made the reservation, but it was forgotten. Worse still, the dessert was served while I was away from the table again. When I reminded the staff about the birthday message, they brought the dessert back with the message, but by then, the ice cream had melted, which was quite disheartening.<br><br>At other restaurants, especially on special occasions, the staff usually offer to take a photo or make some small gesture to help create a memorable experience. Unfortunately, there was no such gesture here. The server left immediately after dropping off the dessert, without giving us a chance to ask for a photo.<br><br>It was a once-a-year special day, but I left feeling quite disappointed.",
    "rating": 1,
    "date": "08/08/2025",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative"
    }
  }
]