[
  {
    "restaurant": "McDonald's",
    "review": "all employees slow work baihebor not good just 1 tea meaking 7 miking minitus",
    "rating": 1,
    "date": "02/16/2026",
    "aspects": {
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Very bad service and tasteless food.",
    "rating": 2,
    "date": "02/06/2026",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Right now, I just had a very upsetting experience at the kiosk at this location due to the conduct of two managers, primarily the thinner manager working at the counter.<br><br>When I asked if it was okay to briefly step into the store next door while waiting for my order, she responded sarcastically with, “That’s up to you,” and, “We work behind the counter, so why would anyone come take your order?” Her tone was dismissive and condescending.<br><br>I explained I would return quickly. When I came back, I was told my name had been called, yet my order had not even been made. After waiting over thirty minutes, the explanations were contradictory and frustrating. When I pointed this out, the same manager said, “You had that conversation with me, not her. Did you seriously expect me to tell her?”<br><br>She then approached me smiling and laughing, repeatedly asking, “Are you okay? You don’t look okay,” in a clearly mocking way. When I asked for her name to file a complaint, she refused and kept asking, “Why do you want my name?” and “What’s the complaint about?” The second manager also refused to help and said it was not her responsibility.<br><br>No customer should be spoken to with sarcasm, mocked, or denied basic accountability by management. I am seeking the owner’s or head office’s contact information to formally escalate this matter. If anyone has that information, please share it.",
    "rating": 1,
    "date": "01/17/2026",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Food inspectors should be paying this place a visit every week. Cleanliness is questionable and staff are slow with ZERO sense of urgency. Fast food without the fast.",
    "rating": 1,
    "date": "01/08/2026",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Hands down the worst location in Toronto. Expect a long wait at 7PM and 2AM the same. Place is always dirty and food lukewarm.",
    "rating": 1,
    "date": "11/22/2025",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "18 minutes for a black coffee",
    "rating": 1,
    "date": "11/02/2025",
    "aspects": {
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Staff is not professional and very lazy.. taking very very much time.. please use other store than this..",
    "rating": 1,
    "date": "10/11/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I am a Muslim and I always wanted to eat from McDonald's and now I decided to try the Fillet O' Fish and it tasted great, soft and had a special flavor... I love McDonald's",
    "rating": 5,
    "date": "10/09/2025",
    "aspects": {
      "Taste": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Very bad service not looking",
    "rating": 1,
    "date": "10/07/2025",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative",
      "Price": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The best thing about this Mcdonalds is the service. Employees are always kind, courteous and efficient. Sarabjit, Jade and Mica are the best! They always serve your food with a smile on their face!",
    "rating": 5,
    "date": "10/06/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Probably one of the slowest and most unprofessional staff work here. Sadly it’s the closest McDonalds to me. I’ve got limited options.",
    "rating": 1,
    "date": "10/04/2025",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I tried out this location and the vibe , food and everything is not the same like Queen and Spadina go there not here!  The McChicken tasted 45 mins in the hot oven not fresh before serving ; the Big Mac is not hot; the fries not hot and crispy the service is not the same experience as Queen and Spadina",
    "rating": 3,
    "date": "10/03/2025",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Neutral",
      "Food Quality": "Neutral",
      "Taste": "Neutral",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "They serve so slow even it’s not busy .",
    "rating": 1,
    "date": "09/19/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Low rating because the ticket printing machine didn't work which made ordering a chore. But the McVeggie is surprisingly good.",
    "rating": 3,
    "date": "09/17/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Two of the staff were very rude, and even after my complaint, they didn’t apologize.",
    "rating": 1,
    "date": "09/14/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Absolutely disgusting.  I would rather go to taco bell",
    "rating": 1,
    "date": "08/26/2025",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Every time I order sometime it's fresh other it don't look fresh",
    "rating": 3,
    "date": "08/25/2025",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Thank so much for Jessie highlight of my night when I’m done work on king st",
    "rating": 5,
    "date": "08/22/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "My order is always hot and fresh when I go to this location. I usually order via the app but today there was an issue with it, so the employee, Jessie, was able to help me get my order! Thanks Jessie!",
    "rating": 5,
    "date": "08/12/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Awesome Gem of a Location! Looks and feels much better on the interior than it seems from the outside. Staff is nice and the food turns out great!",
    "rating": 5,
    "date": "08/09/2025",
    "aspects": {
      "Service": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "very helpful dealing",
    "rating": 5,
    "date": "08/01/2025",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Extremely slow, extremely busy and extremely rude people<br><br>Update July 2025<br>Won’t serve ice cream. They are still clueless. They don’t wear name tags. Seems only one person works here while the rest refuse to take orders or make orders. Soooo slow",
    "rating": 1,
    "date": "07/27/2025",
    "aspects": {
      "Service": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Really impressed at my order last night. Everything fresh and poutine was better than I thought it would be.",
    "rating": 5,
    "date": "07/27/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This McDonald’s gives out cold fries when you order from a delivery app. And that is so very wrong!!!!",
    "rating": 1,
    "date": "07/15/2025",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Probably the worst McDonald's I've been to, sadly. Broken air conditioning (not that they can probably help that). Very slow to actually take our order, even though there were 2 staff standing around, and we were the only ones in line. Hamburgers  and buns are extremely dry, which makes me think they've been sitting around for a while. I was looking forward to a little treat. Super disappointed. :(",
    "rating": 2,
    "date": "06/21/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I go to this McDonald’s everyday for coffee in the morning around 6am, and EVERY morning I have to sit there and wait. The employee barely acknowledges that I’m there. She will continue to do her tasks rather than serve the customer. The customer service absolutely lacks.",
    "rating": 1,
    "date": "06/18/2025",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "It's a good fast food option on King Street West.<br>The food is pretty good, the staff is nice but it often takes some time for the orders to be ready. The sitting area is somewhat small and the tables are too close to each other - it's usually packed with delivery drivers, people who are on their way to the club or homeless people.",
    "rating": 4,
    "date": "06/11/2025",
    "aspects": {
      "Service": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The Latte Machine is always broken! I thought those things happen to only ice cream machines",
    "rating": 2,
    "date": "06/10/2025",
    "aspects": {
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Staff was overwhelmed by a flood of concert go-ers, but still offered fantastic service, were kind and willing to remake our order after someone else took it.<br>They stayed open during cleaning hours to help us out.<br>10/10 I would go back to this location next time I visit Toronto",
    "rating": 5,
    "date": "05/29/2025",
    "aspects": {
      "Service": "Positive",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This is the absolute worst McDonalds that I've ever been to.<br><br>I went to order a breakfast sandwich from them. When I did so, the app glitched out and refused to let me order. When I asked the employee if I could order despite the app refusing to let me order, he told me no and that it was my phone's problem.<br><br>I tried to order again, and when the app once again didn't work, the employee at this location repeated the same nonsense about my being unable to order being my fault and he refused to help me further.<br><br>I LITERALLY TRIED TO GIVE THESE GUYS MONEY AFTER THE TOLD ME TO GET LOST AND THEY RESPONDED BY AGAIN TELLING ME TO GET LOST. I've literally never seen customer service this bad before.",
    "rating": 1,
    "date": "05/24/2025",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I’ll never come to this location. Really bad service. Team workers don’t care about customers. They are working like just take your food and get out of here.",
    "rating": 1,
    "date": "05/20/2025",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Amazing customer service",
    "rating": 5,
    "date": "05/10/2025",
    "aspects": {
      "Service": "Neutral",
      "Taste": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Very clean and happy people",
    "rating": 5,
    "date": "05/03/2025",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "It is the best store I have ever visited in a long time",
    "rating": 5,
    "date": "04/23/2025",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Great served by harsh patel",
    "rating": 5,
    "date": "04/23/2025",
    "aspects": {
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I have visited this s mc Donald's several times and would like to share my experiences with staff there, they all are so humble and friendly in nature.",
    "rating": 5,
    "date": "04/23/2025",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Best in the Downtown.",
    "rating": 5,
    "date": "04/21/2025",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Teach your staff to attend people not to ignore them.",
    "rating": 1,
    "date": "04/15/2025",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This McDonald's offers a typical experience but the wait time for mobile orders is extremely long.<br><br>I ordered three simple meals each with a sandwich, fries and a vanilla iced coffee and waited about 15 minutes.<br><br>The wait might have been tolerable if not for the strong kitchen fumes that cover the entire restaurant. I wouldn't recommend this location for anyone with respiratory issues.",
    "rating": 3,
    "date": "04/09/2025",
    "aspects": {
      "Service": "Neutral",
      "Location": "Negative",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Update it’s been a month and the charge is still there. Good thing I refused to pay twice. He is scamming people and McDonald’s.<br><br>Be careful paying by card here. I paid the machine said approved and the guy said something wrong I must pay again , I checked my bank right there and it went through . He tried to force me to pay again and said it’ll take a week to get money back and wanted to give me no recipet , if it didn’t go through I would need receipt showing that it says transaction not completed, he didn’t want to provide that and couldn’t because it clearly went through. I said no I paid and it’s gone through my bank as a charge which I showed, so I’m not leaving until you call someone at head office or I call my bank right here in the store. He was extremely rude he was the manager apparently named “den” or “dan” I would never come here again since they think something like this is okay . Not everyone can wait a week for their mistake and money back, for all he knows that could’ve been my last 10$ and that’s how he’s treating customers for their systems technical errors. It’s not my fault to pay for McDonald’s technical errors, i paid and not waiting for money a week for McDonald’s with NO recipet or proof to leave with. Sickening and rude customer service and the manager should be investigated and re trained.",
    "rating": 1,
    "date": "04/03/2025",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Stale, undercooked or overcooked. \"never again\"",
    "rating": 1,
    "date": "03/26/2025",
    "aspects": {
      "Food Quality": "Negative",
      "Taste": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "A simple order of a happy meal and an extra drink... Took 15 minutes and others ordering more food items after were served before mine. Staff looks confused about what they are doing and slow moving. Got the food and was barely warm, fries were cold.",
    "rating": 1,
    "date": "03/23/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I’ll be honest I don’t usually leave review (especially for fast food places) but I went in at about 430am while it was freezing outside waiting for my food. The manager let me wait inside the restaurant while my food was being made, and while I was waiting the customer service girl offered me a water while I waited. It may seem like something small but I’ve been to McDonald’s hundreds of times and was the first time I was offered a water while waiting for my food. It may seem like a small gesture, but given that it was the first time I was given this kind of service at a fast food restaurant, it made me very impressed with the experience.<br><br>I hope management reads this and praises the middle eastern girl that served me at 430am on February 8th, 2025.",
    "rating": 5,
    "date": "02/08/2025",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Great service from the 24 night staff 5 stars",
    "rating": 5,
    "date": "01/14/2025",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Great breakfast menu to start my day",
    "rating": 5,
    "date": "01/04/2025",
    "aspects": {
      "Menu": "Positive",
      "Desserts": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Made my jr chicken so fast. Like 45 seconds. Lit",
    "rating": 5,
    "date": "01/04/2025",
    "aspects": {
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Service was excellent!!! Fast take-away order and very clean tables ! Always had fresh food at this location !!!!",
    "rating": 5,
    "date": "01/02/2025",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Best and clean place to eat and enjoy",
    "rating": 5,
    "date": "12/30/2024",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The food is tasty.. i ordered mcchicken... It was properly cooked... I ordered through uber eats also... Sometimes food gets cold.. but taste and hygiene is not being compromised anytime... The staff is cooperative..",
    "rating": 5,
    "date": "12/30/2024",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The staff is very  cooperative...very clean ...food is very tasty",
    "rating": 5,
    "date": "12/30/2024",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Every time I order food from uber it’s always cold and I live five minutes away from this place meaning they always have stale all the time and serve it to customers. bring back good quality please",
    "rating": 1,
    "date": "12/20/2024",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Great place for breakfast",
    "rating": 5,
    "date": "11/27/2024",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "GREAT PLACE! Manager Dan and Lebeth are the best!",
    "rating": 5,
    "date": "11/21/2024",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Nice small location on King St West.",
    "rating": 5,
    "date": "11/18/2024",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I experienced fast service, which was great, but I noticed that Uber Eats and SkipTheDishes orders seemed to be prioritized over in-person customers. Another issue was the restroom situation – there was only one single-person bathroom available, and it wasn’t accessible when I needed it. Unfortunately, I had to leave my order (a double fish filet) to find an alternative nearby because I couldn’t wait. This was quite inconvenient and disappointing. Improving restroom access would make a big difference for customers dining in.",
    "rating": 2,
    "date": "11/18/2024",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Went to front counter to order the food around 6:40pm there was a manager his name was DAN. He was so rude with my frnd and me as like he is frustrated of his job. We had monopoly coupons and he denied to give the food on monopoly coupons. I request to general manager to please train him how to treat a customers as customers are your guest. He is not only the running mcdonalds here in Toronto. I will also complain this guy in head office for deniying the food on monopoly coupons and treating customers in a bad manner.",
    "rating": 1,
    "date": "11/16/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Food was fine, typical McDonald’s but if you go before 8am it takes 10+ minutes to get your food and they do not pay attention to you.",
    "rating": 2,
    "date": "11/14/2024",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Rude girl working the cash at night.",
    "rating": 1,
    "date": "11/07/2024",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Worst customer service ever. I ordered on Uber and called right away (not even 2 mins after) to ask for my order well done which means fresh meat and fries dropped in the fryer ATP in time, just for the manager to tell me my order is already ready and she won't be making another sandwich that will be fresh. She then proceeded to tell me that's why I should pick up instead, when I told her about the fact I have a child at home and don't have the leisure of doing that she told me to take it up with uber",
    "rating": 1,
    "date": "11/01/2024",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The service was horrible. I order one McChicken and I wait 45 minutes. Every time I ask they say it’s coming or not ready. Get better management and more considerate employees. 0/5 if I could.",
    "rating": 1,
    "date": "10/25/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "On Saturday a group of friends and I went to eat at this location, I was holding the door open for them and a few people walked out so I held it open for them as well. After I went to enter and one of your employees kicked me out and said they were closed for indoor dining. You seriously couldn't let one person in? Moron.",
    "rating": 1,
    "date": "10/07/2024",
    "aspects": {
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This is a tough location to work at/patronize. All things considered, I think the staff and management do a good job of providing fast and friendly service and seem happy to accommodate customers' needs/requests.",
    "rating": 5,
    "date": "09/09/2024",
    "aspects": {
      "Service": "Positive",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Saturday early morning i ordered mango smoothie ($4.20) The restaurant was busy. The washroom was very messy and it was not cleaned in awhile.I hope next time it is in reasonably good order.",
    "rating": 3,
    "date": "08/31/2024",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Train ur staff to properly put the ice cream cone in a cup. A simple task that seems to be challenging for blond boy",
    "rating": 1,
    "date": "08/27/2024",
    "aspects": {
      "Service": "Negative",
      "Desserts": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This location is always clean, and service is good",
    "rating": 4,
    "date": "08/20/2024",
    "aspects": {
      "Service": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Why does almost every McDonald's I visit, the workers look like zombies with no hope in their eyes? They all look lifeless zombies that have given up in life. Also the way they treat delivery drivers from uber, skipthedishes and doordash is appalling.<br><br>I have seen it for years the blatant disrespect towards drivers. Yes, there are a lot of rude drivers too but they can easily establish rules that if they are rude in any way, mcdonalds can easily tell them to leave the premises. My issue with the mcdonalds workers mainly, is they treat delivery drivers like ghosts, they ignore them and don't treat them at all like walk in customers. There is a 2 tier level of service when it comes to walk in customers and delivery drivers.<br><br>So many of these workers look miserable here and are unorganized in my opinion a lot of the times I have visited and management does not seem to care or resolve this issue in any fashion. The workers seem like they are forced to do this job but I never seen a gun pointed at their heads, forcing them to work. There are other opportunities out there that will require more effort to achieve but I digress.<br><br>Unfortunately, I do not believe this lack of customer service skills will get better until more people voice this concern, like I have done and vote with their wallets.",
    "rating": 1,
    "date": "08/09/2024",
    "aspects": {
      "Service": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Slow. Can’t even get a coffee here",
    "rating": 1,
    "date": "08/02/2024",
    "aspects": {
      "Drinks": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Went to this location and the customer services from Diana were quite impressive. She helped a lot to get a meal according to my taste. I will come again👍",
    "rating": 5,
    "date": "07/29/2024",
    "aspects": {
      "Service": "Positive",
      "Taste": "Positive",
      "Location": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I came here to pickup order …but I noticed that only this McDonald’s employee very very irresponsible..never ever ready food at all time …they always treat uber people like their servants..not give proper response..every five minutes they tells more 5 minutes..its taking every time 15 to 20 minutes wait time … And its happen everytime",
    "rating": 1,
    "date": "07/15/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I would like to thank to \"GAGAN\" she provided me a very good customer service & also she treated all the customers very good",
    "rating": 5,
    "date": "07/09/2024",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Ish was spisy and taste like a mop🗑️🤮",
    "rating": 1,
    "date": "07/02/2024",
    "aspects": {
      "Taste": "Negative",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Ver very slow service",
    "rating": 1,
    "date": "06/24/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Food and staff are great, but late night this is not a place to linger and dine in.  Takeout for sure.",
    "rating": 3,
    "date": "06/24/2024",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This place continues to disappoint. It's the closest location to me but every time I order there whether it's pick up or delivery there's an issue. Always an item missing, a mistake in the meal, it's never as ordered. Get your McDonald's fix from the Queen and Spadina location instead.",
    "rating": 2,
    "date": "06/22/2024",
    "aspects": {
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Regular place, but they didn’t receive our order we made at the electronic counter. Had to wait longer. The cafe is really small, only few tables, but overall is good.",
    "rating": 4,
    "date": "06/22/2024",
    "aspects": {
      "Service": "Negative",
      "Location": "Neutral",
      "Desserts": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Few minutes ago I ordered take way chicken nuggets with medium fries asked for honey mustard dip but when I came home there is nothing .I couldn’t get taste in nuggets . Very irresponsible service",
    "rating": 1,
    "date": "06/03/2024",
    "aspects": {
      "Service": "Negative",
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Purchase a medium size soft drink on the app. Came to pick up; waited at least 9 minutes for my drink to be handed to me. I was the only customer at the time (it was midnight & raining). When I arrived my drink were already made. I was expecting for my drink to be handed to me within 2-3 minutes of waiting, nope! Took longer than I expected. I tried knocking on the window hoping the workers would notice me waiting (don’t want to be rude to just open the window myself). Saw the workers were busy chitchatting with their colleagues having laughs not bothering checking the pickup window from time to time. It was until a dude who I think weren’t on his shift saw me waiting in the rain with my umbrella, came to me and finally gave me my drink. If it wasn’t for him, who knows how much longer I would be waiting. C’mon! Disappointing.",
    "rating": 1,
    "date": "05/27/2024",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Ice cream machine always down at this place. Unhygienic homeless people lingering",
    "rating": 2,
    "date": "05/20/2024",
    "aspects": {
      "Desserts": "Neutral",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "bad experience to pick up orders and time waste",
    "rating": 1,
    "date": "05/13/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I can not in my own morality recommend McDonald's is good for anyone , but we all know your still searching for your after hour booze rehabilitation program due to the cravings of salt it provides for you. One note to mention it will  indeed taste better when drinking but next morning you will regret  it my friend !<br>Always throughly believed McDonald's should  be 18+ as that is pure dopamine addictive foods that isn't real food and im not too sure if a mchappy meal really axtually makes us happy in the long run. Lol",
    "rating": 1,
    "date": "04/23/2024",
    "aspects": {
      "Taste": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Ordered 2 times on doordash, missing items every time.",
    "rating": 1,
    "date": "04/21/2024",
    "aspects": {
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Listen being open 24/7 is crazy for the workers, but the employees here crush that.<br><br>Idk how it’s gotten low reviews, fast service, polite staff and good seating area.<br><br>What more you need.",
    "rating": 5,
    "date": "04/14/2024",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Ordered through app. Forgot a portion of my order and no way to dispute it.",
    "rating": 1,
    "date": "04/06/2024",
    "aspects": {
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Zero costumer service this guy is so rude to all folks stay away from him",
    "rating": 1,
    "date": "03/22/2024",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The worst of all. Their customer service is so poor. The guy was standing still and was aggressive as he don’t wanted to make my order.",
    "rating": 1,
    "date": "03/20/2024",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Amazing as usual , only thing not halal and I can’t eat burgers(",
    "rating": 5,
    "date": "03/03/2024",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Slowest McDonalds in the city, workers seem to be arguing all the time, and the line around dinner time takes forever to clear, but they sure clear the order board quickly to make it seem like they are fulfilling orders fast.",
    "rating": 2,
    "date": "02/09/2024",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "i think this is as clean of a mcdonalds that you can get in downtown toronto.. tried the mcrib! basically a patty drenched in rib sauce but for $7 it's okay",
    "rating": 4,
    "date": "02/04/2024",
    "aspects": {
      "Food Quality": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Its ok place. So slow. Dont want to go often for food just coffee or flurry",
    "rating": 2,
    "date": "01/12/2024",
    "aspects": {
      "Drinks": "Negative",
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Awesome staff; fast service!",
    "rating": 5,
    "date": "01/03/2024",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "A regular McDonald’s in Toronto. It’s small but I like the decoration here. There’s no table service and the service is slow and unfriendly.",
    "rating": 2,
    "date": "12/23/2023",
    "aspects": {
      "Service": "Negative",
      "Ambience": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Actually, a good location staff members are proficient. Less kids serving you, probably why I prefer this location",
    "rating": 5,
    "date": "12/13/2023",
    "aspects": {
      "Service": "Positive",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I've never had any issues with this place. It's pretty clean, fast service. I wouldn't say the staff are rude, they just kind of seem dead inside which is fair.",
    "rating": 5,
    "date": "12/11/2023",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Good place needs an upgrade in their food court it's very small and needs more than one bathroom 1 bathroom is not enough!<br>overall the staff is cool especially jade! close to home no complaints.",
    "rating": 4,
    "date": "12/06/2023",
    "aspects": {
      "Service": "Neutral",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Took forever, the person spilt ice cream on. Not apologetic.",
    "rating": 1,
    "date": "11/18/2023",
    "aspects": {
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Decent coffee at a decent price, for when you're on the go.",
    "rating": 4,
    "date": "11/09/2023",
    "aspects": {
      "Price": "Positive",
      "Drinks": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Not that much place to sit because of very busy area. Else it’s good place to eat",
    "rating": 5,
    "date": "10/25/2023",
    "aspects": {
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Happy go friendly spot. Not too busy very clean.",
    "rating": 5,
    "date": "10/21/2023",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Super slow and rude staff.",
    "rating": 1,
    "date": "10/12/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I ordered a double quarter pound BLT. There was no bacon on the sandwich. The fries were ice cold and I wasn't given any ketchup so I wasted money ordering a large as I had to dump all of them. DID NOT ENJOY MY MEAL.",
    "rating": 1,
    "date": "10/11/2023",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Awesome customer  service very  helpful",
    "rating": 5,
    "date": "08/23/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "What’s with the wait for them to finish their conversation! before even bothering to look at you and take your order! slow and bad service!",
    "rating": 2,
    "date": "08/22/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Super dirty. Awkward seating. Decent service and friendly people though. I just hate the dirtiness.",
    "rating": 2,
    "date": "08/12/2023",
    "aspects": {
      "Service": "Neutral",
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "had an issue with the app but Jess helped take care of everything and was the best service I ever had in my life",
    "rating": 5,
    "date": "08/10/2023",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "As a delivery driver who goes to many restaurants. This McDonald's has the best staff.",
    "rating": 5,
    "date": "08/08/2023",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "STAY AWAY.  it doesn’t matter when you go there busy or not, this place is a disaster.  Dirty, staff are slow and all look angry and not at all helpful.",
    "rating": 1,
    "date": "08/05/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Why have 'serving now' sign if you close orders in the system as 'complete' when they obviously aren't?<br><br>The staff here completely ignore the mobile pick up table and you have to yell to get their attention",
    "rating": 2,
    "date": "08/04/2023",
    "aspects": {
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Decent place for Toronto downtown",
    "rating": 4,
    "date": "07/19/2023",
    "aspects": {
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Fast food is not fast any more.<br>One of the most if not the most unorganized locations, it toke them 20 minutes for a breakfast sandwich and a coffee and orange juice yet & its a Mobile order<br>The manger was so rod and angry screaming at people saying she is not taking any more orders i really think if you are not happy with your job just change it do not take it on your paying customers i will never order or dine at this location if I will die from hunger",
    "rating": 1,
    "date": "07/17/2023",
    "aspects": {
      "Location": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Got a fish fillet meal, it was very underdone, greasy and cold. Won't be returning.",
    "rating": 1,
    "date": "07/16/2023",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I recently had an bad experience this morning with McDonald’s at this location. I ordered chicken McMuffin, two wraps and a blueberry flavour smoothie. When i went for collecting the stuff for pick up order, the smoothie was half in the large size cup and the employee their gave me excuse that the ice in the smoothie melt that’s why its half i said it should be full either way then he take it old one with him and another girl employee came after 5 minutes with same smoothie putting ice to cover it up i guess said the machine is not working and all. I said okay I’ll manage this time, when i came home with my order and i tasted the smoothie It was totally ice and thick ice literally. They literally lied to me i have to garbage the whole thing but I’m not letting it go until they gave me refund and another thing the Chicken McMuffin’s chicken patty and bread was too old or frozen something I literally been into vomit!!! The wraps were okay but the other two things are just worst! Idk what mcd tryna do but its totally not tolerable!",
    "rating": 5,
    "date": "07/09/2023",
    "aspects": {
      "Taste": "Neutral",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The king and bathurs location is full of lazy workers… at least 30mins wait for everyone who order something there… half order served, coffee cold and the worse thing, they don’t even care… manager doesn’t even care about customer service, such a rude person, i hope this McDonald’s fire all these people before they close that disgusting location",
    "rating": 1,
    "date": "07/08/2023",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative",
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Place is understaffed and run down. Kiosk machines were dirty and the whole place was just a mess.",
    "rating": 2,
    "date": "07/04/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The place is so busy and understaffed.  I feel bad for them.  The tables didn't get wiped down regularly and the bathrooms were so busy. Koodos to the staff though. They work so hard.  Please management, help your staff and get more on the line.",
    "rating": 3,
    "date": "07/03/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I just go to get an ice cream cone. I'm not sure why, but I love McDonald's ice cream",
    "rating": 3,
    "date": "06/06/2023",
    "aspects": {
      "Desserts": "Neutral",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Restaurant cleanliness was nicely maintained by the staff Diana , her efforts to keep the place neat & tidy was commendable.",
    "rating": 3,
    "date": "05/29/2023",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "By far the worst McDonald's I've ever been to. Never visiting again.",
    "rating": 1,
    "date": "05/28/2023",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "There was a BITE taken out of the apple pie I bought. I called the store and they did nothing . Absolutely disgusting .",
    "rating": 1,
    "date": "05/18/2023",
    "aspects": {
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "No frills and food is standard however the customer service is good.",
    "rating": 4,
    "date": "05/13/2023",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Slowest McDonald’s downtown - staff are always friendly tho.",
    "rating": 3,
    "date": "05/10/2023",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "the dining room closes at 11 and they only accept mobile orders after 11 pm so it's a bit of a bummer, but the food is pretty good",
    "rating": 4,
    "date": "05/10/2023",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I visited this McDonald's not long ago, and my experience was quite pleasant. The staff were approachable and knowledgeable, the range of products was extensive, and the prices were attractive. The location was easy to access and clean. Overall, a satisfying visit that I'd be happy to repeat.<br>Thanks",
    "rating": 5,
    "date": "04/24/2023",
    "aspects": {
      "Service": "Positive",
      "Price": "Positive",
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Rude, poor quality of food. Ordered a McDouble with mayo (not provided despite extra cost) Slow service during slow traffic hours (1:30am) go somewhere else, just overall poor service and poor quality and lack of care.",
    "rating": 1,
    "date": "04/20/2023",
    "aspects": {
      "Service": "Negative",
      "Price": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I love McDonald’s coffee.",
    "rating": 5,
    "date": "04/17/2023",
    "aspects": {
      "Drinks": "Positive",
      "Taste": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Super lazy staff, don’t come here for wasting your time",
    "rating": 1,
    "date": "04/07/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Went there for takeout, usual mcdonalds quality, small and clean place but very very slow service.",
    "rating": 3,
    "date": "04/03/2023",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Might be the worst location ever. No sense of urgency.",
    "rating": 1,
    "date": "03/23/2023",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Their  buns are always stale, they throw everything together haphazardly and the chicken on their big Mac tastes like dried day old garbage. Much better quality and service at the liberty Village King location.",
    "rating": 1,
    "date": "03/19/2023",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Taste": "Negative",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Decent place, typical of chain",
    "rating": 4,
    "date": "03/18/2023",
    "aspects": {
      "Location": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I wish there was a McDonald's near king and Bathurst where you could pickup food yourself without paying uber eats.  This location is primarily for food delivery services only, avoid if you are a regular walk in or pickup customer.",
    "rating": 1,
    "date": "03/09/2023",
    "aspects": {
      "Service": "Neutral",
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "You should go to somewhere  Else",
    "rating": 1,
    "date": "03/02/2023",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Fast paced, very friendly",
    "rating": 5,
    "date": "02/25/2023",
    "aspects": {
      "Ambience": "Positive",
      "Service": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Just by having a sip of their coffee I was completely appalled. Dirty establishment, horrible goods.",
    "rating": 1,
    "date": "02/22/2023",
    "aspects": {
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Where is the manager night time, those male servers just talking each others people waiting lines.",
    "rating": 1,
    "date": "02/18/2023",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This place catches a ton of flack because it’s in a busy area with drunk people coming in from the bars but the staff has always been super friendly especially in the mornings.<br><br>Went in today, totally messed up my breakfast order on the app, and even though it was my fault they gave me an extra breakfast sandwich (the one I originally wanted) for free.<br><br>Made my day.",
    "rating": 5,
    "date": "02/17/2023",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative",
      "Menu": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "We headed to MCs several times before the discount coupons expired. Had the egg/bacon/English muffin combo with small fries and a small cappuccino for just CAD4.99 before tax! Always a cost effective comfort :)",
    "rating": 5,
    "date": "02/12/2023",
    "aspects": {
      "Price": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I would like to make a recommendation for staff to please wear hair nets. I went there tonight and was shocked that they were not wearing any. I also found a few hairs in my fries.",
    "rating": 1,
    "date": "02/04/2023",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Employees not with attention to work and distracted !<br>AGAIN  waited 10 min just to get coffee, meanwhile customers that came after me got their order faster and weren’t just coffee!!!",
    "rating": 1,
    "date": "01/30/2023",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Never order from this location again, seems the staff here will just throw drinks into a bag and ruin your whole order. Didn’t pay to get soggy, ruined food. Save your money and order from another location instead.",
    "rating": 1,
    "date": "01/27/2023",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This location sucks so bad. Like so bad. It is simply awful.<br><br>Excluding some stand-out members the majority of staff completely ignore you and quietly mumble your order number. They are extremely slow (once waited 1 hour for them to make fries via Ubereats?!) and almost always make your order wrong (once ordered a Mcdouble and all I got was the bap) or forget items (they have forgotten my hash browns over 10 times now).<br><br>Given this place too many chances. Going to be spending my money elsewhere and recommend you do too.",
    "rating": 1,
    "date": "01/22/2023",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Not healthy..... Would avoid",
    "rating": 1,
    "date": "01/18/2023",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I guarantee you cannot find a worse McDonald’s with slower service in the whole of Toronto. You go to pick up your food from a mobile order and treated to slow service, and like you don’t exist. Your food will be sat there with all the staff laughing in the back or just straight up ignoring you.<br><br>Just a terrible experience all around. Did I mention this branch on recently have lettuce stocked? No lie",
    "rating": 2,
    "date": "01/16/2023",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I feel for the people who work at this location. They deal with a lot.",
    "rating": 2,
    "date": "01/11/2023",
    "aspects": {
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Need hamburger early please",
    "rating": 3,
    "date": "01/11/2023",
    "aspects": {
      "Menu": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This location is the slowest, most disorganized location in all of Toronto. Just brutal. Go to the Queen and Spadina location instead.",
    "rating": 1,
    "date": "01/07/2023",
    "aspects": {
      "Location": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This place is weird. It tookages to get the food. They had alot of orders but they were working so slow it was odd considering how busy it was.<br>I used to work in mcdonalds for context",
    "rating": 2,
    "date": "01/01/2023",
    "aspects": {
      "Food Quality": "Neutral",
      "Service": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The employee's literally avoid eye contact and carry on wearing their airpods and having a full out convo in their language.  Like I do get it ..it's fast food but you would expect some kind of professionalism. Service garbage food cold employee's I hope they have their airpod charger on shift.  The manager is a next clown he too busy flirting with the employee's to even care about customers waiting for the food. Definitely avoid this spot late night.",
    "rating": 1,
    "date": "12/11/2022",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This place has gotten alot better than a few years ago. The area is more pleasant than before when you sometimes felt slightly uncomfortable.",
    "rating": 4,
    "date": "12/10/2022",
    "aspects": {
      "Location": "Positive",
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Possibly the worst managed McDonald’s in the city. It’s filthy, stale fries, stale buns, and watered down drinks. Please get it together.",
    "rating": 1,
    "date": "12/01/2022",
    "aspects": {
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Busiest McDonald’s so far. But ordering through the app makes it fast.",
    "rating": 3,
    "date": "11/28/2022",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This is the world’s slowest and least competent mcdonalds",
    "rating": 1,
    "date": "11/27/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Terrible service. Staff is slow and stand's around doing nothing. I witnessed my order that has not been served yet removed from the board to throw off the internal metrics for order processing times. Won't be back.",
    "rating": 1,
    "date": "11/12/2022",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I actually ate all 3 burgers but I ordered and payed for a double big mac and got a single thats my only complaint",
    "rating": 4,
    "date": "11/09/2022",
    "aspects": {
      "Food Quality": "Positive",
      "Menu": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Be ready to wait. Not the worst mcdonalds i’ve ever been to!",
    "rating": 3,
    "date": "11/06/2022",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Im an Uber driver. This Mcdonalds is ALWAYS busy but remains understaffed. Especially at night.",
    "rating": 1,
    "date": "11/05/2022",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Food - I haven't got it yet<br>Service - \"You'll get it when we feel like giving it to you\"<br>Atmosphere - King St.",
    "rating": 2,
    "date": "11/04/2022",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Worst Mc Donald’s experience ever. Waited for over 35 min for my order. Restaurant was clearly unstaffed, and not trained. This is fast food not fine dining! Wake up ! Gives those employees training and more coverage !",
    "rating": 1,
    "date": "10/30/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Always crowded and much very well organized or clean.",
    "rating": 3,
    "date": "10/28/2022",
    "aspects": {
      "Food Quality": "Positive",
      "Location": "Positive",
      "Ambience": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Fast and Friendly staff!",
    "rating": 5,
    "date": "10/21/2022",
    "aspects": {
      "Service": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Did not ask how I take my coffee 😂 yeah go figure",
    "rating": 2,
    "date": "10/18/2022",
    "aspects": {
      "Drinks": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Not bad. Busy downtown location, a lot of delivery guys picking up at all times, but the service is still pretty fast. Service is friendly and the quality is... still McDonalds, but not completely neglected like some fast food.",
    "rating": 4,
    "date": "10/15/2022",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Location": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Poor service. Doesn't listen to customer requests",
    "rating": 1,
    "date": "10/06/2022",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Slowest spot in Canada. The employees here keep complaining that they don’t have enough staff, consistently slow. 25-30 for a coffee and muffin.",
    "rating": 1,
    "date": "10/05/2022",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I sympathize with the staff at this McDonalds. It’s congested, understaffed, and clearly management doesn’t care. The bad reviews are accurate, but direct your frustration at McDonalds and not the workers. After all, this is McDonalds, your food and nutritional concerns are tuned in a boardroom. Your long wait time is just a statistic to McDonalds. Consider visiting the independently owned Shawarma place next door.",
    "rating": 1,
    "date": "10/05/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "wrost McDonald's ever. Ordered things and they didn't give me my Hamburgers and let me wait extra time.",
    "rating": 1,
    "date": "10/03/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "THEE SLOWEST McDonalds in the history of the world. And they got our order wrong.",
    "rating": 1,
    "date": "09/29/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I just waited 25 minutes to get this simplest order. I asked for refund and they told me to just wait for the order even though I said I didn't want to wait. The food was cold. I'm never coming back to this location EVER.",
    "rating": 1,
    "date": "09/16/2022",
    "aspects": {
      "Service": "Negative",
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "One of the worst McDonald's - I love Maccies but they always get your order wrong, forget ingredients and seem to be the slowest workers they can find. Disappointed it is my local.",
    "rating": 1,
    "date": "09/02/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "People who work here are lazy and the ice cream machine is always out of order 🙄",
    "rating": 1,
    "date": "09/02/2022",
    "aspects": {
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "It is extermly hard to communicate with the people that work overnight. I came to pick up my food at 4:30 am. I knock the door so hard because the music is too loud. Unprofessional.",
    "rating": 1,
    "date": "08/24/2022",
    "aspects": {
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I came to this Mcdonald’s today with 3 friends and had such a wonderful experience! We came in, the atmosphere was friendly, welcoming, and so quick and efficient. Once we all had our food and were eating, 2 of the most kind and caring workers came and offered us 3 free apple pies! They said it was because we were nice, quiet and caring customers, and also complimented us all saying we were pretty. This absolutely made our day and we are so impressed with their hospitality and service! Best Mcdonald’s experience we have all ever had, and they were the best employees we have ever met, they deserve a raise!",
    "rating": 5,
    "date": "08/23/2022",
    "aspects": {
      "Service": "Positive",
      "Ambience": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "cant go here anymore cuz stuff consistently comes out undercooked or doesnt come out at all. Love spending $4 for a cut potato after waiting in line for 20 mins",
    "rating": 1,
    "date": "08/21/2022",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive",
      "Desserts": "Positive",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Worst service. Waited almost an hour in drive thru only to find out they dont have any ice-cream. This was an online order and   I had already checked in on the app. So disappointing 😡🤬🤬",
    "rating": 1,
    "date": "08/21/2022",
    "aspects": {
      "Service": "Negative",
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Not too busy. The only option available for me being vegetarian is fries and drink. Currently using mobile app code to get $1 any size drink or ice coffee.<br>Super cheap deal till so far",
    "rating": 4,
    "date": "08/20/2022",
    "aspects": {
      "Price": "Positive",
      "Drinks": "Neutral",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Big Mac is the most quality base burger.",
    "rating": 4,
    "date": "08/08/2022",
    "aspects": {
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Empty restaurant, I ordered two drinks, I paid at 3:41 pm, while I'm writing this review it's 3:53 and I haven't received my order... OMG... where is the customer service?",
    "rating": 1,
    "date": "07/30/2022",
    "aspects": {
      "Service": "Negative",
      "Drinks": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This is the worst McDonald’s branch in history after 10 pm. So slow. 7/10 times food is cold. Easily could wait for 15-20 minutes for a Big Mac. Staff so arrogant. I order from here at least twice a week and never had a good experience.",
    "rating": 1,
    "date": "07/28/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Bad customer service & slow",
    "rating": 1,
    "date": "07/23/2022",
    "aspects": {
      "Service": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Absolutely unbelievable, I usually order from this McDonald's and have never had an issue with it here.<br>But recently I ordered 2 happy meals here along with medium fries, and when I got home it turns out they only gave me my medium fries and not my 2 small fries that were part of the happy meals! They also didn't bother putting my meals into the regular happy meal boxes, and just carelessly threw everything into the bag, and if they were busy I understand, but THEY WEREN'T! Absolute scam and waste of money",
    "rating": 1,
    "date": "07/16/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This restaurant is extremely unorganized is constantly messing up orders.   Try another McDonald's, the management does not care.",
    "rating": 1,
    "date": "07/16/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I waited 20 min for a coffee and a muffin",
    "rating": 1,
    "date": "07/02/2022",
    "aspects": {
      "Service": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Missing 4 mcnuggets out of 6 and fries aren't salted",
    "rating": 1,
    "date": "06/26/2022",
    "aspects": {
      "Desserts": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Guy an iced coffee and KitKat mcflurry but I got a Skor instead had to wait around 15 mins for iced coffee and a<br>Mcflurry",
    "rating": 1,
    "date": "06/18/2022",
    "aspects": {
      "Service": "Neutral",
      "Drinks": "Neutral",
      "Desserts": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Terrible lineups at night, locking customers outside of the store in the middle of winter while waiting (too long) for orders alongside closing on random nights.. Some people depend on you to eat at night",
    "rating": 2,
    "date": "06/18/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative",
      "Ambience": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "This mcdonalds is on the slow side.....hate standing in line when nothing but mobile orders are being completed.<br><br>I avoid ordering uber eats from this specific mcdonalds.....tons or couriers that are well not nice but not the restaurants fault",
    "rating": 3,
    "date": "06/15/2022",
    "aspects": {
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Food was very disappointing. Ordered the McChicken Meal. Fries over salted so threw it away. Chicken was poorly dressed. Sauce on side of bun and lettuce in container. So had to assemble myself. Coke was flat.",
    "rating": 3,
    "date": "06/09/2022",
    "aspects": {
      "Food Quality": "Negative",
      "Desserts": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Very bad place I came here for picking up my food at night around 2 they were doing nothing just  ignoring people",
    "rating": 1,
    "date": "05/25/2022",
    "aspects": {
      "Location": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Worst McDonalds in Toronto. Avoid at all costs!",
    "rating": 1,
    "date": "05/25/2022",
    "aspects": {
      "Price": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Worst McDonald's I've seen.<br>Some of their staff shouldn't even work there as their ability to work is almost zero. Management is probably non existent. Always messing up people's order, and when customers report, they argue with them. I would give negative star if I could.",
    "rating": 1,
    "date": "05/14/2022",
    "aspects": {
      "Service": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The McDonald at downtown is a place to go !",
    "rating": 5,
    "date": "05/07/2022",
    "aspects": {
      "Location": "Neutral"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "As usual, great place, but be aware that after 21.00 , I think, you can just order online and they close the dine in option",
    "rating": 5,
    "date": "05/04/2022",
    "aspects": {
      "Location": "Positive",
      "Price": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "I find that when you go to macdonalds and because there is only take out .what you order is not what you get and is really bad when you find that what you ordrr in not.like you ask for a double double  coffee and you get not sugar. Is a mess",
    "rating": 5,
    "date": "05/02/2022",
    "aspects": {
      "Drinks": "Negative",
      "Food Quality": "Negative",
      "Taste": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Excellent Service Fresh Fast Food Friendly Staffs Great for Family",
    "rating": 5,
    "date": "04/23/2022",
    "aspects": {
      "Service": "Positive",
      "Food Quality": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Quality is great. I enjoyed my  mochachino.<br>I love my quarter pounder with cheese combo as does the fictional character Kinsey Milhone.",
    "rating": 5,
    "date": "04/15/2022",
    "aspects": {
      "Food Quality": "Positive",
      "Taste": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Easily the worst McDonald's in Toronto - dead serious. Everytime I've ordered the eggs tasted funky, bread is stale, and the coffee tastes burnt and weird. Really frustrating and it seems to be the case at all times of day.",
    "rating": 1,
    "date": "04/14/2022",
    "aspects": {
      "Taste": "Negative",
      "Drinks": "Negative",
      "Food Quality": "Negative"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "The food was amazing and the people who work there are humble",
    "rating": 5,
    "date": "03/29/2022",
    "aspects": {
      "Food Quality": "Positive",
      "Desserts": "Positive"
    }
  },
  {
    "restaurant": "McDonald's",
    "review": "Says open 24 hours but IT IS NOT. Door locked, only handing out food for delivery services.",
    "rating": 1,
    "date": "03/29/2022",
    "aspects": {
      "Service": "Negative"
    }
  }
]